[
  {
    "speaker": "Guest",
    "content": "To me, that's the north star. Is what are the people who work with me, or the people who potentially want to work with me. How how do they think I'm doing? Um, as long as they're happy with me, I feel good, but you can't please people all the time, especially not in crypto. You're always going to be pissing off somebody, so um that's just kind of the name of the game."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, that's um that's the signal. Everything else is just noise. Coming, coming from everyone else, so."
  },
  {
    "speaker": "Guest",
    "content": "Exactly."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Exactly."
  },
  {
    "speaker": "Rob",
    "content": "Okay."
  },
  {
    "speaker": "Guest",
    "content": "Um and the, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Sure."
  },
  {
    "speaker": "Rob",
    "content": "And then the, yeah, the. Any contrarian takes on stablecoins and regulation, uh, in the in the great."
  },
  {
    "speaker": "Andy",
    "content": "And the, and the on-chain price discovery kind of like, tied in there but I think you addressed it."
  },
  {
    "speaker": "Guest",
    "content": "I'll do, I'll do, I'll do on-chain price discovery."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. So with with on-chain price discovery, um I I I'm I'm a little more circumspect about on-chain price discovery than you are. Um so with on-chain price discovery two things. One is that we've seen this before. When did we see it before? The answer, you said it earlier, is DeFi summer, right. DeFi summer, everything was launching on-chain, there were these IDOs and Uniswap launches and that was the first place that everything listed. And you really wanted the alpha, you had to go buy it on-chain, right. And um, I I think these are usually a sign of not necessarily like, oh my God, now everything's being democratized. It's usually a sign of like, oh, there's a new speculative frenzy and like the game is you got to be the first, and to be the first means you got to be on-chain to go grab it early before it gets listed, right. Uh and that that being said, like, you know, folks like yourselves, you have the alpha and you're advising a lot of your listeners to like, go get the alpha which is go buy it before it gets listed. Um, but I don't think it's to say, okay, great now everything's democratized and these things are never going to get listed. You're buying it early because you want it to list on Binance. You want it to list on Coinbase, and when it does, it's going to rip, right. Because it's going to get access to a new layer of retail that's getting in later than you are. So, you know, when it gets the up, a listing it's like, yo I told you to get it on-chain, you know, props to your boy. So I I I don't think it's It's I don't think you're hoping that these things never get listed."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I mean, It's."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I know, exactly. I mean, it just gives, it gives the common folk, if you will, you know, I know you're, you know, you, you're in the Ivory Tower of Dragonfly, but it gives the common folk."
  },
  {
    "speaker": "Guest",
    "content": "No, no, no. That's what I'm saying. That's what I'm saying. Look. The common folk, you're, you're not the common folk, my friend. You run a fucking podcast. You've got 50,000 followers. You're you're not a common folk, right. The common folk are the people who are buying on upbit."
  },
  {
    "speaker": "Andy",
    "content": "Upbit."
  },
  {
    "speaker": "Guest",
    "content": "Those are the common folk."
  },
  {
    "speaker": "Andy",
    "content": "Upbit, right. Exactly."
  },
  {
    "speaker": "Guest",
    "content": "Those are the common folk."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah, yeah. I I mean, look, it is ultimately, markets are zero-sum. Crypto is positive sum in the world but, I mean, yeah, I think you're right. I think that is a bit of, that is a bit of a reality check there, so."
  },
  {
    "speaker": "Guest",
    "content": "That's a bit of a reality check."
  },
  {
    "speaker": "Andy",
    "content": "It's always going to exist."
  },
  {
    "speaker": "Guest",
    "content": "So, I look, I'm just tempering, I'm tempering your, that being said, look, I'm a I'm a DeFi bull. I'm a DeFi bull. I love fucking DeFi. I love to see more price discovery on-chain. We're investors in a lot of this stuff, you know. Um, but I also think that CeFi clearly has a huge role."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "It is the connective tissue with the old world and where people have most of their money. Most people don't live on-chain yet, and until they do live on-chain, CeFi is really important to actually get people, to to get their money into this ecosystem. So I don't think we should be, um, shitting on it. I think it's a really important part of what makes the whole system work. Um, but uh you know it's kind of like um um I don't know it's um you know again, to give another tortured example, it's kind of like AOL, if I'm you know, dating myself to like, way back in the day. AOL, for many people, was the first way they got online. Uh AOL, for those who were not American, America, AOL is America Online, which was this, this service that brought a ton of people online back in the 90s and early 2000s. And um, you know, there's kind of a walled garden that a lot of people would live on these AOL chat rooms and they thought AOL was the internet. And of course it wasn't, there was much more to do outside of just AOL. But AOL was really important for getting people online and getting them the their first kind of training wheels, experience with the internet. And that's kind of what exchanges are. You know, to many people they think exchanges are crypto. And you ask them like, oh, do you, do you interact with Ethereum? And they're like, yeah, yeah, yeah you know I buy ETH on Coinbase. Uh and they're like, no, that's not Ethereum. Ethereum is like a whole platform. Um, that's okay. It's totally okay. It It It's completely fine that people's first experiences with crypto are with Coinbase. Maybe later, they're next experience will be with Coinbase Wallet. And then maybe eventually they'll like, you know, get further and further upstream into like, the craziness that you and I live in. Um, but you, you got to let them do it at their own pace."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I mean, It's, not everybody's going to start in the deep end of the pool."
  },
  {
    "speaker": "Andy",
    "content": "It's very clear that on-chain price discovery benefits those who are on-chain. I mean, that is a very clear objective reality, so have to kind of like temper yours."
  },
  {
    "speaker": "Guest",
    "content": "But it also, but importantly, importantly and to, to, here's, here's where I totally agree with you is that it lowers the cost to entry."
  },
  {
    "speaker": "Andy",
    "content": "Yes."
  },
  {
    "speaker": "Guest",
    "content": "So, you know, because there's now on-chain price discovery, you don't need to pay listing fees."
  },
  {
    "speaker": "Andy",
    "content": "You have a phantom wallet to pay listing fees."
  },
  {
    "speaker": "Guest",
    "content": "You don't need, yeah."
  },
  {
    "speaker": "Andy",
    "content": "You have 100 dollars of SOL as a as an average Joe, or as a project, you can spin up and go, and you can have a community and so that is the, I think that is probably more exciting."
  },
  {
    "speaker": "Guest",
    "content": "Exactly."
  },
  {
    "speaker": "Andy",
    "content": "That's the more exciting part. Obviously getting in early and then dumping on people is like, that's how markets work, unfortunately, but that is, it's it's, actually fortunate because it's a, a mature form of value creation and value pricing. However, uh, you know, I mean the reality is, getting in early on-chain dumping on sexes is kind of like, what people want to do, but I think it's actually launching projects and then having anybody with a bit of SOL, a bit of ETH can participate early. Like you know, like, you would on on your ventures arm, like, I would on our venture's arm for a project that is like, you know, raising it's it's, almost similar for almost a similar level playing field, however, there is kabals. There is on-chain, kabals, times. It's worse than the SEC. It's worse than the SEC."
  },
  {
    "speaker": "Guest",
    "content": "Always, always."
  },
  {
    "speaker": "Guest",
    "content": "And the same thing is exchanges, right. The like all that shit. All that shit. Being on-chain, humans are humans."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah."
  },
  {
    "speaker": "Andy",
    "content": "It's always going to exist."
  },
  {
    "speaker": "Guest",
    "content": "Exactly. Being on-chain, it doesn't solve any of that. It doesn't solve any of that. It just makes it more visible."
  },
  {
    "speaker": "Andy",
    "content": "No, humans are humans."
  },
  {
    "speaker": "Guest",
    "content": "Exactly."
  },
  {
    "speaker": "Guest",
    "content": "So, the, the last, last point that I'll make and I'll, I'll, I'll wrap this since I, I, didn't get to all your questions but, uh, whatever. I'll, I'll give you one last thing at the end. So, uh, I made the point earlier that I thought AI was going to be deflationary, right. And that was going to massively lower the cost, such that people won't need to raise millions of dollars in order to go write some smart contracts and deploy it on-chain. And in the same way, you know, one of the things that DEXs do is they make it so that people don't have to pay, you know, hundreds of thousands of dollars and go, you know, do all this bullshit to get listed on Binance or Coinbase in order to get their token traded and to get a holder base. You can just go on Uniswap, you can go on Radium and boom even if 20 people want to buy your token, you have 20 holders now, you know. And that wasn't possible in a pre-exchange world. Or sorry, a pre-DeFi world. So, those, those things are real improvements. Now, one thing that you might think, given my description, is that, okay, well, doesn't that put a VC out of a job? If you don't need to go raise money to get listed and you don't need to raise money to write smart contracts, and you don't need to raise money to do, you know, all this stuff just gets cheaper and cheaper and cheaper, then doesn't that mean that VCs, okay well, it's kind of done. Now it's just, you know, it's going to be retail investors and people just, you know, buy."
  },
  {
    "speaker": "Andy",
    "content": "Toss AI in there as well. You've got yourself a."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, toss AI, yeah."
  },
  {
    "speaker": "Andy",
    "content": "Toss AI in there as well and you've got yourself."
  },
  {
    "speaker": "Guest",
    "content": "Exactly. AI is going to do it all for you, and why do you need VCs? And I, I, I, think to me the answer is, clearly no. Clearly no. Um, now why do I say that? Uh, is because think about the internet. Think about, think about actually the business you guys run, The Rollup, right. Uh, you guys have a website, you guys have a podcast, you guys have, you know, all the stuff you guys run and your own community. Um, if you, if you were to rewind the clock back to, let's say, early 2000s, right. Uh, in the early 2000s, if you wanted to launch a website, you needed to buy your own server, and you needed to, you, like, you have your server at home, which, you know, a very expensive investment to buy a server. And you run your server, and you manage it and you do the upkeep yourself. You probably have to go hire a SysAdmin and let them SSH into your server so they can run it because it's very difficult to administrate a server at that point in time. Uh, and like that's the startup cost to just run the kind of business you guys are running. If you just want like a normal fucking website and a chat room, you had to buy 20,000 dollars of hardware and like, pay a SysAdmin to run for you, right. And with the advent of cloud computing and you know, infrastructure as a service and platform as a service and all this stuff getting automated, and no code, and Discord and blah, blah, blah all this stuff, now you know, what did you guys need to get started? Probably like, you know, 100 bucks in order to start your company, right. Like that's all it really took to just have a website, a Twitter account, a Discord like all this stuff that used to cost 20,000 dollars startup cost, now cost almost nothing, right. Now you might ask the question of, okay, well, does this mean that VCs are out of a job? Like no. The answer's fucking no, of course not. VCs still have jobs because there's still going to be really difficult moonshot projects that are capital intensive. But the capital now doesn't get spent on stupid shit that's really easy now, right. So, like nobody is going to pay you, like you would not want to sell equity, because oh we need to buy a server and pay a SysAdmin to run a server for The Rollup, right. Like imagine you had to sell 20% of your equity to do that shit. No, that's a worse world, right. It's a better world if you're like, look I want to scale The Rollup up and build a much bigger media empire, and do all this other stuff, and for that I do need capital. Uh, that is where a financier, a VC, whatever, makes sense. And there will always be ambitious projects, that want to do something bigger, than just the thing that's been deflated down because it's gotten cheaper, right. So yeah, I, I'm very happy, that as a VC, my money's not going to be going towards you know, paying millions of dollars for, you know, fucking."
  },
  {
    "speaker": "Andy",
    "content": "Smart contract audits."
  },
  {
    "speaker": "Guest",
    "content": "All this other stuff. So."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Shit, legal counsel."
  },
  {
    "speaker": "Guest",
    "content": "Exactly, like all this stuff. The, the cost of all this stuff will go down, great. I didn't want to be spending my money on that. Um, but you know there will still be projects that are capital intensive and require big moonshot things. And of course there are some things that the spending is zero-sum. Right. If you want to buy attention, the money, the cost of attention is not going to go down, if anything, it might actually go up. Um, and so these kinds of things that you're going to be paying money for, the opportunity cost of other people, they're not going to change. Uh, and so those things are where your money will be going, and not towards the things that are going to be collapsing in cost. So it's not as though post-cloud computing, startups are now incredibly cheap, and nobody pays any money to anything, and everything, you know, you can build companies for, you know, 100 bucks. You, you can, you can, launch the start the, the, the, software stuff for 100 bucks. But the rest of it still cost money, and the same thing is going to be true in a post-AI world for crypto startups."
  },
  {
    "speaker": "Andy",
    "content": "Yep."
  }
]