[
  {
    "speaker": "Rob",
    "content": "Bitcoin like in institutional blockchain, private blockchain wave, and like, I don't know if that ends up taking fold, but if there's a private blockchain out there that can kind of gatekeep its its realm and you can have confidential data in there and keep things private whether through, you know, ZK or FHE like, you know, blockchain and at least these cryptographic patterns are still impactful on AI. And so maybe not necessarily blockchains, but a lot of the research that blockchains have been able to en- enable and em- empower given ZK, FHE, some of these adjacent verticals I think are going to have a lot more directional causality on AI than some of these other things that have been influencing crypto backwards, you know, for up until this point. Um, we're still we're going to see how it plays out, but I I think it is a lot more balanced with this particular narrative or cyclical and convergence than it has been for a lot a lot of others in the past."
  },
  {
    "speaker": "Guest",
    "content": "Totally. I think one other area where I expect there to be, well, not expect, but I think there's likely to be some convergence is um, when it comes to authentication of media."
  },
  {
    "speaker": "Rob",
    "content": "Yep."
  },
  {
    "speaker": "Guest",
    "content": "Mhm. So if you think about, you know, the amount of synthetic media that's now getting generated by AI, it's just it's fucking crazy. And, you know, I can already see it again, you know, might just even my Twitter responses, right? Even just in text. Some of them are really obviously AIs that are responding to me, right? I can just tell people are putting in prompts and it's just, you know, nobody capitalizes that much when they're responding on Twitter if they're a real person. But, um, you know, when when you see what Sora or Kling or, you know, these new video models and obviously the image models are are way past that point where you just really don't know without having some kind of chain of custody of the media that you're looking at um or some kind of authentication of this was actually taken on a real attested sensor or some kind of physical proof that this really happened. Um, every media that you're going to see pretty soon, um, is going to be suspect by default. And you know, it's it's it's already the case that people have built these antibodies against many forms of media. So you know, if you see like an image of Barack Obama, you know, making out with some stripper, um, you're like, 'Okay, you know what? I even if I can't detect any, 'Oh, here's the edge in the Photoshop where they like didn't get get the lighting exactly right.' I'm like, 'Look, this is probably not real unless I can like go find a trusted source for this,' right? Um, and I think, uh, once that becomes everything and it becomes like not just like, 'Okay, every once in a while I see some crazy photo that I'm like I don't know if I believe this.' Literally everything because it's just going to be so fucking cheap to generate synthetic media of anything that is completely believable. Um, it's just going to be a wash in in synthetic media and uh, having some way to authenticate where real media com- came from and and was attested to. I think is going to be a big part of our information supply chain as we're thinking about, you know, I I'm imagining at some point you you know, your browser bakes this in directly where you mouse over an image and you see, 'Okay, you know, here's Barack Obama making out with a stripper,' and as you mouse over it, you get this little green checkmark that says, uh, you know, 'This was uh, signed by,' you know, blah, blah, blah, you know, posted on some blockchain by, you know, some media company.' You say, 'Aha! I know that this was actually attested to by, you know, the AP and by, you know, WaPo so this was real. Barack Obama, you know, whenever he got caught in the strip club or what- whatever it was.' Um, so that that that feels like a future that we have to get to. And we have to get there pretty soon because that deluge of synthetic media is basically like right on our doorstep. Within the next year to year and a half, you're just going to see this stuff be everywhere."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. I I've heard Mark Andreessen and Balaji kind of kind of talk about this verifiability of the content. I I think it's called watermarking because there's some cryptographic hash underneath, and you can hover over it. I think it's inevitable that we get there particularly, um, I think I heard on a podcast by the next election cycle because you already started to have some of that in this past election cycle, but kind of forecasting to the next one with the abundance of media that is possible. Um, it it is only it is only like necessary it's only correct and necessary for that for this content to be verified in some way. And and you're right. I think I mean, what what you're saying here is that blockchain is the right technology for this cryptographic hash and and proof of verifiability, the attestation from the media company."
  },
  {
    "speaker": "Guest",
    "content": "Redstone is DeFi's modular Oracle supporting over 100 clients on over 50 chains offering 1000 assets. Redstone is the leader for Bitcoin staking and yield-bearing assets. They offer the most robust, customizable price feeds available in any model. Join the Redstone expedition today."
  },
  {
    "speaker": "Rob",
    "content": "Welcome aboard on our journey into the singularity. This is the endgame road map for Frax and Fraxtol, the new L2 out of the Frax ecosystem that is totally based on fractal scaling. Fraxtol, the modular L2 blockchain built by Frax with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images, and it explains how L2s become L3s, and the entire app chain life cycle goes through its evolution. The Frax ecosystem is made of some of the top builders in the space and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space, and this Fraxtol L2 joins the existing suite of Frax products, including Frax Swap and Frax Lend. You can see Frax Fairy, the bridge to go from any chain: Arbitrum, Optimism, or mainnet into the Fraxtol mainnet, bridge your tokens, and bring your Frax assets into the Fraxtol ecosystem. Join today to get the best out of Fraxtol. You are still early. Join today, take part in our expedition into the singularity."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Now the reality is that it's not the only way to do it. It is a very natural way to do it, but, um, all all these technologies. One of the things that you learn as an investor is that technology is super path-dependent. There there's not only one way that history can play out or that technology can play out. You know, did it have to be VHS versus Betamax? Uh, did it have to be, you know, DVD versus Blu-ray versus HD DVD? Um, a lot of times, it really depends on the right founder coming along and just fighting the good fight for a certain thing to win. Um, because it's certainly possible that the way that it wins is that, you know, Microsoft creates some consortium and everybody opts in and, you know, it's like DRM or something where, uh, everybody agrees to like this closed standard that is is, you know, gatekept by some big companies. Um, that's another way that it could it could play out or maybe it could be orchestrated by the government itself. That's another way it could play out. Um, so none of these things are for certain. Uh, it really depends on the right team, the right time, the right moment, uh, to for all these things to come together in just the right way. I I think with something like this, um, usually the rule of thumb in technology is that the solution doesn't get built until the problem is already like horrendously painful. You know? So it's not like, 'Oh yeah, I can see that coming. Therefore, let's all adopt this new standard and like start integrating this stuff into browsers and uh everybody start, um, uh, you know, building this watermarking standard into your image format. Uh, no, no, no, no. People are going to do this when it's already too late. Uh, when it's already too Oh my God. It has already arrived. Social media's unusable."
  },
  {
    "speaker": "Andy",
    "content": "Have you guys had the chance to invest in anything similar to this kind of like content verification?"
  },
  {
    "speaker": "Guest",
    "content": "Not not not yet, not yet. And I think it's it's one of these things that it really does matter whether you start uh too early. Like, it's it's you know if you look at the history of technology, um there are a lot of people who who had a pretty good idea how the internet was going to play out. And you know, you you saw in the dot com bubble, um, you know, the people who are building pets.com, they were right, right? That startup ended up becoming called Chewy much later, and it was successful. Um, or, you know, Webvan. Uh, they were absolutely right. You know, Instacart, Amazon Fresh delivering groceries, yes. Totally. It was gonna happen. Uh, but they were just way too early. And it doesn't matter if you're right if you're early. All that matters is that you arrive at the right time when all the ingredients are laid out for you to cook the meal you're gonna cook. But if you're like, 'Yo, I you know I'm gonna I'm gonna create this, you know, amazing five part meal, but I don't have any of the ingredients,' then tough shit. You know, your meal's gonna taste terrible."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Being too early is..."
  },
  {
    "speaker": "Andy",
    "content": "It's a good torture analogy."
  },
  {
    "speaker": "Rob",
    "content": "Exactly. Exactly."
  },
  {
    "speaker": "Andy",
    "content": "No, no. But being too early is often synonymous with just being flat out wrong, right? So you have to, timing is everything."
  },
  {
    "speaker": "Rob",
    "content": "Exactly."
  },
  {
    "speaker": "Andy",
    "content": "Um, all right. Let's see, well, as you spent, uh, as you said about half the time in your, uh, video and in your paper on AI, we spent about half the pod on AI, which I'm excited about. We have a ton of other stuff to cover it as well from your predictions list and just broadly, uh, looking ahead. Um, so I think one really cool thing, actually just real quick before we kind of close the loop on AI. Rob, if you have anything as well. Um, like the like the way that I'm thinking about this current AI cycle is, I I'm in agreement. I think that the AI agent fatigue happens quicker uh, than you do. 'Cause I think it happens within a quarter or two, not a year. Um, I think crypto moves too quick. Uh, but then I think the market matures enough such that right now it's..."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  }
]