[
  {
    "speaker": "Rob",
    "content": "Use it to introspect on themselves and to really examine their own goals and what they're doing well and what they're doing poorly. Um it's like you know if you're a manager, you need feedback from your reports. You need them to actually tell you what you're doing wrong. If you're not getting that level of feedback, you're just not improving as a as a manager."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Exactly. In a similar way that I think money amplifies/shows people who they really are and shows the world who people are. I think agents and AI are going to amplify high quality entrepreneurs and high quality businesses and also show where the there's a clear distinction between those with high levels of managerial skills and communication skills and also disciplinary beliefs internally and those who don't. And so, this kind of divergence is going to play out across many different areas of life, and I'm glad to be on the human side with you boys. Let's let's keep it human this year, all right?"
  },
  {
    "speaker": "Rob",
    "content": "Likewise, likewise."
  },
  {
    "speaker": "Andy",
    "content": "Let's keep it human."
  },
  {
    "speaker": "Rob",
    "content": "Absolutely."
  },
  {
    "speaker": "Andy",
    "content": "All right, moving from AI, um tons of really cool predictions across the board. We can kind of go rapid fire style here um but you know, we don't have to touch on them all if we get looped in, we can just hang out. So one of them was around let's start with the growth of EVM market share, so getting a bit more into the crypto weeds to start. Um we are big alt-LVM uh people here. Uh we think that we are excited about Movement. We're excited about Eclipse. We're excited about Fuel. We're excited about all these different iterations of scaling Ethereum horizontally without needing to rely on the EVM. However, with Bear Chain and Monad this year, as well as projects like Mega ETH, there's a clear return to the EVM. Um so, we were just talking about AI, and I'm curious uh as to your point uh uh with regards to the level of um of ease for agents to actually program in the EVM being a big reasoning for why this thesis is kind of like a big one of yours for 2025. So, yeah, man. I mean if I was to say that I think this is wrong because I think alt-LVMs will have the largest amount of users and TVL and roll and actual activity by the end end of the year compared to EVM L2s or even EVM L1s, you would basically make the argument that well, I'm wrong, because you know, agents are going to be writing a lot of the code and they're not going to be be writing it in Move. So maybe elaborate on that for us and uh and uh yeah, would be would be curious to kind of hear your take there."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. So smart contracts are kind of unique because smart contracts are really really dangerous. They are not like normal web development. They're more like space shuttle engineering in that you get one thing wrong and the whole thing fucking blows up and everyone dies. So that's why smart contracts are particularly sensitive. It's not the place where you want to be innovating, right? So on agents, it's very clear that uh agents are going to be writing a lot of the code in 2025. And you know, I don't know if you guys have played around with any of the AI coding tools, like cursor or you know, uh GitHub has their own um agent uh stuff. If you if you haven't played around with it, strongly encourage you, at least with REPL.it. It's very easy to use. Go play around with it and go build a couple apps. It's like crazy what you can do even as somebody who's completely non-technical. Um once you start to see this and you build your intuition of like, oh shit, this stuff is getting really good and really easy. Um you realize that more and more of the the code is going to be written by by agents. And a big part of the reason why is that smart contract engineering is really expensive. Paying smart contract engineers, they go for a lot of money. Uh it requires expensive audits, requires you know, just a lot of engineering hours in order to build this stuff and make it robust. Um and the number one thing that you see about these about these agents uh these software engineering agents is that they are much better at certain things than at others. So for example, they're very very good at web development and they're terrible at systems en engineering. Now why are they why why why is it so different? The answer is that the web is full of web dev code. So there's just tons and tons of web dev code out there, so they've just learned on tons of you know, Javascript and Typescript and Python servers and all this stuff that goes into building a website um or or or web app. But when it comes to systems level programming, there's not that much systems programming that's on GitHub. And so, as a result they've just trained on much less of it. And so they're much worse at it. So you talk to a systems programmer and they're like, yeah, I don't know why you guys love these LLMs. They're they're kind of shitty. They write terrible code. And the web dev guys are like they're amazing, they're solving everything, they're going to replace my job, I don't know what I'm going to do. Um and so I think what you'll see is that the more training data there is, the more audits there are to train on, the more you know, infrastructure there's already written or the more libraries that there already are for a given uh language that are more robust and more battle tested, the better the LLMs are going to be in that category. And as a result in those domains the cost of engineering and the cost of creating smart contracts is going to plummet. Like we're going to go to a world where instead of costing you know, millions of dollars to write your smart contracts, it's going to be like tens of thousands of dollars."
  },
  {
    "speaker": "Andy",
    "content": "Wow."
  },
  {
    "speaker": "Rob",
    "content": "And that kind of deflation in software is not going to be uniformly distributed. It's going to happen in some places where it's like okay, maybe in the EVM it's just dirt cheap to write really robust smart contracts and it might be you know, Move I mean, Move is a very safe language. It's a beautiful language. Uh you know, we invested in Aptos, uh you know, we think Move is awesome. Uh but the reality is that there's just not as much training data. And if there's not as much training data, that means that you can't necessarily depend on the LLM to write all the code for you. Maybe eventually the LLMs will get so good that even with the small amount of training data and a language spec they'll be able to write robust code. But right now, that's not what it looks like. Right now it looks like they can write really great code in the areas where they have a lot of training data and they can write terrible code in places where they don't have much. Uh and so, what you may see is that if you want to write a Move, you still need humans. If you want to write SVM, you still need humans. If you write EVM, the bots can take care of everything."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And why pay for humans?"
  },
  {
    "speaker": "Rob",
    "content": "And if that happens, exactly. Now, if that happens, and to be clear this is a prediction, I don't know if that's going to happen, especially not in 2025, but if that happens then that non-uniformity where in one place it's dirt cheap to engineer in another place it's just you know, it's a good language but it's just crazy expensive to engineer. Um almost all of the engineering dollars like why? Why would you ever uh write a smart contract that costs you know, millions of dollars as opposed to write the same smart contract that can be you know, twenty, thirty thousand dollars and save all your money to do BD and do other things or or just not even raise the venture dollars because like why get diluted, you know? Fuck the VCs."
  },
  {
    "speaker": "Andy",
    "content": "I was going to say it."
  },
  {
    "speaker": "Rob",
    "content": "So..."
  },
  {
    "speaker": "Andy",
    "content": "I hope that you haven't invested in any EVM auditing companies because..."
  },
  {
    "speaker": "Rob",
    "content": "Yes."
  },
  {
    "speaker": "Andy",
    "content": "Those those numbers are going down brother. The second and third order consequences of this shift that you're predicting are actually deeper than what you than what we all may as an industry actually fathom currently."
  },
  {
    "speaker": "Rob",
    "content": "I think that's right. I mean, to be clear, I I think auditing companies are not necessarily going to go away because there are things they can catch that the LLMs can't catch. But the LLMs like if you think about it, the audit reports are going to be much thinner, right? Whereas like, you want the human eyeballs because you want the people who are the best in the world. And the reality is that right now, LLMs are not the best in the world at anything. They don't write the best poetry. They don't solve the best uh you know, they're not better than the best programmers. They're not better than the best uh essayists. Uh but they're better than 99% of everybody else, right? So they're better than the non-PhDs. They're better than the you know, the non-professional essayists. They're better than the non-poets um but they're not better than the best in the world, right? And in a way, they kind of can't be because they're trained on our stuff. So they're trying to emulate what they see in the training data, which means that almost by definition, how are they going to be better than the best poet? Like, they're trying to be the best poet."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "But by definition, if you're trying to emulate Robert Frost, you're not going to go above Robert Frost. You're just going to be you know, you're going to be emulating him as best as you can."
  },
  {
    "speaker": "Guest",
    "content": "That's the direction of causation once again. Like it it it has to learn from something what the best is and taking that data before it can really excel and it's never going to super, theoretically, unless it has some weird network effect that it can combine and cross-pollinate ideas from different areas. It wo- it would not supersede the best of the best because it always has to be trying to attain and learn because it's a machine learning model. It has to have input and yeah, garbage in garbage out. It has to have a better input in in order to have a good output so."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, 100%. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "So, that's a wild thesis though, man. Like I mean, uh you can see the cost for auditing going down. You can see the cost for smart contract jobs going down. You can see that entire honestly man, I thought this part of the sec- this part of the the uh crypto industry has been a bubble for a while. I understand the importance of security, but and like the the rarity of developers, but like multiple hundreds and hundreds, if not millions of dollars for for smart contract engineers plus equity, auditing firms just throwing out 300k for a simple audit just because they can. Like, it's just been like this sec- this part that is just it's been very ripe for for destruction. So, we'll see how that pays out with the EVM. Any final thoughts there, Hasu, and we will uh we will take it to another one of these predictions?"
  },
  {
    "speaker": "Rob",
    "content": "Totally. So, one one last thing I want to add. So when I say all this, I I don't say it because I'm bearish on the SVM or on Move. Um I actually think that what you're going to see in 2025 is that everything grows. SVM tot- like total amount of contracts, total amount of transactions grow in SVM. I think they grow in Move. Uh and I think they also grow in the EVM. The claim that I'm making is that actually EVM will gain market share and but I think actually in absolute terms everything is going to grow."
  },
  {
    "speaker": "Andy",
    "content": "Yep. And then, I think uh a a a logical claim is going to be after that happens, once that level of AI proficiency occurs on other execution environments, I think EVM dominance is going to be perpetually cut. But we will see over time."
  }
]