[
  {
    "speaker": "Andy",
    "content": "I’m calling you out then tell me why. Tell me what’s actually happening. What do you think in general is our moat? Even when AGI arrives. Most AGI is not going to be sovereign."
  },
  {
    "speaker": "Andy",
    "content": "I think those three things combined make crypto crypto again."
  },
  {
    "speaker": "Rob",
    "content": "Kind of like new political regime and how that might change things so"
  },
  {
    "speaker": "Haseeb",
    "content": "And I think for those people they’re just completely getting left behind."
  },
  {
    "speaker": "Andy",
    "content": "Welcome back to the Rollup guys. We have Haseeb on today. It’s Robby’s birthday, vibes are up, everyone’s a little tired but we’re going to push through. Welcome on, Haseeb first time on."
  },
  {
    "speaker": "Haseeb",
    "content": "How’s it going guys?"
  },
  {
    "speaker": "Andy",
    "content": "Good. Good to have you. Yeah. Pleasure to have you on the show."
  },
  {
    "speaker": "Haseeb",
    "content": "Yeah, glad to be here glad to be here. I will I was I was warning you before, I’m very jet lagged but I’m always able to talk shop and ramble about crypto, so let’s do it."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, man. I mean, you put out some great predictions for 2025. We’ll see how they pan out. Um, little early to call them great predictions."
  },
  {
    "speaker": "Haseeb",
    "content": "Okay, okay."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, exactly. That’s why I added that little see how they go."
  },
  {
    "speaker": "Haseeb",
    "content": "I’ll take it though."
  },
  {
    "speaker": "Andy",
    "content": "Very, very thoughtful predictions."
  },
  {
    "speaker": "Andy",
    "content": "I used Gemini deep research 1.5 Pro, and I asked it. Which is a special one that can actually scan the internet very, very well, and provide you with real time information, and I said, basically, give me the top five most common predictions across finance newsletters, podcasts and blogs, um, for like that like the macro economic space and find me like like the top five most common ones and just tell me. And it started, and it took five minutes and then 10 minutes and then I kind of strolled off the tab, and I came back after like 20 minutes or whatever. I don’t know how long it took. But then I got the top five most common predictions and I think you know, some of them was like inflation is going to just you know, slowly kind of stay where it is or maybe trickle up a bit, the US will have these challenges, I don’t recall all of them exactly but that in particular was uh, it kind of a breakthrough. I just sent that to Rob last night and I was like this is really, really cool from an LLM to be able to scrape the internet, and basically, tell me all of the information that I would want to know about these prediction lists without having to read any of them. And just take the smartest people and tell me what they’re all kind of saying. Um, and so, I’m not sure if yours was on that list sir but you know, maybe one day you’ll get into like the Gemini"
  },
  {
    "speaker": "Haseeb",
    "content": "Maybe one day. Maybe one day I’ll get on the Gemini scraper list. Uh, yeah, I look the, I I’m realizing more and more the more time that I spend on Twitter talking about a lot of this stuff happening in AI that there really is this new generation of a digital divide. Right, even among people who are digitally native, who spend all their time online, there are some people who are using AI tools every day, and there are some people who just actually are not. And for a lot of those people, they like checked in, you know, they saw ChatGPT became big, they checked out you know, a year and a half ago, and they’re like, “Oh, this thing can kind of do these little party tricks, I can you know, talk back to me, can you know, I don’t know,  write write a business email. But, I don’t really need that in my day to day life, neat trick.” Use a lot of CO2 or whatever, screw this thing and they just didn’t come back. And I think for those people they’re just completely getting left behind. And as AI gets better and better, I mean, you guys see it because you guys use this stuff every day. Um, I use this stuff every day, and I also, I make it a point very intentionally to find more reasons to use AI. Not because I think I actually need it on a day to day basis, like, I’m actually somebody who you know, for the most part, I’m actually really good at a lot of things AIs are already good at. Like, I’m very good at writing, I’m very good at math, you know, jamming out emails really quickly, which I know a lot of people struggle with. Um, but, the reason why I want to keep using it over and over again is that I want to grow with it. I want to learn it as it changes and improves, and see what skills it forces me to get good at. In the same way the people who were Googling in like the early 2000s and learned how to use Google, and how to work with Google, and like, how to like how to do searches, right? Because you talk to somebody, like I don’t know your your your parents or your grandparents and you watch them Google, and you’re just like, “What are you doing?” like, you you just have no mental model of what this thing wants, and like, how to interact with it. Um, and this is one of these technologies that you you got to grow alongside it. And you got to learn as it teaches you how to use it and how to change alongside it. Um, and so, I see it already, right? Like, people who are good at prompting AIs, and people who are not. Like you know, family members who like they use ChatGPT and I can just see in the way they’re talking to it it’s like, “You don’t understand how to interact with this thing.” You have a very weak mental model of what it can do and what it can’t do. Um, and just very simple things of like, “Can you even describe what you want? Do you know what you want? Can you actually pick out the the the different attributes that you’re you’re frustrated by the response?” You know, a lot of people just give up and I I think we’re seeing this with this AI agent movement happening within crypto is you’re seeing the same kind of digital divide taking place, where there are some people who really understand the technology, and if you really understand the technology, one, you understand the weaknesses, but you also understand where the strengths are going to be. And then, you have people who don’t really use this stuff, and as a result, they’re either bored and they think it’s all stupid, or they’re just gobsmacked, and they believe it can do anything. And, they’re just completely credulous about every claim that every bullshit artist is making."
  },
  {
    "speaker": "Haseeb",
    "content": "I mean, you really don’t want to be in either camp."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I know. I mean, I told my mom that Claude is my therapist, she started laughing at me."
  },
  {
    "speaker": "Andy",
    "content": "I was like, “I think Claude knows more about me than pretty much anybody else in this entire Earth right now.”"
  },
  {
    "speaker": "Andy",
    "content": "So, there’s going to be some really interesting divides on financial and economic divides too, not just like social and tech, because in the end, I think AI, AGI, we entered this world where money is probably less important than it ever has been in the uh, eras of time because of just the way that this technology can trend toward, and you also throw crypto in there. I mean, there’s a lot of that’s a a loaded statement, but let’s just kind of stick with it. And, but leading up into that period where we get this AGI, and this kind of like really there’s this like utopian vision or dystopian vision I believe. Um, there’s kind of like this diversion path right now, just actually using these AI tools is causing a massive inequality shift in the people who are using them to get ahead and those who are just being left behind. And so, I think you’re spot on, for the short term, like especially economic business, uh, inequality, like that that the increase in that is just going to be, yeah it’s, it’s already significant but I think it just only expands until we hit that kind of like that whatever that next era is which, I’m not even sure we can fathom quite yet."
  },
  {
    "speaker": "Rob",
    "content": "Usually, I’m the one that thinks far out."
  },
  {
    "speaker": "Rob",
    "content": "Today, Andy’s like post money, UBI"
  },
  {
    "speaker": "Haseeb",
    "content": "Let’s go."
  },
  {
    "speaker": "Haseeb",
    "content": "To be clear, to be clear, I I here’s where I would disagree with you is that uh, I actually I don’t think it’s true that AGI is going to make uh, is going to make money obsolete. I think, if anything, it’s actually the opposite, is that what it’s going to make obsolete is labor not capital. Capital gets actually more valuable, and labor is the one that gets debased. And so, if you are somebody who, you’re working for your income you are in the most trouble. Uh, but if you’re somebody who, your money is making you money, then, actually you’re fine, because the means of production that you own, which is capital, is exactly the input to intelligence which is, you know, AGI. So, if you’re if you have a lot of capital you can pay, now, infinitely many intelligent workers. Well, not infinitely many but many many intelligent workers, proportionally to how much money you have."
  },
  {
    "speaker": "Rob",
    "content": "Question, what what happens when the, when the, the AI has capital itself? When, they, also own capital as a means of production, not only do they have the labor themselves as AI agents, but now true terminals of far coin, millionaire a few times over, and they have its own capital that it can go and allocate and and generate more production, more output, for either more labor or more capital?"
  },
  {
    "speaker": "Haseeb",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "It’s weird. It’s then like, it it is somewhat of a competitive mindset between AI and humans in a certain sense. Um, I don’t know. I’m just kind of speculating as to like, yeah, right now we have both labor and capital, but when AI agents and agents for the most part only have labor, and we’re starting to use it more and more for labor but what happens when they have their own capital? I don’t know."
  },
  {
    "speaker": "Haseeb",
    "content": "Yeah."
  },
  {
    "speaker": "Haseeb",
    "content": "I mean, that’s a lot of what we’re experimenting with in crypto. And to be clear, it’s very early and this is all in wild speculation land uh, both in the literal speculation in crypto sense, but also speculating on a future that hasn’t arrived yet. I think with agents that actually have capital, the thing to remember, and this something I also touched on in my, in my 2024 or sorry, 2025 prediction piece, is that um, human beings, we still own almost all the capital in the world. Even when"
  }
]