[
  {
    "speaker": "Andy",
    "content": "how it kind of plays out. I'm excited about the possibilities for user experience and just overall, uh, uh, performance that you know, Move VM and others are seeing. Awesome."
  },
  {
    "speaker": "Guest 1",
    "content": "I, I agree with you once, once the AIs are good enough, uh, that, that they can just be given a language spec and then write great code in that language. Uh, then, I think we'll choose the best language. Yeah.  My claim stops really making sense. Exactly, we'll see when that happens. But, but we're definitely not there yet and it doesn't sound like we'll get there any time within the next year or two."
  },
  {
    "speaker": "Andy",
    "content": "Another interesting one is token launches. I thought this was really cool where there's a shift from the Points Meta to basically what you described to be as a two-fold way of launching tokens going forward. One is a crowd sale. So, we've seen Legion and Echo, uh, really take off, I mean, Echo being like the dominant player here. Um, actually think that Kobe and the co-founder, CEO of CoinList were going at it on Twitter the the other day about kind of like, you know, because I think Echo's kind of had more success than anybody really thought. I mean everybody believes in Kobe, but that thing just took off. Yeah. Uh, so that's been a really cool trend of 2024. Um, and then the other, uh, kind of, uh, way that you predict is that companies will just start to go back to what I am thinking about it as is more of like this, uh, liquidity mining, uh, kind of a method of airdrop where it's like, Okay, we want to hit a set amount of volume, set amount of TVL, set amount of users, a set amount of metrics, and we're just going to directly incentivize transparently probably linearly, probably, based on how who, which wallets, which kind of clusters of wallets, whatever. I don't even care if it's sibilled or not, but who got us to this KPIs? And so, I think this is a big shift from what we've seen this year where frankly it's been fun to airdrop farm this year. We did well on Hyperlig, actually, we missed Hyperlig but bought early. We did well on some of the, on some of like the Pudgy Penguin airdrop stuff, some of like the, uh, uh, you know, stake this asset for, for this airdrop stuff. And so, that trend has clearly like shifted though. So, yeah, man. Talk us through this and, uh, you know, I think there's a way that teams can do both of these suggested ideas. Um, do a set KPI amount and then also do a crowd sale. Um, so, curious to hear kind of what you think about maybe doing both and then why you believe this trend is shifting?"
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I, I think the reality is that people are realizing more and more that the Points Meta is not really working for a lot of projects. Right? If you just, if you just look back over the big airdrops of the last year, uh, of 2024, and how many of them were positive versus negative. Right? If you think back to Eigenlayer or you think back to, you know, ZK Sync or you think back to, you know, what the, there, there were a bunch of them that just like the sentiment of the airdrop was overwhelmingly negative. Uh, layer zero, you know, where people are just mad. Everybody was mad. Uh, whereas, if you look at something for example like Hyperliquid where the Point system is very, very clear. Like what are we incentivizing? There's no surprises. It's very clear. You do the thing we want. You know, you provide liquidity, you do trading volume, you get points. That's it. Easy, you know, A for B exchange. I don't really care who you are. I don't really care what the, um, what the sort of Gini Coefficient is of the token distribution. All I care about is that I got what I wanted. And what I wanted was to be the best exchange. KPIs are very easy to measure and very simple. Um, and I think that's, that's, that's where we're going is that once your airdrop is no longer actually buying you positive sentiment and actually buying you the thing that you thought you were getting which is like, Oh, I'm getting the community involved, but actually, the community fucking hates me and they're all mad because they didn't get exactly what they want, then it's like, Okay, well, why the fuck am I doing this? You know? Like just to, just to do what people think I should be doing? Like, no, fuck that. Um, I think what the, the big thing that people are realizing more and more is that the people who are getting instigated and getting really angry about my airdrop are not even my users. They don't stick around. As soon as the airdrop is over, they pack up and they go to the next thing. And so, if these are not my users, why don't I even care what they think? Why am I trying to reward them? And why am I getting fixated in this weird loop of like finding these non-users, giving them money, having my non-users yell at me, and then they all leave? And it's like, Well, what, what was I spending my time on? So, the, the, the thing that every project fundamentally wants is one, to distribute their token because they need some decentralized token holder base. And two, they want an army. They want an army of people who are going to care about them and proselytize for the thing that they're building. And, um, or three, they want users. But if you're, uh, you know, if you're like a layer one or you're, you know, I don't know, some like convoluted infrastructure project or you're like, I don't know, an IP protocol or something. Uh, it's like, Well, you know, I don't really, I don't really know who my users are yet. I can't really tell who my users are going to be. And I can't really give them my token because they, they haven't used my product yet. They can't use my product yet, but I need tokens distributed on day one. Because if you're a layer one, you kind of have to have your tokens out there. So, how do you get your tokens out? I think that the easiest answer now is a crowd sale because it creates an army, it creates an alignment, it allows people to come in early, and it just obviates the idea of like, Look, these random, you know, farming rings. Um, why? Why, why prioritize them over people who have some skin in the game and actually are willing to make a bet on me? So, I think that's where we're moving to. Is that if you have clear KPIs, if you actually know what you want, then just get what you want. Just pay for service, you know? And just like see it as purely transactional, make it a linear airdrop, done. Um, but if you really don't have clear KPI, you're a layer one, you're a layer two, and really what you want is an army, you just, you know, you're airdropping for vibes. Skip the airdrop and just do the token sale, uh, and get, get people on your side and, and allow them to participate in, in the upside."
  },
  {
    "speaker": "Rob",
    "content": "Yep. Much more transparent. Both ways. Exactly. Um, and mak, and making it yeah. The, the token sale, as, as well as the points and you know, it might have been a necessity of the bear market to, to, you know, scoop up whatever users are there. But every, and everyone was kind of going for the same bucket but, um"
  },
  {
    "speaker": "Guest 1",
    "content": "It was also a regulation thing. Is that in the Biden era, nobody wanted to touch crowd sales because they th, Yeah. Yeah. Okay. This thing looks way too much like a security and it's a lawsuit Which is awesome that, that changed. So awesome that, that Yes. So great. Yes. Totally. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Maybe I, I have one like broader thing that I, I would love to get to be, before we wrap up, but maybe that, do you want to say a few words on like regulation, where you see that going? Because there was a, a category in your predictions about kind of like new political regime and how that might change things. So, what is, what is"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, and about stable coins specifically, I think is like the key point there from, from you're talking, just one thing real quick before that Rob, and then, and then yeah, we can, we, we can kind of get to your last topic and wrap up here is, uh, one kind of, uh, side effect that's in a similar trend to what we just discussed but kind of orthogonal is the fact that price discovery is also happening on chain now.  So, that is super freaking interesting because what we've had for the last so long is that we've basically had token just launch on exchanges, price discovery happens behind closed doors. I'm not going to, you know, call out VCs right now as we're on a podcast with a VC but there's this little you know, market maker, VCs, everybody has like is on the phone talking about who, where the price is going to launch and how they want them you know,  Market maker, VCs. Don't."
  },
  {
    "speaker": "Guest 1",
    "content": "We're, we're not on the phone with anybody talking about where the prices"
  },
  {
    "speaker": "Andy",
    "content": "Fine, but I, I'm just saying, there's, it is opaque, off chain price discovery is now shifting into on-chain price discovery with this also crowd sale mechanism and these transparent airdrop KPIs. I think those three things combined, make crypto, crypto again. And that to me is in, very inspiring, exciting, and just invigorating. It's just like, okay, wow, like we made it anyways because of, of the regulations. So, I'm curious to kind of hear what Hasu thinks about that point as well as stable coins and, you know, if I'm calling you out then tell me why. Tell me what's actually happening."
  },
  {
    "speaker": "Guest 1",
    "content": "Um, as a VC, um, you know, when I'm working with a founder that wants to take their token and, and you know, go to TGE and then eventually, you know, ideally, the project gets listed on an, on an exchange. Um, like where I get off the train is when we're not doing the product anymore, right? So I can potentially, you know, tell somebody, Hey, you know, go talk to Coinbase, go talk to Binance, go talk to, you know, blah, blah, blah or you know, it's more often the foundations that are getting in touch with these people. And um, their, the listing process is very secretive. Um, and when I say very secretive I mean secretive between the exchange and the issuer. Nobody else is brought in. Um, and there's obviously a lot of reasons for that because, you know, these things are there's, there's a lot of room for, for malicious behavior if anybody else is a party to those conversations. So we intentionally do not want to be a part of that. We don't want to be listing, we don't want to know about it. Um, we, we, we can give people the general advice on like, Hey, here's what you should look out for. Here's what the market, here's how you should negotiate with exchanges. Um, but we're not going to be, we're not going to be a party to the conversation. We're definitely not going to be telling them where they should list. The exchanges overwhelmingly are the primary party that tell people where to list. Uh, or like, you know, what, what the price at which things come out at. And that usually happens between an exchange, market maker, and issuer. Um, but no, VCs pretty much never have a say. And if a VC has a say, something really fucking shady is going on. Um, like, I, I can tell you almost every project you can think of that's launching on a Tier One exchange, uh, the VCs are, they're not in the room. Um, so"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, you guys get thrown under the bus a lot though. So It's fine."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, which is fine, you know. Like whatever. Uh, there, there it's, it's, it's part of being like public and out there is that you know, we have very punchable faces and it's like cool you know, I, I'll take it. Um, so, uh, it's fine. I, you know, we, we can, we can roll with it. Um, I'd say the um, the second thing, like, you know, here, here, here's what I'll say. If, um, if random people on Crypto Twitter think I'm an asshole, I'm okay with that. You, you gotta have a tough skin to survive in crypto. If entrepreneurs think I'm an asshole then, I, I got a problem and I need to fix it. So, that's"
  }
]