[
    {
      "speaker": "Rob",
      "content": "GM, Welcome to another episode of The Rollup. Today we have the pleasure of speaking with Ak Shat, Chief Investment Officer of Maelstrom Fund. Which is Arthur Hayes, the notorious founder of BitMEX, family office. Arthur and Ak Shat worked closely at Maelstrom, and today we dive into the investment thesis of Maelstrom, the time horizon, and some industry trends, as they're unfolding in the market today. Hope you enjoy today's podcast. Before we get into it, a word from our sponsors."
    },
    {
      "speaker": "Andy",
      "content": "Mantle is a Layer 2 blockchain with one of the biggest on-chain treasuries in all of crypto. They had a 100-day campaign called Metamorphosis live now. What this is, it is a campaign for their liquid stake ETH token and ETH, as well as their upcoming liquid restaking token, CMEETH, where you can utilize this token on the Mantle Network in a variety of different apps, some of your favorite restaking protocols and DeFi protocols, and earn yields in the form of powder, which will eventually be turning into a governance token. Mantle's been around for a while. We like them because they use their own form of Eigen Layer. They have a good ecosystem, and they are growing. Check out this 100-day Metamorphosis campaign, and hope you guys enjoy the rest of this video."
    },
    {
      "speaker": "Rob",
      "content": "Welcome aboard on our journey into the singularity. This is the endgame road map for FRAX and Fraxal. The new L2 out of the FRAX ecosystem that is totally based on fractal scaling. Fraxal is a modular L2 blockchain built by FRAX with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images and it explains how L2s become L3s, and the entire app chain life cycle goes through its evolution. The FRAX ecosystem is made of some of the top builders in the space and has stemmed from its OG days of the FRAX stablecoin. It is now in the LST space, the LRT space, and this Fraxal L2 joins the existing suite of FRAX products including FRAX swap, and FRAX lend. You can see FRAX ferry, the bridge to go from any chain Arbitrum, Optimism, or mainnet into the Fraxal Mainnet. Bridge your tokens, and bring your FRAX assets into the Fraxal ecosystem. Join today to get the best out of Fraxal, you are still early. Join today, take part in our expedition into the singularity."
    },
    {
      "speaker": "Andy",
      "content": "GM GM guys, welcome back to The Rollup. Uh, today we are chatting with Ak Shat from Maelstrom. Uh, Maelstrom is uh, the family office for BitMEX. Uh, former CEO, uh, Arthur Hayes, founder of BitMEX the uh, the uh, notorious uh, perpetual exchange with the 100x leverage. Um, if you're an OG, you remember. And now uh, and now Maelstrom. And uh, Ak Shat is running Maelstrom. So absolute pleasure to uh, to chat man. I'm glad that we can make this happen."
    },
    {
      "speaker": "Rob",
      "content": "Morning. Good to be here."
    },
    {
      "speaker": "Andy",
      "content": "Yes, it's good to have you. I think uh, you know there's plenty of things uh, that have uh, kind of, you know, taken wind over the last uh, you know, few weeks and months. So I'm excited to dig into it. But actually before you joined uh, I was looking at it like, \"What is going on with Tron right now?\" Do you have any idea like why it's catching so much wind?"
    },
    {
      "speaker": "Rob",
      "content": "Uh no. To be honest, no, not really. I think uh, yeah, this, that's I've been in Asia for five years. The Tron ecosystem has a dedicated user base that I don't encounter. I don't know who they are. Um, but I know they're around here in Asia, so that. No, no answers there, more questions for me as well."
    },
    {
      "speaker": "Andy",
      "content": "It's strange man. It's I guess just his excellency. Um, that has been able to build an empire. And like a loyal user base, I think just for out of like real user attraction, you know, they've been able to find like some stablecoin product-market fit. Honestly, I don't know anything about their DeFi ecosystem. I imagine, you know, like from what I've heard, they have kind of the normal DeFi components. But beyond that, it seems like they've just kind of found like a regional fit and a product-market fit. Yeah. Um, and then every once in a while like, because they're pretty steady as it goes. Whenever everything else tends to recede, they end up just kind of like cutting through the noise."
    },
    {
      "speaker": "Rob",
      "content": "Yeah. Yeah, yeah I think so. I think, you know, crypto finance reflects old-school finance where it's, it's all about whales. Um, so as long as there's a, a tight network of uh, whales who speak to each other, it's, it's not that difficult for a project to kind of keep its loyal base together."
    },
    {
      "speaker": "Andy",
      "content": "And, and I think, you know, I, I come from the Western world. Um, you know what, what are, what is kind of like the. Have you seen any, any very common threads or this, is there a divergence, would you say, or a convergence between Asia and the Western world, in, in its perception of crypto these days?"
    },
    {
      "speaker": "Rob",
      "content": "Yeah. Yeah, I mean perception kind of depends on who you ask. So, you know, regulators. Now we're seeing kind of things flip the other way. There was a point where Singapore, Hong Kong, etcetera were opening up in terms of uh, regulations. Um, South Korea has always kind of been there. Now you're seeing kind of a little bit of a pivot in, in the US at least. Um, but you know, there's a lot of uncertainty there as well. Um, and then in, in Asia you're seeing a little bit of a reversal. But even within Asia there's some disparity. So Singapore, after FTX, you know, kind of started closing up to crypto. Hong Kong saw an opportunity and now has been opening up. So it, it sort of depends where within Asia, Asia's pretty massive and each country, you know, is the size of a US state or more sometimes, and, and uh, the, the biggest one obviously is China. Um, isn't really right now crypto is, who knows? It's been banned a million times and unbanned-ish. Uh, so no one really knows what's going on there. But um, yeah, massive difference for sure in terms of uh, the trajectory. I'd say the, the biggest, the trend though, that you can really point to is, in the West, there is, um, at least in the US, there is some consistent trajectory and trend, and in uh, certain Asian markets, uh, let's say excluding South Korea, it, it kind of flip flops just depending on, you know, what the, the local, autocratic government feels that time of day."
    },
    {
      "speaker": "Andy",
      "content": "Okay."
    },
    {
      "speaker": "Andy",
      "content": "Kind of a fragmentation. Yeah, okay. Maybe we'll, we'll get into that a little bit more into the pod. But it's your first time here man, so again yeah, thank you for, thank you for making the time. Um, and like you said you're in Hong Kong now, but it didn't start out that way, and since this is your first time on the channel, I'd, I'd love to kind of get your backstory. You know, how did you meet Arthur, um, and then ultimately, like you know, what, what has been your journey through crypto and, and how did you end up where you are now?"
    },
    {
      "speaker": "Rob",
      "content": "Yeah, for sure. So, I um, I graduated from undergrad in 2013, and um, you know that time, my friend, who who's now a crypto VC, but neither of us were back then. Um, he sent me an article from, it was either Salon or Slate, I don't recall which one, about Bitcoin. It was summer of 2013. I remember just reading about it and there was a whole section on The Silk Road. And I, I'm from Austin, Texas originally. Remember thinking, wow, this might be one of Austin's most successful startups, The Silk Road. Um, and uh."
    },
    {
      "speaker": "Andy",
      "content": "Was, was uh, Ross from Austin?"
    },
    {
      "speaker": "Rob",
      "content": "He was either from Austin or based in Austin, one of the two. Okay. And um, I just thought, wow, this is really cool. And uh, and my buddy sent it to me, who's also from Austin, um, and uh, I just spoke to him, just thought wow this like fits a certain libertarian um, set of ideas I've come closer to, um, that I was exposed to in college, and uh, then I just thought okay, look my net worth is negative at the moment. Um, you know, got student loans, but, fuck it, I, I'm making an income now. I'd, I'd like to diversify my, my um, my portfolio beyond just traditional assets. And I thought, I'll take a position in Bitcoin. I started buying in um, towards the end of 2013, beginning of 2014. Beginning of 2014, and um, and I got caught in the, you know, there was a, a crash. I think uh, Bitcoin was at something like $1,100 and then it crashed to the, 200s, 300s for a couple of years. And I remember sort of writing it off, thinking okay, fun experiment, uh, but whatever, I, I, I don't really understand what I bought, I just um, just thought it was a cool concept. And then um, in 2016, 17 I started reading about Ethereum, and that's, and just reading about the ideas before just aping into the coin, um, and, that's, that's when I really got uh, I guess enlightened to the possibilities, um, that you can kind of like, keep stacking on to blockchain technology. And it starts with just distributed ledger, all the other stuff on top of it gets, way more exciting. The, the leaps are, are um, are manyfold each time. Um, and uh, I started buying Ethereum around then. Around 17, and um, again same thing, you know, there was the white paper, um, bubble in 17, 18. A lot of fun. I, I put in money into projects where there was no governance, you know, team was garbage, just like nonsense. But, I, I also, I kept my holdings and, and, and kept doubling down in Bitcoin and Ethereum, glad to did that. Learned a lot. Um, at that time I was working at a private equity shop. Um, you know, my day job it was really good training, learned a lot, but, you know, mind-numbingly boring to uh, to just invest in these old-school businesses. Growth is like 4% or 5% a year. Um, there's not that much to be done, uh, as an investor, can't really help that much. Um, it, it's very formulaic as well. Uh, I did that up until 2019. And then the cognitive dissonance just got too big between what I was getting interested in on the side and um, what I was doing for my, my mainstream uh, full-time job. And so I started looking for jobs online, and um, I wanted to combine my interest, crypto and VC. I also spend a little bit of time in Asia, but that wasn't like a high priority at the moment. At that time. Um, then found a job listing that was um, BitMEX ventures. It was about early 2019. Remember it said on the listing uh, that they weren't going to take candidates who weren't already based in Hong Kong. Uh, I was in Chicago at that time, and I thought, okay, whatever, I'll just apply. And um, got a response after maybe three months. I guess they couldn't find someone they wanted. And then um, got the job in the interview process. That's the first time I met Arthur. And uh, we, we happened to have gone to the same undergrad, but, but a few years apart. Um, and uh, then I moved out to Hong Kong in 2019 to start working at BitMEX. That's when I first started working with Arthur. Um, so then yeah, from there from '19 to 2022, I climbed my way up, I was the head of, uh, became head of um, Corp Dev at BitMEX eventually, worked more closely with Arthur and the, the CFO who's now the current CEO of BitMEX. And then in 2022, Arthur and I started formulating an idea, um, behind Maelstrom, and how we could um, kind of take the next evolution of BitMEX ventures, which sunsets in 2022, and bring it to, you know, kind of like the, the state of, of crypto today. So that's, that's how it all got started."
    },
    {
      "speaker": "Andy",
      "content": "Very, very cool. And maybe we won't spend too much time on this, we'll, we'll, you know, keep the rest of this conversation pretty focused to Maelstrom, but what, what is the state of BitMEX nowadays? Um, through kind of, undergoing its changes, you know through the cycles, um, with Arthur kind of stepping away a bit. Like what, what, what is kind of like, yeah, the state of BitMEX nowadays?"
    },
    {
      "speaker": "Rob",
      "content": "Yeah. So you know, I left BitMEX in 2022. So it's been a minute, about two years. But um, you know, as, as I was on my way out, um, BitMEX you know, was the OG, and they kind of didn't quite invent the perpetual swap product, but basically commercialized it for the first time in the crypto industry. And um, when I joined it was still in this heyday. Uh, at that point it was, I, I don't remember the numbers now, but it was majority of the world's volume in terms of crypto. Terms of dollar notional at least. Um, for a while. Uh, so from '14 to '19 that was kind of the case. 2020, um, situation changed a little bit, and it was this, that, that's when Arthur stepped away, um, around that time frame. But he was, he was already transitioning before that and kind of knew that the, the founding team that takes it from, from day one to day two is not the same team that's going to take it from day two to day 10. Um, so he had already been transitioning well before that. But uh, the transition started happening in 2020, and um, and then the BitMEX story kind of like changed from incredible growth to sort of um, I guess combating off new, um, market entrants who basically copy-pasted the product, which, you know, that's, that's totally reasonable. It's uh, not a, not a knock on them. Um, Binance, FTX at the time, bunch of these guys are popping up with the same product, and um, and then uh, it, it ended up being you know, BitMEX is focused on being this uh, derivatives exchange for pro-sumer type traders. Uh, what started happening in 2020 around the time of Covid and DeFi summer was that retail started coming in. Retail doesn't really want to deal with a perpetual swap product without first figuring out how do we even get this coin. So they needed, you know, spot offerings which BitMEX didn't have. And that, that ended up being uh, really beneficial for the likes of FTX and, and Binance, the other guys who started, um, taking a, you know, bite in the uh, BitMEX's market share. And um, and then you know, that, that transition, you could see it happening every month from 2020 until for the next like year and a half or so. And uh, and I'd say, since then you know FTX is now gone. Um, which, yeah, makes, makes sense. They, they were based in Hong Kong as well, we kind of tangentially knew a lot of the folks. That, that wasn't that surprising, it went that direction. Um, but um, yeah, I'd say since I've left, from what I understand, BitMEX is kind of like in, in this uh, more focused mode now. Just focusing on um, it's pro-sumer traders and, and not trying to, like overly diversify their other products as well."
    },
    {
      "speaker": "Andy",
      "content": "You were, like you said, you were there in the heyday. Like, do you have any war stories about like, I've heard crazy things about the BitMEX office. Sharks and an aquarium and. Is any of that real? Like what. Do you have a, yeah, like any war stories or just like. Yeah."
    },
    {
      "speaker": "Rob",
      "content": "Sure. I mean, it was, it was a wild time in 2019 when I joined. We were hiring some, some really high-profile people, you know, the former CEO, C-suite level people uh, from TradFi in Asia, and um, the office was incredible. It was in this building uh, that was kind of like a, a marquee Tier 1 building in, in the space, um, in, in the actual uh, the neighborhood called Central in uh, Hong Kong. And um, I think at one point, there was an article that went out, around the time I joined, that BitMEX was renting the most expensive uh, real estate in Hong Kong, which kind of implies the world. Um, which, you know, that, that just, blows my mind. Um, that that, that um, it was, that a business could go from startup in 2014, to be so profitable that it could uh, rent a space like that. And and I think it helped morale quite a bit. It created an environment where, you know, during Covid, a lot of folks were work from home. People wanted to come to the office, we're dying to you because it was such a fun place to be. There was an electric uh, atmosphere. Um, there, there were a lot of really cool just like aspects to the office you mentioned. You know, there was just, there was uh, an aquarium built in with, with sharks in it, and um, you know, it, it sounds like this like uh, this super villain kind of thing, but it was actually kind of like a charitable endeavor to take care of these sharks, um, and then, you know, kind of put them back in the aquarium uh, when, when they grew up a bit. And uh, it was, it was almost sort of like a fostering program. And, um, there was an amazing bar that overlooked uh, most of um, Victoria Peak, which is kind of an iconic peak in, in Hong Kong that's, that's been uh, associated with with good times in Hong Kong for about a century. So, yeah. Fun, fun memories of that, for sure."
    }
]