[
  {
    "speaker": "Rob",
    "content": "market that wants to do go, a deposit and a borrow, all of those events should trigger the oracle update. So in this case, you need that person initiating the transfer to provide you the oracle update. But you don't necessarily trust that person. So you need a way to be able to say, hey, the data they're giving me, I can trust it. And the way I trust it is because I know it's a URL I trust. It's data that's secure and encrypted, and they are providing it to me as part of their transaction. So now when they want to borrow money, you know, I don't need to go look at whatever oracle to update. The user submits that for me, and thanks to this proof that shows that that handshake happened, and everything happened, and it's the correct cert that I'm expecting. I know the data is solid, and I can accept it as part of that on-chain update."
  },
  {
    "speaker": "Rob",
    "content": "So that's how I think the oracle paradigms should happen because I think it removes a lot of on-chain bloat."
  },
  {
    "speaker": "Rob",
    "content": "Um yeah, that one's probably the most technical of the projects, which  I quite enjoy."
  },
  {
    "speaker": "Andy",
    "content": "Definitely. And more like infra focus, whereas I think a lot of your your focus is typically on like, the"
  },
  {
    "speaker": "Rob",
    "content": "The end users. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Users. Right. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And so, this last one"
  },
  {
    "speaker": "Rob",
    "content": "Uh."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Now I wanted to say it is and it isn't. You know, I mean, Yearn, Yearn I think is another good example, because Yearn was never meant for end users. Yearn, Yearn started as me managing a bit of money that I was doing for some teams back then. Um and every morning, I used to log in, I used to go look at Compound, I used to go look at DYDX, I used to go look at Aave, and I used to check their interest rates, and then I used to manually, like, move the money from the one to the other one if the fees wouldn't cut out the amount they would make for the day. But then fees were a few cents, so you know, it was worth it moving it every day. And then eventually, I was like, after doing that for a few weeks, I was like, under your coder, there has to be a better solution. So I started doing a smart contract that then checks all of the rates for me in real time. So then all I need to do is click the, well not click, but I have to send the rebalanced transaction, and then the smart contract would look, okay, which one's best, and then move it there. And then I still once a day had to go and, you know, send the rebalanced transaction, and then I was like, hey, if I open this up to other people, every time they deposit or withdraw, it'll rebalance, and then I don't have to do this stupid transaction every day. And that's why I opened it up to users."
  },
  {
    "speaker": "Andy",
    "content": "That's true."
  },
  {
    "speaker": "Andy",
    "content": "No way!"
  },
  {
    "speaker": "Rob",
    "content": "So whenever they interact, yeah, that was it. And like the, solidly was originally built because of the stuff I wanted to build on top of it: prediction markets, LeveX, all of the stuff I mentioned now needs an AMM that has a reserve-based oracle. Because one thing if you look at Uniswap TWAPs and stuff, which, which are awesome on-chain oracles, but they don't take on-chain liquidity into consideration. So if I want to do, let's say a half a billion dollar swap, they give me the price, but they give me the price irrespective of the available liquidity. One thing I needed on-chain was a, was a TWAP that I could use, but it needed to take into consideration the liquidity. So if I want to liquidate, you know, someone's position, it doesn't help I ask Uniswap for the TWAP, because it gives me a fixed price based on the last trades. I needed to know this big block that I want to sell, how much are you going to give me for it. So it's almost like a quote-based system if you change it to reserve-based liquidity. So that's one of the biggest things in Solidly actually. Like it's, it's one thing that often pisses me off a little bit because like, there's a lot of technology in Solidly that is not being used in any way. Everyone's like V3 V3 woo, whatever. That's, that was the jokey memey fun part. That, that wasn't even meant to be core. Um the, the, the, the, the built-in volatility, because it has its own little volatility measure, so that, you know like I said, you need these volatility measurements to be able to do those AMM curves. It was designed for that. The, the RWAP, as I call it, which is reserve-based, time-weighted. Um that is meant for being able to do like on-chain quoting for liquidations or, again, LeveX, being able to see what can you quote me for that trade without needing to actually execute the trade. Um so I, just, just a little disclaimer: the stuff I built aren't actually for end users. Um they're actually built because there's an on-chain technological requirement that I need to facilitate."
  },
  {
    "speaker": "Andy",
    "content": "That's the answer that we all know right there, bro."
  },
  {
    "speaker": "Andy",
    "content": "I'm glad."
  },
  {
    "speaker": "Rob",
    "content": "That's true."
  },
  {
    "speaker": "Andy",
    "content": "Sorry guys, not for you, but just because that I am just too lazy to click a button every morning."
  },
  {
    "speaker": "Andy",
    "content": "Fuck it. Fuck you."
  },
  {
    "speaker": "Andy",
    "content": "Oh my goodness."
  },
  {
    "speaker": "Rob",
    "content": "To pay the fees."
  },
  {
    "speaker": "Andy",
    "content": "That's true. That's true. Well, I think the last one, and then we can kind of close this out. Really appreciate you's taking the time today. Um is, is the, is the under-collateralized lending. The, um,"
  },
  {
    "speaker": "Rob",
    "content": "Hm."
  },
  {
    "speaker": "Andy",
    "content": "The gov, the, this idea of on-chain credit."
  },
  {
    "speaker": "Rob",
    "content": "Uh."
  },
  {
    "speaker": "Rob",
    "content": "I, I, I, I had a comment on that, actually, and like there's"
  },
  {
    "speaker": "Rob",
    "content": "this one is a much more traditional business, like I say it already has a big team, it's been in development for almost four years now. We have a ton of data, it's almost a petabyte of, like data that has been ETL'd and has been changed to facilitate a credit score. Now, the one part is the on-chain part, but when you say on-chain, I have to add asterisks because there's the, hey, I don't want to KYC and give you any of my personal details, and that guy has a credit score. Now that one, we can't give an under-collateralized loan because you can try and fake the system and cheat it around so that you get a nice score, and then you try and get a massive payday. So for that guy who's not willing to provide any additional data, what we can offer is better LTV and better interest rates. But it's still going to be a collateralized loan. There's no way around it, unless you're willing to give us something that we can use in the normal legal world. Um the guy that's willing to add a little bit of extra, so, so that one, we can still do as a decentralized primitive. We can write that on chain and that's actually where my witness net comes in again, because I don't want to be writing that stuff on chain the whole time, but when the guy applies, I want him to sign a message that proves that this is my private key. That private key then goes to our blockchain bureau servers that gives me the score, and then I know that score came from that URL, and then I publish it there. You know, I know it seems like I'm building all of these things in isolation, but they all actually come together. Um every so often, I'm just chased out of the space for a few months, and then I have to kind of restart, by my own choosing, I guess. But yeah, so, so, so that one, you know, you'll be able to get better rates likely than you'll get at an Aave or a Compound, or whatever, but it's still going to be um collateralized. Then if you are willing to provide some real-world information, then we start looking at the under-collateralized lending, which you can still do on-chain, and we can do most of that KYC stuff also, you know via ZK implements, so that you don't actually have to disclose anything serious, you just need to do some proofs. Um then there's sort of the traditional credit scoring side, which a lot of traditional institutions in the non-crypto world that might have a crypto touchpoint, you know, so they have someone, they might have a deposit address for USDC. So they have that address, and they now want a little bit of extra credit scoring data, you know, maybe your FICO score, or whatever, so they talk to us so that we tell them, hey, this is the activity this address, this address is likely linked to these. This is the OFAC and their compliance and blah, blah, blah, blah, blah because we've got sort of standard regulatory stuff in there as well. So that enriches their data set so that they can do that, and then the last one is the standard regulatory stuff, but you know, that competes with the likes of TRM Chainanalysis, all of these guys that are already doing those reports, so that's not really the core business, but it, it is there because that was part of the score building process. So we do offer it. Um but those are our traditional business stuff, you know, that's, you sign up with an account, and you grab a credit card. You never even touch the blockchain there. In terms of the data, because this was the fun part, you know, because every, every money market, every AMM is a little bit different, you know, some do events, some don't do events. Um some have on-chain logs, some don't have. Some you actually have to look at the transactions, some do it as internal transactions, some do it as core transactions. So that's been a process to sort of adapt each of these main money markets. Um and a lot more niche stuff we don't get support, but you know, we've got all of the big guys across all the big chains, the money markets, the AMMs. Um it, it, it's also at the point where we're looking at trader activity, you know, what kind of stuff do you buy? How long do you buy and hold, because there is a direct correlation between, you know, how much you're trading versus your creditworthiness, and the kind of assets you're buying, and your creditworthiness. I mean no surprise, the guy that just buys a million dollars of Bitcoin, and holds it for five years is better than the guy flipping ten dollars of shitcoin number three this week every five minutes. Um but, still, it's, it's nice to have been able to codify it and show, you know, the data proves my theory. Um so yeah, that's quite nice. But otherwise you know, a lot of this stuff, when I kind of took my hiatus, I think towards the end of 2022, I, I, I've shifted my focus to a lot of things that are an intersection of traditional finance and, and decentralized finance. Um credit scores was a big one I, we identified. At that time, I was also helping a few regulatory bodies and stuff in terms of ETFs. You know, standard spot ETFs, nothing fancy. Um we were looking at facilitating funds that hold these spot assets. Um ah, custody was another one we helped with a little bit. So you know, all of, all of these things where, where it, it isn't really on-chain but it's interacting with on-chain assets in an off-chain way. Um but, but, but I definitely think the biggest one of those ended up being the Blockchain Bureau, which, which um I think is a lot bigger than I, I, again, you know, it's, it's that, it's that combination of the technology and the social layer."
  }
]