[
  {
    "speaker": "Guest",
    "content": "We've got a whole new captive audience of suckers that haven't been burned yet. Let's let's make sure they never want to come back."
  },
  {
    "speaker": "Andy",
    "content": "Hey, and Andre goes on his next tirade, God damn it, Andre! You already have to say it like that, man. This like mean coin, 80 gen culture. You think we're we're moving further and further away from some of the true technologists?"
  },
  {
    "speaker": "Guest",
    "content": "Facilitating that swap to happen without slippage. That's a big one."
  },
  {
    "speaker": "Andy",
    "content": "That's the Andre that we know right there, bro."
  },
  {
    "speaker": "Andy",
    "content": "What's going on, guys? Welcome back to the roll-up. Today, we have an episode with Andre Cronje. Uh one of the original, OG kind of DeFi, uh, pioneers. I I could say, I mean, I myself was a yearn finance farmer on like day one. Um, unfortunately, I I I didn't have much capital back then, but still one of the best farms in DeFi. Um, and so yeah, lots to talk about about the kind of transition of DeFi and into kind of where we are today. Andre, it's your first pod since I think you said 2022 so glad to be back on the scene. Um, and thanks for coming out, man."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, um, happy too. Like, I never actually, I'm not, I'm not willing to do podcast. It's just people normally always asked for it at the weirdest times and it just doesn't match so, um, you guys chose a great time. Congrats."
  },
  {
    "speaker": "Rob",
    "content": "Nice. Why, why is this a good time?"
  },
  {
    "speaker": "Guest",
    "content": "Because I happen to be like awake and working hours currently so, um, I, it's time zones is always the best way to mess stuff up and people always want like 2:00 AM or, you know, 11:00 PM or whatever and I'm not awake enough to do anything then."
  },
  {
    "speaker": "Andy",
    "content": "Cool."
  },
  {
    "speaker": "Andy",
    "content": "I think Sonic, uh, the push to main net may have something to do with it as well, but I think we'll kind of get into that. Andre, what have you been been up to, man? Um, how's how's life?"
  },
  {
    "speaker": "Guest",
    "content": "Broad questions to start with, hey? Um,"
  },
  {
    "speaker": "Guest",
    "content": "Life has been interesting. Um, there has been a lot more, uh, legal regulatory and compliance stuff over the last three years, two to three years. Um, there have definitely been a very steep learning curve as well as, um, a lot harder than I think I anticipated. Um, I I, not not I, I mean you guys would have seen it on Twitter and stuff already right? Like almost every single team out there have received some kind of noticed either via IR, ACC or DOJ or CTFC or other entities. You know, um, VAR, UAE, um, um, Casper Cayman etcetera. You know, there's there's, there's definite attention on this field. Um, positive and negative. I think some of it is coming from the right place. Some of it is definitely some some regulators and institutions we work with, and and they just want to know how how should they shape rules and our policy, etcetera, to facilitate. Um, others definitely just see it as complete fullgazi, and they're just trying to, they're just trying to block it any way they can. Um, don't necessarily think they're even wrong. Um, I think there's definitely instances there. But anyways so, so that's definitely been very time consuming. I deal with lawyers a lot more than I deal with coders over the last three years. But I'm I'm happy to say that has been transitioning over the last year, and my coding time has increased more than my regulatory time which is nice, which is very, very nice. Um, because ultimately that's where my my passion lies. On the, on the coding/development side of life. Um, there's been a lot of stuff that you know, we've just kind of been working on. Um, I hate to use the word, but you know, in stealth.  Wasn't really meant to be in stealth, it's just we happen to be working on it without advertising it. Um, one thing that I'm definitely excited about is obviously Carmen, the new database coming out with, um, Sonic. I think that's a big thing not just for, for Sonic, um, but for all EVM enabled chains, you know, respective of L1, L2, whatever. Um, It's a, it's a database customized for VM especially EVM, you know execution and opcode. So like even, anyone that uses the standard EVM or even a slightly modified one will be able to get benefit from just plugging into this, you know, they'd swap out their, table or badger or whatever that. So anyway, that's a big thing definitely. Um, Sonic as a whole, obviously a big thing sort of parallel to that, you know, know. Um, I I've been trying to get on-chain credit scores going for quite a long time now, since as early as 2021. Um, It it took, it took a lot longer to find the right people for the team. Um, and that's partly because the right people aren't crypto people. They're traditional credit scoring people and traditional credit scoring people. I had to really hard sell to convince them, hey, leave your very comfortable, you know, big trans union or XTS or whatever job, and come work on this experimental stuff. Um, that alone took almost a year and a half and then when we finally got the right people, and now we have a phenomenal team. You know, then there was an immense learning curve for them, because they're used to credit bureau data, now part of their job is needing to, you know, ETL and transform, um, on-chain data. Um, But it's, it, it's been nice seeing, you know these guys start out like a little bit hesitant, and then a little bit frustrated with the data and nowadays they're the biggest preachers to everyone that crypto is the next thing, blockchain more specifically. Um, And it's always nice seeing that sort of conversion happening in people that are, that start all very antagonistic. Myself included, you know, I mean, that's that's how I got into this space as well by, um, by thinking it was all bullshit, and, and that's why I started with my original you know code reviews was because I was like, well this is a lie, this is a lie, this is a lie. Um, But turns out you know, there's, there's something when you start poking underneath that is really phenomenal. Um, Anyway yeah, bunch of cool new stuff coming out. Um, a bunch of daps that I've sort of shelved or have not been able to complete due to underlying technology constraints coming out. Um, so I'm expecting the next few years to be quite busy. Um, uh, Zero knowledge technology has advanced so much that, you know, stuff that just wasn't possible a year ago, two years, three years, however long-term you want to do is, not yet possible, but starting to become very close to real. Um, and that is a big thing in, in, in crypto. Because, you know, even even right now, bridges, oracles, um, exchanges, you name it, wherever we like to admit it or not, there is still a lot of trust assumptions. Like so much of cryptography is still just private public key. Um, and ZK really changes that. You know, it removes that that privacy out of the equation. So, it removes those trust assumptions, the centralized entities. Um, and I think like, not not maybe commercial level grade ZK, but but at least niche, like, libraries and stuff, is going to completely revolutionize, oracles, exchanges, bridges, um, even, you know off-chain execution. um, to a large part. Um, Anyway, sorry long ramble, but lots of exciting stuff, you know. Um, and a lot of bad stuff in between."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I'm sorry to hear that. Um, the legal stuff can be quite quite the headache and I'm sure, I'm sure the stuff that we've dealt, dealt with is quite a bit less than what, than what you guys have, right? So, um, props to you for just kind of sticking around. I think like one thing that, that stuck out was, there's a lot of, there's a lot of building that you're talking about there, but there wasn't a lot of like DJ-ing on chain. And I, I, I had a really good podcast with Kane from OG Synthetix, now is building Infinix, right? And um, I'm sure, I'm sure you have some funny stories there. But we were talking about how, how like, God damn it, man! Like uh, back in 2020 and 2021, uh, you know, we were pushing thousands of transactions per month on-chain, and how now it's like the enthusiasts on-chain are just like, not doing that, that, you know, that much. Um, You know, so I, I'm just curious like, what's your, what's been your perception of the evolution of DeFi since kind of this, a lot of these big zero to ones that, that came right? Like AMM's, um, you know, even just yearn was, was a massive breakthrough, right? Um, and then, how that has kind of changed and, you know, why DeFi enthusiasts aren't really like on-chain as much as they used to? Like what, what's going on there?"
  },
  {
    "speaker": "Guest",
    "content": "He is the original DJ."
  },
  {
    "speaker": "Guest",
    "content": "Um, again, a lot of factors to that question. You know, let's let's let's start from the technology perspective. Um, I, I, I always believe that technology is iterative, so it's it's it's, it doesn't really run linear, you know? It's like there's a massive jump, and then there's a plateau, and then there's a massive jump, and then there's a plateau. Um, and that's been true for, for, every disruptive technology that's ever been."
  }
]