[
  {
    "speaker": "Andy",
    "content": "to Solana's growth. Um, you know, and, and that's kind of that's grown an entire narrative in of itself. The one thing that I wanted to hit on, with particular to one of your core DeFi innovations, was this idea of, like, V-E tokens and this vote-locked, um, you know, this kind of bribing mechanism. Um, and one of the most prominent and successful DeFi apps today is Aerodrome on Base. They're like one of the only DeFi apps that's got a very bullish token. They've got the flywheel spinning. Things are going. Like, what is your take on, on the V-E token model today, the bribing, Aerodrome, like, i- is this model, like, now that we're, you know, several years past, so, so these kind of, these vesting schedules have run their course in some capacities. Like, what's your, what's your overall thesis, or kind of view on the V-E model now?"
  },
  {
    "speaker": "Rob",
    "content": "Okay. Well, ju- just, just one correction there. The, the V-E model was designed by, by Mitch from Curve. They were the first ones to introduce it. Um, credit, credit where credit is due. That man is an absolute genius."
  },
  {
    "speaker": "Andy",
    "content": "That's right, V-E, C-R-V. That was a, that was a crazy day."
  },
  {
    "speaker": "Rob",
    "content": "So. Yeah. My, my, my, my add-ons were just, you know, the, the change of flywheels where the LPs don't get fees. Um, they get the bribes instead. And their fees go to the, the bribe burs, who are the V-E holders. But it was just to add a little bit of an extra layer there, and like, obviously I was quite active with, within the Curve ecosystem, while not being, you know, a part of that team, etcetera, but like, work closely with, with, with Mitch and guys. Um, and, you know, a lot of the stuff kind of naturally evolved over time, you know? The, the bribing mechanism, that, that was, you know, originally built by, by, by Ben and kinda just launched by me. Um, but that already showed that, hey, there is an interest in people incentivizing these emissions. Now, you could also argue that, that's just an extra step, right? 'Cause I mean, you can just, instead of bribing these guys to vote for emissions on the pool, you can just put your bribe directly onto that pool, and then have them vote for it. Um, I, I think that's hard for a lot of, you know, starting teams, um, because people might not have belief in their token. Um, so people don't really wanna accept that. They'd rather take the, the emission. And then, at the same time, for the V-E holder, you know, the- their stuff's already locked. So, so there's no real, and, and they're not getting those emission rewards to their V-E. So, to them, it makes more sense to, to take on that bribe risk. Um, so, so that way, it kinda worked, I think, in terms of like the, the social layer and social perception. I still think it's a great model. Um, I do think that we have seen that four-year locks are probably a little bit too optimistic. I think that should definitely be something a little bit more liquid. And again, something I tried to address with the V-E NFTs that later came, so you can at least sell the position, even if you can't get the underlying. Um, but we haven't really seen any real marketplaces for that kind of stuff. But that's also because the NFT scene as a whole has definitely um, quieted down a bit. Um, in terms of, does the model work? And, and people reference Aerodrome."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, and, and Andre, real quick. I think the big pushback is that like, after time, people vest. They vest longer. Then they have to keep reinvesting their rewards because they have to keep up with inflation. And so it's like, where, where's the exit, right? And you kind of addressed it with the, the ability to kind of sell as an NFT. But, Yeah. I think that's, that's the pushback."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. So, so, so, two comments, I think. One is, does the V-E model V-E 3.3, not necessarily original niches V-E, I'm talking now about my V-E bastardization, that came with Solidly and eventually turned into all of these other guys. Um, there are a lot of Solidly forks, a lot. Um, probably 30 to 50, um, of which three or four are actually successful. Now, now that to me says it's not the code. It's not the, it's not the tech. It's not necessarily the flywheel even. Um, that to me tells that there's other external factors. You know, if, if you take raw Uniswap and you deploy it on, on any chain, and, and there isn't other competition, um, raw Uniswap will be the best. I don't think the same is true for using Solidly on any chain. Um, so, so I don't think it is the model that is making it successful. And I do think the model has some flaws, as well, that can be addressed. But now, you quickly wanna go to a different example, and then I'm gonna come back to that. The, the idea of the flywheel, right, is that eventually, actually le- let's, le- le- let's, let's forget about the AMM quickly. Let's just go to Bitcoin. BTC, keep it simple. Eventually, emission stop. Eventually, it hits theoretically. Let's say theoretically instead of eventually because I have my own opinions on whether it's going to happen or not, but theoretically, at 21 million, there's no more issuance. So, there's no more subsidized block rewards. The theory at that point is that there's enough on-chain activity that the fees generated in each block are enough to pay for the security of the network for miners, validators, whatever you wanna call it. This same statement is true for any blockchain out there. We're all basically, um, subsidizing, you know, i- i- it's, it's a little bit fake till you make it. We're, we're, we're subsidizing activity until there's enough activity for the chain to survive. Should it reach the point where those incentives are no longer enough, or where the incentives stop and the fees are not enough, the blockchain should in theory suffer economic death. You know? There's just no one's willing to provide security, with do it. It just kinda dies out. Same is true for a bribe-based flywheel, right? The bribes are there to originally incentivize trading activity, until the fees generated are enough that they themselves can sustain. Um, now, now in that already, you're seeing a flaw. 'Cause if we look at, at, again let's go back to BTC. They only care about one thing and one thing only, security. So, they are paying purely for security. Now, we are saying that the thing we are trying to pay for is fees. Now fees are generated by trading activity. Does anything in the flywheel promote trading activity? And no, it doesn't. So, right off the bat, it's incentivizing the wrong behavior. Um, so, so I think there is definitely, you know, the f- first kind of thing you wanna address. And then you also need to tweak that so that it's more aligned necessarily to capital efficiency than just wash trading. Um, and at the same time, you know, there still has to be a little bit of an economic cost, so the max you can really go to is like a 90% sort of fee-to-bribe ratio, because otherwise people can just wash trade and, and, and, you know, claim all of those fees. Um, but anyways, so, so, so, sorry, again, very long-winded, but, but I think the main thing is the, the, the conceptual model is right, but it's still not incentivizing the, the right thing yet, you know? And, and, when, when I, when I went from V-E to V-E 3.3, I, I was already trying to change it, so that, so that the LPs don't get all of the benefits, 'cause they are the LPs, you know, they collect all of the fees. Um, I think some pools have a fee share of 50%, but, um, that already, I think, was an important change, so that, that should go to the people who are managing the protocol, you know? 'Cause those, those V-E lockers, they're the ones who are really coming to work on a day-to-day basis, and saying, \"Okay, no, this pool is more important. That pool is more important. This is what we want in our system. This is what the assets we want to promote.\" They're, they're doing the work, so they should get the pay. The, the LPs aren't really putting in work, you know? They're, they're putting in their assets, and they, they, they, they still should be rewarded. And, you know, that's where your bribe blueprint comes in. Um, 'cause they still need emissions, etcetera. But, but, but I think it's, it's, it's still not right yet. Um, but again, going back to Aerodrome, that has nothing to do with their success. You know? The- I've, I've said this on Twitter a few times, because I, I, I, I do sometimes get annoyed when they try and distance themselves from the fact that they are using my code. Um, and I think that is a little bit douchy. But at the same time, I keep telling them, \"Guys, why are you distancing yourself, 'cause your success is not because of this code. It's not. It's nothing to do with it.\" Um, So, you know, all, all, all kudos and respect to them. But, but, but the V-E NFT isn't there yet. Um, a few more changes. A few more changes, a few more iterations. And I think it can get there. But, but the goal of any decentralized solution needs to be self-sufficiency. Um, and there's very few other"
  }
]