[
  {
    "speaker": "Guest",
    "content": "You need credit score to facilitate a lot of stuff we take for granted nowadays. You know, even even something as simple as having a a postpaid cellphone plan. You know, that's based off of credit scores. Like buying a vehicle or financing credit scores, um, being able to to to rent an apartment, credit scores. You know. Um, so so I think that's another one of those things that opens a bunch of new primitives that'll become available on chain."
  },
  {
    "speaker": "Guest",
    "content": "Within the near future, not the hypothetical amazing rollup abstraction 20 years away future."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Oh man. You know Andre's got to build something that allows us to spin up another debt cycle of DeFi. This thing's never going to get off the ground again. So let's just throw uncollateralized lending"
  },
  {
    "speaker": "Guest",
    "content": "That. Got to keep that debt wheel going, my man."
  },
  {
    "speaker": "Guest",
    "content": "We've we've we've got a whole new captive audience of suckers that haven't been burnt yet. Let's let's make sure they never want to come back."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Now Andre goes on his next hiatus. God damnit, Andre. Why did you have to say it like that, man?"
  },
  {
    "speaker": "Andy",
    "content": "Oh, well hey, man. Uh Robbie, Andre it's been it's been a a bit of a journey here today. Um Andre, thank you for for the for the time. Um yeah, this has been great. Welcome back to the to the the community, I guess."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "And um I'm still trolling on Twitter, etcetera but um just haven't really done any public facing stuff. But, you know, there there was a lot of just building that needed to happen versus most of the projects are now ready to you know, start having external people interact with it. Which is also probably a reason why I'm more willing to do interviews and stuff now again 'cause I'm a bit more bored 'cause it's all audits and reviews and waiting."
  },
  {
    "speaker": "Andy",
    "content": "And so it's that that means Sonic's gearing up from main net as soon as we get these audits back and what not."
  },
  {
    "speaker": "Guest",
    "content": "Uh, most of them already back. We're already checked off. Um, I know the team has an internal launch pretty soon. And then when that goes well, external launch. But it's all earmarked for December as far as I know. Last time I spoke to the team."
  },
  {
    "speaker": "Andy",
    "content": "Sweet. Well, which I act like was a long time ago but it was like Monday. So"
  },
  {
    "speaker": "Andy",
    "content": "Nice. Cool. Well sweet, man. Looking forward to that and um looking forward to messing around and aping again. Um, I think that"
  },
  {
    "speaker": "Guest",
    "content": "No tokens. No aping for you."
  },
  {
    "speaker": "Andy",
    "content": "No, no. Just going to just going to play some new primitives, man. It's been a while."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Look, I'm excited about that as well. I I I think like I said, I think under collateralized, I think um insurance I think is important for a lot of bigger players to care about the space. Um, and I don't think we've nailed that on chain yet. Um Forex, you know, is one of the biggest markets outside of crypto but it's just not a crypto presence so I think and I think that's just a function of AMM curves aren't as competitive. Um, the the the one that I think technologically is cool but it's probably not that useful is the is the is the LeveX, um 'cause on chain perps are pretty What's what's out there is pretty good, I'd have to say. There's um those teams know what they're doing."
  },
  {
    "speaker": "Andy",
    "content": "Darius from Vertex told me I was going to get absolutely owned in the app chain versus uh L1 conversations so"
  },
  {
    "speaker": "Guest",
    "content": "Like I said, I I think there is a room and a place for everything. I think that a lot of people that might be exploring app chains are just doing it for the fee extraction which I think is the wrong reason to launch an app chain. And I think there are a lot more costs than they are aware of. And it's just about educating them on that. Um, I think there is a place in a time. Right now, I just think it's the hardest times for builders to actually know where to go and what to build."
  },
  {
    "speaker": "Andy",
    "content": "Where to go."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Well, hopefully, Sonic's rebuilding the map."
  },
  {
    "speaker": "Guest",
    "content": "That's really what they're trying to address. That's it."
  },
  {
    "speaker": "Andy",
    "content": "Yep."
  },
  {
    "speaker": "Andy",
    "content": "Well, Andre, thank you so much, man. Uh, it's been a pleasure. Again, welcome welcome back, not in the back way but kind of again, and you know."
  },
  {
    "speaker": "Guest",
    "content": "Appreciate it."
  },
  {
    "speaker": "Andy",
    "content": "So um, and yeah, man. We'll speak to you soon."
  },
  {
    "speaker": "Guest",
    "content": "Thanks, guys."
  },
  {
    "speaker": "Andy",
    "content": "Thanks, Andre. Peace."
  }
]