[
  {
    "speaker": "Rob",
    "content": "Than like Unis original Uniswap V2. There aren't many primitives that really capture that level of pure decentralization."
  },
  {
    "speaker": "Guest",
    "content": "Do you think that's maybe because they can get forked? And any self-sustaining model doesn't really have a moat?"
  },
  {
    "speaker": "Rob",
    "content": "Um well, now again I I think it's because the participants changed. Right? I mean, even even if we look Uniswap I think is a fantastic example because if we look back at Uni V1 and V2, they weren't a business. They were a bunch of hobby technologists that were playing around with some awesome ideas and built what I think it's still till today some of the purest primitives ever created in our space. Um fast forward a bit a lot of funding, a lot of incorporated entities, all of a sudden it's starting to become clear. Okay, hey look these guys are now a business. Now, now as a business, you you almost have to add that centralized hook. You know, because, because a true decentralized system, cannot have an owner, it cannot have an operator, it cannot have a value extractor. Um and, and I, I think a great example of that is again um when I launched Solidly. Because you know, I launched it as a purely decentralized primitive. I could not interact with it, I could not update anything, I could not change it. I wanted to have something as pure as Uni V2 was. Um but already back then, you could see that the audience no longer cared about that. That, that's not what they understood. You know, they, they want a team that is going to continue building and maintaining, and they don't want decentralized primitives. They want, nowadays people building successful crypto businesses. Nothing wrong with that, again, I, I, I, I myself, am, um, well I don't know about the successful part, but I'm building crypto businesses. We'll find out about the successful later.  Um so, so I think, you know the space has changed, the people has changed, the requirements has changed and, and it, it's sometimes hard to apply our old mental models to the, the current, or even future ones that they are going to be. But, but we have to constantly be updating what we think of the space, and how we look at the space. Um another example you know, ah, from my personal experience is I, I received a massive backlash when I started, you know, talking about and exploring regulatory crypto. Um the most prevalent one you know is, is that you know, okay, but I've now made my success and then I closed the door behind me. Just wrong for a bunch of reasons that, that we can go into, but I also don't want to waste the focus of this podcast, but that already was, you know, acknowledging the fact that we're moving away from true decentralization, and we're moving to businesses. Um nowadays you know, if, if, if you're gonna be maintaining that entity and you are an active participant, slapping a DAO on it and calling it a day is not enough. You need a registered entity, you need to have, you know, your checks and balances in order, you need to have a incorporated something somewhere. Um because the, the, the flip side to that is if, if you don't put your flag in the ground and say, hey I am ABC from XYZ, and a lot of your users for example are from China, then China's gonna say, okay, but you're not incorporated so you're now part of China. So, gift. Um so the, the regulatory side is, is, it's, it's not a, hey screw you degens that just want to ape. They're still gonna degen and ape because no one can do anything to them, but, but these teams are a hundred percent of target. Um, and they need to look at those things to protect themselves. Ah, again I go on such tangents. I apologize, it's been a while. <noise> No, no, but it's the stuff. <noise> I mean, I, I, I'm thoroughly enjoying um I think like part of the podcast that ah we wanted to get into was one of your recent, one of your recent tweets that kinda stirred up this like modular community that pays attention to a lot of our content as well as like the ETH rollup community which was um basically your tweet said that the idea of launching your own app chain for like an L2 is like ridiculous because it's extremely expensive, and, and I'm kinda generalizing this but before we get into exactly kinda that, I just want to preface the community so they understand your perception with building ah kinda Sonic, and kinda why you may feel this way outside of just like the logical reasoning. So, basically people have been asking what is Sonic. So, Sonic is a EVM compatible L1, um, super high-performance, uh you, you guys are are advertising over 10K TPS sub-second finality, basically trying to provide developers with you know exce, exceptional scalability, good security, and basically this fee monetization program where you return 90 percent of the basically the block space demand from these ah apps on Sonic back to the Dapps themselves with, in this broader community initiative which I think is ongoing right now in the biggest way ever, of like, make apps great again, and like, let's not give all the MEV to the validators. In, in your blog post you wrote that you love validators, I sense some sarcasm in that one, but <noise> you maybe, you do. So, like is that an accurate understanding of what Sonic is and kinda like how you guys are thinking about it? And then like what is the relationship between Sonic and Fantom? And just like if you could just kinda clear that up a bit. It'd be fantastic and then we can kinda dive into some of the more technical stuff as to kinda as, you know, that app chain or not."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, I mean I'd, I, I, I, I hope people know about Fantom at least. Um I mean I think we're high enough in the rankings, I've been around long enough that people should at least, even if they haven't used it know of it. Um I mean, next to Ethereum, we were the oldest"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "We, we, yeah. It, it is the oldest operational EVM. Um so I, I think that counts for something and you know, one of the highest, excluding Ethereum, one of the highest uptimes of, of any chain out there. Um Sonic, Sonic originally started as an internal um project name really for our next iteration. So, so we, we ended up getting a bunch of insanely talented professors um and PhD guys from all over the world who, who all have very very specialized fields. You know, these guys weren't like, we build blockchains. They were like, oh, this one guy, he builds these specific op codes for this VM, and you know, oh, this guy built these specific, like B-tree indexes for databases, you know, ridiculously specialized stuff. But all of these guys came, came with such a wealth of information and their respective fields, that when, when we started engaging with them, we started hiring a lot of them, they presented a lot of amazing solutions and fixes for what blockchains could still accomplish. And, and to digress a little bit, you know, th- this is something that I've seen in crypto so much, and, and it's largely part to, you know, a lot of the sort of I think cypher punk philosophy of screw institutional knowledge and blah blah blah. But we spend so much time reinventing wheels, and not learning from industries that have already been through this stuff for decades.  Um so there's a wealth of traditional information out there in the technology sector that's just not applied to crypto. Anyway, so what we wanted to accomplish: bring these guys in.  So I, I'm trying to recall now, I remember back then, I was pushing for VM parallelization um and for us to find ways to create optimistic ways to execute transactions as quickly as possible, and by having the, the transactions themselves identify the memory space that they want to access, so that, you know, we can sort of pre-sort based on who's accessing what memory, and then we can do parallel executions. Um, and we were gung-ho on that, and we were busy developing that stuff, and then I remember when Schulz came in, um Professor Bernhard Schulz from, from University of Sydney, he's now with us full-time, thankfully. Man's a genius. Um he came in, and he was like, okay, well, him and his team are gonna spend a few months, and they're gonna run some, some, they're gonna build a system that's capable of doing proper performance analytics, um which at the time seemed a little bit, eh, but still. I was a hundred percent wrong. It's absolutely phenomenal.  Um anyway, fast forward, they finally built the stuff, and now they're, they're in a place where they can basically make really fast changes on the tech stack, and then really quickly re-run entire blockchain execution. Whether it's EVM, um Fantom, whatever. And this allowed them to more accurately start seeing where are the real bottlenecks. And something like 90 percent of the bottlenecks was just with the database read and writes. Um something I wasn't looking at, something we, we weren't even really exploring. So, he proposed this new database that now ended up being Carmen. Um and that was already a massive step. You know, that's a, that's a almost 8X performance on throughput right there. And then they approached the VM um, and they also started looking at parallelization, and it's still on the roadmap, but it's a much smaller line item than a lot of the other stuff. The, the main thing that they started focusing on the VM"
  }
]