[
  {
    "speaker": "Rob",
    "content": "from security you're going to go to Ethereum because that's what you're paying for, right? If you want maximum capture and you are willing to run all of those overheads, run your own app. But to take that back to to to the Youtube or Twitch example, you know, that's like that's like, hey, my content is successful on Youtube, so I'm gonna launch my own website so I don't have to share these with Youtube anymore."
  },
  {
    "speaker": "Andy",
    "content": "Well, that's in the current current And we see this in a lot of founders try to destroy that. I think that that's in the current paradigm, Andre, right? Where like the interoperability, and like, that there's there's there's these concepts are around how bridging isn't that easy, and you know, we still have to switch chains and things, right? So it feels like that. But like in a in a in a future world of interoperability between blockchains, either by coordinated block building or ZK proof aggregation, you you stack that on top of some sort of like chain abstracted wallet experience, which of of course, Sonic would be included in this kind of broader crypto chain experience, doesn't really matter if you're if you're an app on Youtube, it's like my channel on Youtube is, and you've got Andre's channel, and Rob's channel, and whether we're on the same base layer or we're all just a our own chain at the end of the day, the user experience shouldn't be drastically different. Um, and then I think like Right. So, so like the customizability that you get from being an app chain is a strong, strong argument towards the app chain. I think all the economic arguments I think some of yours are a little bit rooted in like 2020, in 2021. I I I'm not sure how where you are of kind of like the developments of the commoditization of the infrastructure stack, but I do think that like in that future world that app chain thesis becomes composed of like how custom do you want to build your execution environment? And if you don't really need that, then like something like Sonic makes a ton of sense. Right? But I think like broadly, the Youtube example is good for the here and now, but I also think that in a in a future world that the Youtube example will will look like my channel is my chain, but it's still connected to the entire Youtube network. Um, and so that that is kind of like what I'd push back on that example."
  },
  {
    "speaker": "Rob",
    "content": "Okay. So, so, there there's a lot of what ifs in that world, right? Like chain abstraction is not there. Wallet abstraction is not there. Interoperability is not there. And interoperability has been a hot topic of discussion since as early as 2017. Big guys back then, Aion, Vanchain, etcetera. Not around anymore. Or maybe they are. I just don't see them on my feed so if you are out there, my apologies. Do more Twitter stuff so I can see you again. Um, so, and and we've had our own massive interoperability incident with with with Multichain and and and the Chinese government seizing their servers and stuff, you know? So, um, I for now, I will say I do not believe that that abstracted future is anytime soon. Um, I'm actually willing to go as far as to say, I don't think we're ever going to see that abstracted future. Um, but let's let's park a pin on that. Let's ignore that quickly. Actually, first things first, a disclaimer. Right? I think this is important. I think one thing that I loved seeing on those posts that I did um, two biggest pushbacks were always, yeah, but a lot of the stuff is already been commoditized to the point where it costs zero. um, which I then went, and I looked at all of these things that they say is commoditized to where it's zero. It's not. It might be. It's not right now. Um, the other one is definitely that I'm living in 2020, 2021, which is interesting, because maybe, maybe I've definitely not been as active on Twitter, that's possible. There there definitely could be tech out there that I haven't seen. Um, but the main disclaimer that I wanted to get to, is that the biggest believers in rollup as a service, and that these things are commoditized to the point where it won't cause any friction are people selling rollups as a service. Or indirectly indirectly. Now, at the same time, I'm saying, hey, don't do that. Go to a layer one that shares the fees with you. And that's because I'm selling a layer one that shares the fees with you. So, you have to take into consideration where this information is coming from, right? Show me the incentive, I'll show you the outcome. Um, but I think it is important to take the year now into consideration, right? Like, like, sure, with enough foresight you could have said, “Oh, why build in MySpace? It's not going to exist in five years from now.” Um, but it's the only thing that could exist in the year now for the next iteration of stuff to happen. Now, a lot of these things that they say are commoditized; oracles, native issuance, um, bridging Those they aren't. They aren't. You know, like, like the one, the one response on one of Nick Nick White's tweets um, uh, was because, because he was commenting on mine where he was saying that, hey, look, um, you know, you get block explorers, Blockscout, you get oracles, um, Skew, and a few others that he mentioned. Um, you get, you know, bridged assets, which are as good as native assets. And and and the comment was there are stablecoins, then there are stablecoins. There are explorers, then there are explorers. There are bridges, then there are bridges. And and I think that is true. But now that being said, that doesn't mean no app chains will be successful, but it also means a lot won't be. You know, there are exceptions. But I think people are underestimating the real cost of overheads of running these things. A a big example right now is is um, I think it's Anisha, um, which I played with a bit, but which is, which is phenomenal. Like, I'm so shocked how easy Yeah, they have a great UI. it is to get, you know, sort of a test net, and everything up and running. Um, at the same time I can get a layer one up and running with a few clicks, within half an hour. That is not a layer one. You know, when I actually wanna productionize that thing, there are a lot more costs. There are a lot more overheads. There are a lot more integrations. There are a lot more BD. There's the sort of fun, experimental side, which is normally designed to be very easy, and then there's the production level side, which is a lot harder, and you need teams, and you need people that can support, and you need, you know, all of a sudden now, you need to think about hosting infrastructure. You need to think about, am I running this on someone else's infrastructure? I'm going to be running it myself? How are people going to be participating? How customizable are these things? Am I doing vendor lock-in when it comes to an article or a bridge or something? What if I need to change those later? What if these guys no longer support it, which we've also seen happen a lot in this space? So, there are a lot of lock-ins you do when you do that versus deploying a dapp on a layer one. A lot easier to move around, a lot easier to migrate. There's already a lot more infrastructure available. So, so while I acknowledge rollups as a service is definitely a lot further than I thought it was, but I think it is still very far away, and maybe we'll never get to the sort of end vision of complete abstraction. Because I have yet to see any real bridge breakthroughs that can get us there, with with maybe the exception of ZK tech, like I say, if it gets there or or maybe rather when it gets there because I do think it eventually gets there. Um, but there are a lot of problems to be solved in between now and then. You know? So, so, and and and one thing I, I do know our industry absolutely loves is, is building a technical solution, and then looking for a problem that fits instead of finding a problem and then building the solution. Yeah."
  },
  {
    "speaker": "Robbie",
    "content": "Yeah. I I I do think that there's there are arguments for the customizability of app chains even, given the the despite the the overhead. But you mentioned like the real overhead cost, and how that differs from the cost that is being paid to validators. And so I mean in my mind, part of the value in blockchains is that these systems are so dynamic that they converge to their real cost. Otherwise, someone else will come in and subvert it, and you'll pivot to the, to the technology provider that provides that at a lower cost. And so how is how, you know, I I saw on, on your article, you know, 2 1/2 billion dollars Uniswap has paid to to validators. Is that because the Ethereum security costs that much, or why, why I, I guess like, why?"
  },
  {
    "speaker": "Guest",
    "content": "Safe is moving the world's GDP on-chain. With the introduction of Safe net, Safe is taking this to the next step, very soon. Check out net.safe.global to learn more about how Safe is moving the world's GDP on-chain."
  },
  {
    "speaker": "Guest",
    "content": "Welcome aboard on our journey into the singularity. This is the endgame roadmap for Frax and Frax. The new L2 out of the Frax ecosystem that is totally based on fractal scaling. Fractal is a modular L2 blockchain built by Frax, with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images, and it explains"
  }
]