[
  {
    "speaker": "Guest",
    "content": "means how L2s become L3s and the entire app chain life cycle goes through its evolution. The Frax ecosystem is made of some of the top builders in the space, and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space, and this Frax still L2 joins the existing suite of Frax products, including Frax swap and Frax lend. You can see Frax, Fairy, the bridge to go from any chain: Arbitrum, Optimism or Mainnet into the Frax still Mainnet, bridge your tokens and bring your Frax assets into the Frax still ecosystem. Join today to get the best out of Frax still. You are still early. Join today, take part in our expedition into the singularity."
  },
  {
    "speaker": "Narrator",
    "content": "Redstone. Modular Oracles are available on 50 plus chains, trusted by over 100 clients and over 6 billion in total value secured. Visit redstone.finance to find out more."
  },
  {
    "speaker": "Rob",
    "content": "Oracles, again I think are a great example, you know there are a lot of Oracle providers out there. Some do an incredible job probably better than some of the best guys, but they're not used because they don't have that aggressive BD that locks in the big teams. If if you want Aave to deploy on your chain you're going to have to open your wallet and pay Chainglink. It is that simplistic. There is no two ways about it. So you know, there are oracles and then there are oracles. And I I originally, when I launched Yearn there's a medium post I did at this point probably six seven years ago, where I specifically said I am launching yearn and I am not adding any fee extraction because eventually someone will copy this code and the fees will converge to zero. So there's no point in having that fight I'm just going to make it zero from the start. And I was very wrong. Turns out you can add a lot of fees on top of that and people people almost feel safer when there are fees because then they feel, \"Oh there's someone that's actually looking after this and they're maintaining it, and they're making sure it's in the right places, etcetera.\" Um I I loosely sort of follow US politics to give a different example. In terms of their economic policy, not so much about anything in the country. But but one thing that that that I didn't know, that I started looking into, was was tariffs. This is currently a big topic, you know, putting a tariff on external goods being important in the country. Um and it was I chicken tariffs, if I remember correctly, that they were importing chicken tariffs. And they ended up putting a tariff on all external imports of like 20 percent. And this was back in like 1960 or something, something around there. A very long time ago. And it was meant to only be for like five years. That tariff still exists today because what ended up happening is now all of the imported chickens all of a sudden cost a lot more. So what you expect is now consumers are buying the local stuff. But instead, the local guy saw, \"Hm, that costs a lot more. Let's upper prices.\" And now when people try and kill these tariffs these guys, with all of this extra profit, are lobbying to say, \"No no no no no no no no no! Don't do that, don't do that. Let's keep these tariffs. We like these tariffs, these are good tariffs.\" And everyone got screwed except the local producers who could just take that extra 20 percent as a pure profit margin. So there's there's there's the theory, which is the same in you know, capital efficient markets, which say that it converges to, you know, the real cost. It's just not true. That's not how humanity and greed works. Um and it's the same for these blockchain solutions now. So so again you've got the social element, which is okay, this oracle does the same job, but it doesn't have that that stamp of approval that a lot of these teams want. The same thing with a lot of the the the the the so-called native USDC. um And and all respect, again to teams like LayerZero um we're more well, I guess not Wormhole anymore, hey? But but all of these guys like like it it has worked great, and so far there has not been issues, but a user that's holding let's say $5 million in USDC is still going to want the native issued instead of the bridge one. Just again from that social mental perspective, even though technologically it's the same thing. So in in practice, yes, it should converge to zero. But we've seen for a very long time, Blockscout I think is a great example. Fantastic explorer, I used to use them on all of my experimental and even when we launched Phantom for the first time. Blockscout was what we used. They were phenomenal. They are still phenomenal, but they're just not not as good as Etherscan and they're just doesn't have that same name recognition. So the big chains are willing to pay Etherscan so that they can deploy that. They're willing to pay Chainglink so that they can get the oracle, they're willing to play Circle, so that they can get the USDC issuance. Because that that little bit of brand and that bit of recognition is worth more than just having the stablecoin or the oracle or the bridge or the explorer. And I think that's being missed by a lot of these guys and that's because none of them have yet gone from this is technologically possible, which it is, right now, it is technologically possible to launch a roll up at near zero costs, that has a block explorer, that has stable coins, that has an oracle, that has a bridge. This is a fact. I've seen it myself. But, you know, it's it's it's not a production scale Circle issued, Chainglink supported, etcetera, etcetera."
  },
  {
    "speaker": "Andy",
    "content": "I mean and that was your argument in in the post, right? Like like you like, if you're trying to build for a top ten chain, right? Then there's a different level of scale that you're going for and I'm actually like I'm literally here with a friend who's building like his his own L2 using uh kind of like a customized execution environment and you know, they're going to raise their Series A for you know, many millions because it costs them a a lot of money. And I asked him today, I was like, \"What's your what's your burn?\" He was like, \"It's around 400 grand a month.\" And I was like, \"Holy shit!\" It'll spike quick. It'll spike quick. And I was like yeah, and they're on like you know, they're they're pre-main net, right? And so and so I think that that undeniably is is is true. But I think like you know, there's there's use cases where like stable coins or stable coins bridges, bridges. It's great. It's great. You know, I think like gaming is a good one that we've seen. Social stuff. 100 percent. 100 percent. Oh yeah yeah. Off the grid is a great example I think. I mean, we'll we'll we'll see how well it still does in the future. But but that's a that's a comment on the game, not a comment on the tech. You know, whoever launched it there, by giving it its own chain with its own cost and everything, great, 100 percent, wonderful idea. Exactly. Um stuff like Lens. Off off the grid is a good, great example I think. Exactly. We'll we'll see how well it still does in the future. But but that's a that's a comment on the game, not a comment on the tech. You know, whoever launched it there, by giving it its own chain with its own cost and everything. Great, 100 percent, wonderful idea. Exactly. Is there a spectrum of like of like applications or like specific is it like applications which don't need that much interoperability, perhaps are not that financially sensitive, but maybe require like extensive customize cust- customizability or uh a special like UX, maybe, or something like, is is there a class of applications other than just like I'm Polymarket, I have a massive marketplace, I've I'm getting all my traffic from like mass media to polymarket.com. They're not coming in from Binance, you know, I can just launch my own chain or, you know, Unit chain, like outside of like these large ones, is there like a spectrum that you think of like what class of application is better suited for that for the for the app chain model versus if not, or or not?"
  },
  {
    "speaker": "Rob",
    "content": "So so in in the current iteration of this world, I would say app chain works if you don't need interoperability or composability. But, if you don't need interoperability or composability, launch an AWS server with a MongoDB database. You do not need the extra complexity of blockchain on top of that. Blockchain's beauty comes in when you add the interoperability and composability. So again, it feels like a technological solution trying to fit the problem instead of the other way around."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. So you so you like the app chain thesis as a technologic- as a technologist Oh yeah. because uh because of Is it is it is it the sovereignty properties or what is the properties that that appeal to you?"
  },
  {
    "speaker": "Rob",
    "content": "Uh I I Truth be told, it's just awesome. I mean, like like I the amount of effort it took to launch a blockchain, when I did my first ones in 2017 2018, versus now being able to go Yeah. tick tick tick tick, launch. Having a block explorer, oracles, it's just cool, man. Like I I don't think it's practical. I won't use it or launch anything with it, but it's just amazing! I mean, it the space has come so far that we've gotten to a point where we can offer that to someone. What what I'm a little bit worried about is, you know, new people coming into the space, seeing that and thinking when they click those tick boxes and say launch, then they're golden. Because, like, your battle has only started then and you probably need to investigate a little bit more on your requirements. For now, I think for now, I think L2s have just moved the the value extraction. You know, it used to be Layer 1 value"
  }
]