[
  {
    "speaker": "Guest",
    "content": "Yeah, um I can give you a quick intro to the nomata I mean nomata was a problem that I had that I think a number of us have um which is I sometimes send money to people uh in crypto and it's very annoying if they all can collate each other and like all the services and like the various people can exactly tie this all back to me and I think I do the same thing that I think most of us do which is we like use a centralized exchange to give us new addresses and we effectively use like I mean coinbase is the single largest mixer in the world um so it's like kraken by finance and like it's not a problem but but like just very fundamentally I think a lot of people use this this way um and so to me always the problem became I I I wanted to some amount of privacy guarantees that existed for assets that are already held like it always seem very nonsensical to tie this to specific asset classes so monetary policies um and so how do you have something that's fully acid agnostic um and at the time when we started nomata it's um this was really like it's a it was a personal problem it's like something at the anoma community like a number of us in the anoma community really deeply cared about like the the ability to experiment with some sort of like data protection guarantees, data flow guarantees, privacy guarantees right? And so nomata was really like um the early anoma community scientific experiment like what does this actually look like because we haven't really seen this in practice um in sort of like fully asset agnostic way um and this is really starting it's really taking a life of its own I mean the nomata community is huge right now like you you said this will come out when nomata launches like cool, I don't know uh the validators are standing up in net work like I'm not involved I'm not running a validator, I'm not running a node um I hope they know what they're doing um"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, but there's been some like some budding of heads going on, what's going on there? What what's uh people are upset?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I think people like I think we tried something radical and uh this is actually much more technologically driven than even well it's a little bit of both I I think uh I think the budding of heads you're referring to is a little bit around um sort of like no locks full unlocks um this is impossible to do in a privacy preserving way um so if you actually want to have a good privacy preserving system or data flow uh privacy preserving system uh this is very difficult um like to build this and actually I know of no system that has this. I know of a couple of systems that has like some contracts of chain that say like oh please don't move your assets around um but the this is very difficult to build if you have a multi asset shielded set right um and this is sort of the first technical reason honestly if someone wants to propose this, please go ahead like this this is all open source like propose a different schedule um to the community and see what happens there. Uh and I think this is honestly always my uh answer like these are decentralized systems um and I think over time we've lost this ethos but like I remember very vividly when we start up cosmos and tezos and like polkara, kusama and like some of these were more centralized than others and the cosmos was by far the most decentralized network launch. But these are like fundamentally like these are communities like if you don't like something like propose something it's not just and like especially with the el2s that are I mean practically they just look very centralized. I think sort of the um community like people right now sort of expect that this is like clean cut as a product built by central organization like I don't know what to tell you, I I care about decentralization so these things actually end up being decentralized. I don't really want to be in charge of running a server that does a thing for you. Uh these are community projects, these are community owned um so my answers always been like if you don't like something change it, right? Like because this is how I got into the space um the other social thing on like whether lockups make sense I don't know it seems unlikely that they like net positive because they just skew the market incentives and just bleed the market in like they split the market incentives of a longer period of time and to me it always seems like for example, when cosmos like launched it was pretty cheap at launch like for a while uh and so it allowed a bunch of early investors, like same for ethereum like you don't actually like this high fdv low float matter um it's horrendous. And everyone agrees here, but everyone goes like yeah we should keep doing this because like everyone is currently like um the vc's are getting filthy rich of this matter of like the high low uh low float high fdv and I just don't think it is good for communities. Uh the one interesting aspect that I didn't think about um when sort of thinking about this problem space a little bit is you know, the one the one group of people that really benefits from this is professional aid drop farmers. Because the airdrops tend to be really liquid, and so if you run an airdrop farm or like if you are now one of the hedge funds farming these airdrops like you have all incentives to like keep the low float high fdv matter going right because you like the one person that's unlocked you like can sell vast and we see them so like I I think a lot of this sentiment is really driven that by the fact that we have a very poor signal to noise ration ratio in the space at the moment which is like dominated by in like identity economics but if you are 200 people and like as a sta like 200 people uh kind of like airdrop farming operation like one stack net airdrop is going to be your yearly income. Like yeah I get why like these economics are kind of like why like these economics but overall long term, I am pretty convinced that um like these locks do nothing except like skew eventual results and I mean we see this, like a single thing that launch in the last 12 months that's not bleeding um I mean like I don't look at your favorite thing but like well some people may like are up if they bought in the first like two days or so um I don't know this doesn't seem healthy. It seems much better to uh sort of grow communities organically because I mean why are people so bullish on ethereum like why like because when ethereum was launched it was cool, it was cheap it was like we just hacked with it. Um like and this was fun I mean this was like the thing and like as a result a bunch of people sort of like wrote up the wave and um are now really deeply invested in ethereum and the asset and the sort of user base and like the technology and I think this is a much healthier way for communities to grow."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I've been seeing some interesting research also around growth based unlocks and growth based investment schedules TVL uh user count metrics things that uh that can basically alleviate the cell pressure of insiders because of the metrics are like really strong and so it's like there's a fundamental reason there's a fundamental kind of value to this token or to this asset to this network."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "and so kind of a uh balancing that with the with the unlock schedule is interesting. I I Rob do you have something else to add there?"
  },
  {
    "speaker": "Rob",
    "content": "No, I mean I I like that that model as well and it it reminds me of uh kpi tokens that were around for a little while um haven't seen those in quite a long time but I think there's similarities uh and also seems to smooth out some of the dynamics that that Adrian brought up."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. I mean just uh as we kind of wrap we talked kind of I I didn't mean to to to have the whole nomata section go into putting Adrian on the spot because he shi- he shadowed on our market map, but I guess the tides have kind of turned Adrian"
  },
  {
    "speaker": "Guest",
    "content": "The tides have turned I see. But um maybe you can just like allude to the importance of privacy from an ethos perspective for a couple of minutes and then we we can wrap because I think that's the big that's the big unlock here."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, so I think when I think of data protection or privacy it's like current systems have a lot of default data protection right like my bank account isn't readable to the public my bank does a reasonal job like reasonal job um sort of protecting me from leaking a lot of information towards the external world um and I just don't see these systems ever gaining tractions without this. Um because fundamentally like my parents will not want a system where their neighbor see how much money they make. Like it's not going to happen like there's no amount of yield farming I can promise them where they go yes, I'm willing to give up my entire privacy to the rest of the world forever in in to eternity. Right, like that's not happening. Um so I think outside of like the airdrop farming like shitcoin trading use cases. This is going to be a fundamental requirement. Um and nomata really is like it's the first steps like let's try this out, let's see how this works in practice uh let's experiment with this because really historically there has been very little done on this front. And so like over time this is also why I think of like nomata is just the first project or like it's an effort by the anoma ecosystem to like start pushing this forward. Um because over time as we learn more we can start also like integrating more into nomata connecting these eco like these uh systems closely together, maybe have something like um sort of what nomata's not proposing with I think um shielded action so like cross chain things when nomata provides a shielded set um and I think so this is quite important. The other thing is I think we should really be more worried about surveillance states than we are right now. Uh I think there was sort of a long wave around like 2014 cambridge analytica where everyone was very concerned about this and then just died down and like to me this is never like this is not gone away. Um and I think to a large extent the reason why facebook was in this weird position where they could influence US elections was not because there were bad people but because their business model fundamentally required it, right? Like they sold ads. And it turns out that a bunch of people were just high just bid us for these ads. Like they sold the data they had it was like they weren't acting unethically. They were acting within sort of the constraints of their business model and so I think if we want to safe guard democracy we just need better data protection systems so that people aren't put on the spot like where publicly traded company has to decide and like do I like follow shareholder code and like maximize profit or do I follow like human ethics and not try to sell all my data to uh third countries um and the other thing is on on the self sovereign infrastructure side I live in Switzerland. I like Switzerland right like I have no illusion that Switzerland is not prepared for nation state attack in in the digital world. Like the idea that the Swiss financial system will survive a dedicated onslaught by a dedicated actor is idiotic to believe. Like this system collapses immediately. And then you just leak a bunch of data to sort of foreign entities. And so I think I never think about data protection as like as like against the government. I think about this is like data protection for pri- for national defense I think like every like person who cares about their local community should care about this because these things are honeypots and it is not like you want to protect this data because like if your financial data fully leaks to some adversary like you are in deep shit. So like I think about this is like data privacy data protection for national defense for community defense and really like allowing people to to like safeguard democracy. You know, like in a fully transparent system I think we're going to have a hard time and I see the authoritarian trends in Europe and like well, let's pretend that we can build like super stable systems that definitely won- won't get captured. And like yeah I don't know. East Germany and the Starzy is really like only 40 well 40 years ago. I don't know, this like seems too recent to make this jump to like start going like yeah we definitely should trust these like totally competent bureaucra- bureaucrats in Brussels to like do the right thing all the time. Um"
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I think a lot of us in this space share a similar ideology. I mean I've just been personally like outside of the US for the last two years or so, traveling around and I feel more empowered just you know not being in one country with one place and like just kind of moving around and there's a lot of different ways that you can empower yourself but I think privacy is one of the largest and then having private on chain assets is about as good as it gets from a financial standpoint in today's world."
  },
  {
    "speaker": "Guest",
    "content": "Yeah so it will get better over time and like in the future we can start like once you start having intents you can start building not just like transfers for like privacy preserving transfers but you can also start building like privacy preserving voting systems, you can like do actually like um privacy preserving public goods funding. Things like this where like I may not want to publicly admit that I'm like pro nuclear in Germany um and to like being able to do this like privately it seems like a very good first step for me. Um so I I'm very excited about this and I think if we don't solve this like we need to solve a bunch of things in in this industry and I'm really kind of worried that we just running around in circles um because no one is willing to tackle sort of like the hard distributed systems problems and like how do a lot of these systems connect to each other? How do you like get reasonable guarantee for end users. And it was like yeah, I I'll do this super quick EVM based roll up in rust and like I like the EVM, but like do we need another 500 roll ups, I don't know, it seems like spend some engineering time on like something that like advances us a little bit forward, like if you keep doing the same thing as the next guy will probably not make much progress"
  },
  {
    "speaker": "Andy",
    "content": "Yep. Yep. Thank you for your time Adrian"
  },
  {
    "speaker": "Rob",
    "content": "Yeah, thank you man. In in a world of forks, you guys are building spoons. So uh kudos and thanks for coming on."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, thank you for having me."
  }
]