[
  {
    "speaker": "Andy",
    "content": "What a day. It's the beginning of ARBIVERSE. I mean, 2 years ago people didn't even know what Offchain Labs was."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Rollups were completely new. Yeah. And now we've kind of got this like bustling ecosystem of builders, users. Um, how do you feel about that, about the growth overall and just broader reflection?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah. I mean, it's incredible. When we started this, when we started the company in uh 2018, uh it was just like 3 people in a room, um and we had an idea kind of of what we wanted to do but to see it grow into this uh, you know, the Offchain Labs team, the Arbitrum Foundation, and then this incredible community, having events like this, ARBIVERSE, um yeah, I would've never imagined this could happen."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, I think that the the Arbitrum ecosystem has gone through several different uh like evolutions, right? It started as uh you know, first like the Arbitrum airdrop was a very notable one for being a large airdrop for Ethereum users. And that kind of got this like initial community bootstrap. Yeah. Then really kind of dominated on DeFi as well, which I still think is very, very prevalent, gaming and then now it's just evolved so much. Yeah. Um, how do you kind of uh conceptualize what Arbitrum is? Like you've got all these different product suites and what Offchain Labs kind of is. Like how does this come together?"
  },
  {
    "speaker": "Andy",
    "content": "I mean one thing that's really changed is we started out with a single chain, right? What Arbitrum One, um and that was what it was, right? It was fairly robust, it did it did the job, but now there's so much more variety, so much more diversity in the ecosystem, so many applications, but also now with Orbit, uh, lots of different chains doing many different things, for gaming or for other, uh, for other sectors. So, um, you know, I think I think what started as just one piece of technology, now really is an ecosystem. Uh, and there's so many teams that are building within this space and that are, you know, have decided to sort of, uh, to, you know, to commit to being in the Arbitrum space. Um, and as that happens, the community takes on a life of its own. That's the one of the things that's really exciting to me is the Arbitrum DAO sort of achieving uh that escape velocity to where they are, uh, really, um, operating as a community and they're being strategic, you have this really sophisticated conversations going on in the DAO about what the direction should be. Um, you know, it's not, it wasn't a given when we started and launched the DAO that it was gonna turn into this, um, but this is kind of what we imagined or hoped it would be."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Yeah, I mean, um human coordination at massive scale is very difficult without that kind of top-down, uh, hierarchical leadership. And I think uh we we saw this really big emergence of DAOs, couple years ago and they've kind of somehow like fizzled into the back into like the background of of crypto today. But I think Arbitrum DAO is a good example of of how they still power some of the most important networks in the space. Yeah. Um, but are they've kind of taken this backseat?"
  },
  {
    "speaker": "Andy",
    "content": "Well, I think it it differs actually. I think, uh, DAOs some DAOs are different, right? Um, one of the things we worked really hard when we sort of envisioned and initially set up this, this thing before we sort of launched it and set it free, um, you know, we really thought hard about what we thought would be needed for the DAO to be empowered, right? Um, and that included a bunch of things, but, um, and some of those things are technical, right? The way that DAO voting works, where when the DAO votes to do a thing, that thing automatically on-chain happens, right? It's not just a polite request to some multisig to please do something, right? The DAO has ultimately holds the holds the ultimate control. Um, and that was an important part of it. Um, but, um, then I think you know, it takes a lot of work for people to sort of uh, to sort of foster that the growth of that community, um, but in some ways it's like uh, you know, raising a child in the sense that, you know, they become more independent and if you're doing it right, they become more and more independent and then they reach the point where not only they're adults but they're actually more capable and impressive than you. Um, which is, of course, the goal that you should have. Yeah. Yeah. Um, but that doesn't always happen, it doesn't happen automatically, Right. right? Um, I think you know, from the very beginning, even the main net launch of, um, Arbitrum One, uh, you know, we put a lot of thought into the fair launch uh, concept, right? This idea that we really wanted to foster a variety of different applications, not just like pick one winner in each area, but, uh, but to say you know, we wanna have a big tent, we wanna welcome everyone in, uh, we wanna provide support and a technology that is easier to adopt, so then you get a broader community. And I think that sustains over time."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, so I understand that uh you're quite deep into a lot of the research that goes into Arbitrum itself, uh Arbitrum One, Orbit, Stylus, multi-VM, kind of the whole lot. Yeah. And so compounding off this uh community-oriented discussion, Offchain Labs itself is also pushing forward a lot of research Yeah. uh over the last several years and looking ahead. What are some of the most important research breakthroughs or initiatives that you guys are pioneering today uh to to push the the future of Arbitrum forward?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah. I mean I think I think the things that are sort of next on the agenda for the DAO to look at or the DAO has been looking at are Bold and Timeboost. Okay. Bold is the next gen uh proving protocol that allows, uh, allows permissionless validation, um, which is really kind of a remarkable thing that any one user anywhere in the world with just a single regular laptop can force the chain to stay correct and can force it to make progress. So even if everyone else in the world is against you, uh if you with your laptop can be can be the hero who makes Arbitrum continue to operate. Um, and that's kind of incredible from the standpoint of decentralization, right? It's the ultimate in decentralization. One person armed with the truth uh, can win out. Um, so that's Bold. Um, and then Timeboost is a mechanism for uh, that does a couple things. Uh, it's a slight change the way sequencing works, but the bottom line is that it reduces the amount of spam transactions on the chain, um, and then it also allows the DAO to capture, uh, a bunch of the value of MEV that that their chain is generating."
  },
  {
    "speaker": "Rob",
    "content": "Got it. So on the on the Bold front, the first point, the core breakthrough there with this honest minority assumption is effectively that as long as there's one good actor that is that can hold the the the information about the Arbitrum One blockchain Yeah. uh on a very easy CPU device, MacBook Pro, Yeah. then then the integrity of Arbitrum One itself can be, uh, sustained."
  },
  {
    "speaker": "Andy",
    "content": "Exactly right. You can protect the integrity of the chain and you can stop the and you can and you can uh cause the chain to actually keep making progress, right? All by yourself."
  },
  {
    "speaker": "Rob",
    "content": "Okay, and then on the Timeboost proposal, this was more of a of a breakthrough uh from the previous way that L2s specifically Arbitrum One and others were sequenced. Kinda of a shift from that first-come, first-serve model. Now to almost what is like proposer-builder separation on the L2, but not exactly."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Yeah. I think I mean, I think it's a better fit for L2s needs. I mean, L2s and Arbitrum, you know, is one of the pioneers of this, uh, do the sequencing or block building differently from L1, in a way that is more protective of users, Right. right? Protects you against front-running and sandwiching, uh for example. Um, and is also very fast, right? Much faster than L1, uh you have to you have 250 millisecond block time and that can go down to at least a 100 milliseconds, their Orbit chains that do that. So, I think Arbitrum sequencer has been great, um, in a lot of ways, uh, but the one thing that it didn't do is uh capture, uh, capture MEV value, um, and, um, and that's something that uh Timeboost lets you do. Um, and so that's available to the DAO. I know that, you know, delegates have been looking carefully at this, there's a lot of discourse around it. And the other thing about sequencing that's currently um, uh, you know, we've been talking about is a project that we've been doing jointly with the Espresso Systems. Yeah. To decentralize the Arbitrum sequencer. So it is basically take the the sequencer that you know and love plus time boost and then make a decentralized version of it so that you don't have to rely on us, on one party uh, to ensure that the chain can make progress efficiently."
  },
  {
    "speaker": "Rob",
    "content": "So this single sequencer model, which I prefer that term over centralized sequencer model as well. Yeah. This single sequencer model is highly effective for um transaction ordering and for uh, the ability to basically have very fast pre-confirmations and extremely low-latency transactions. Yeah. Moving into the next stage of Arbitrum requires, would you say more?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  }
]