[
  {
    "speaker": "Guest 1",
    "content": "are responsible for picking the order. So, to enforce their own ordering, the only thing that dApps can do essentially, they can say, “Well, I’m not playing that game with you. So, if you don’t sequence according to my rules, then you are not getting my liquidity, you are not getting access to my protocol and all of that.” Which again uh might work, but it does have a um that does impose some additional restrictions on composability. Maybe those restrictions are not as important. Maybe composability is not important in itself. I would not love to see that because I think that we are in a space where composability becomes not important, then really there is not much sense in doing things in a decentralized way anymore because now everyone can do their own thing. Mm-hmm. And then whatever somebody comes up with, you could come up with the most beautiful uh algorithm mechanism or whatever, I can always run it on a centralized server and make it more efficient and just beat you on speed, latency, throughput, all of the parameters, right? Whatever can be done uh that way can also be done in a centralized fashion. And so I think that this is the beauty of composability in all of this is that uh this is something that uh you cannot really uh replicate. You have to be where everything else is happening and you have to be able to provide liquidity to transactions even though they are not sequenced by you. Mm-hmm. Mm-hmm. But again, it’s a very interesting design space, so some people thinking how to relax it. Maybe we should be a little bit more mindful about some of these limitations. Mm-hmm. So I certainly expect to see and would love to see more innovation in this uh area. "
  },
  {
    "speaker": "Guest 2",
    "content": "Also, one thing I would like to say is that there’s a there’s a a marked difference between uh like the two approaches that I've discussed about share sequencing and builder commitments. Um like as Alex said like builder commitment, uh sorry, serious sequencing is a very complex uh problem. Like, you know, there are few notable projects that are working on this space that are trying to figure out how this uh very complex combinatorial auctions even work when you have uh multiple entities with different uh um objective functions that are optimizing for different things. And doing that combinatorial auction is you know, uh I I I don’t know if you have a solution for that, but it’s uh a hell of a complicated thing. I don’t even want to think about how to you know, design that. But um but then you go back to the other side, which is the builder commitments. Um I personally believe, and I you know, please feel free to disagree with me as well, but I I do think that the the builder commitment is already happening a lot today. And the reason why I say that is because I believe bundle in general, like a transaction bundle within a block in general is a form of uh uh builder commitment or you can argue that uh uh it’s a it’s a form like relay and builder commitments. Meaning that those transactions when it comes and lands to the hands of the relays with the payload, they are not being uh unbun un unbundled in in some uh malicious ways. And that’s sort of like a um implicit commitments that uh people are receiving when they submit this kind of a transaction bundles. So, in some way, I s I believe that uh this kind of builder commitment is already happening uh in obviously uh uh somewhat trust trusted fa fashion, right? Because we still rely on uh relays to facilit a lot of this. But there are also um there are also uh uh like more expressive ways in which we can enable such a commitments that kind of gets into how I was thinking about, “Okay, what if we can enable uh builders to commit to uh uh inc uh commit to having transactions and executed in combination with our bundles with some other like external transactions such that they can achieve uh composability between transactions outside of our protocol and transactions insid or in inside of a transaction bundle and then you would able able to receive atomic guarantees uh atomic composability guarantees uh via such kind of like a builder commitments? Yeah. "
  },
  {
    "speaker": "Rob",
    "content": "Welcome aboard on our journey into the singularity. This is the end-game roadmap for Frax and Fraxtol. The new L2 out of the Frax ecosystem that is totally based on fractal scaling. Fraxtol is a modular L2 blockchain built by Frax with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images and it explains how L2s become L3s, and the entire app chain lifecycle goes through its evolution. The Frax ecosystem is made of some of the top builders in the space and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space, and this Fraxtol L2 joins the existing suite of Frax products including Frax Swap and Frax Lend. You can see Frax, Fairy, the bridge to go from any chain, Arbitrum, Optimism, or Mainnet, into the Fraxtol Mainnet, bridge your tokens and bring your Frax assets into the Fraxtol ecosystem. Join today to get the best out of Fraxtol, you are still early. Join today, take part in our expedition into the singularity. "
  },
  {
    "speaker": "Guest 1",
    "content": "We have looked at some uh data. We haven’t circulated it yet, but uh my impression is that uh let me just give you my impression. And I I know that you have the uh the new dashboard, so you might want to double check those numbers. Uh my impression is that generally uh it’s a lot, in particular, the large transactions. Um Yeah. What what transactions? Large, large. Like if Large uninformed transactions you usually can generally  you know, a lot of income is coming from those transactions, but it’s you know it’s one of those questions that again, I think it’s impossible to answer. Basically, we just have to wait and see and uh uh try and see what happens. Um I just feel like if again, if we lose composability, then uh do we have a shot at competing with uh more centralized solutions? Mm-hmm. Mm-hmm. That to me is uh a really big uh open question. Mm-hmm. And again, there are chains already that are faster, right? So you you you almost like I always have this feeling that you almost becoming like an L2 essentially. You you are not exactly an L2, but you already sequencing your transactions, right? So there’s a question if you know, there’s Arbitrum uh with lots of liquidity and they used to have first-come-first-serve sequencing. So, they minimize MEV quite a bit and liquidity is deep there. And so if you want to compete with them, um then uh a transaction that doesn’t need to be composable, if you just need to source if somewhere Mm-hmm. and uh you just want to be balanced as in terms of your general portfolio, you don’t need to be balanced in the specific transaction. You know, you can you can you can buy it from a different chain uh on an L2 and uh achieve a similar result. Mm-hmm. And those are already very deep and liquid uh um markets. Uh pretty efficient in terms of minimizing MEV, just again, on account of having low block times and low transaction costs. Mm-hmm. So, there is a lot of uh uh competition in that area. But um again, I I I understand that there’s a difference between up specific sequencing and Mm-hmm. a rollup. Mm-hmm. Specific sequencing is still a little bit closer. So, maybe it’s a spectrum, right? We’re a little bit closer to the Mainnet. We’re getting a little bit more of the uninformed flow uh than those Arbitrum guys. But we may be "
  }
]