[
  {
    "speaker": "Guest",
    "content": "UX uh improvements for the users um just because it's no longer like a 12 seconds but now maybe it's a uh four seconds or three seconds or whatever that may be. So it does feels to me that it's a UX improvement. Um and and also uh as as it is the case with uh Arbitrum uh that uh uh there would be uh sort of like magnitude less uh economic impact to the LP uh due to lever giving a lower uh block time and um and that is I think it's also pretty shown uh well on some other L2s uh as well. Uh but in terms of the sort of like the problems and trying to have the solutions for for this um I would say like block time is decreasing block time is is like still like very much up in the air like I think there's a lot of contentions there so I'm not sure if that would realistically be something that we can uh uh rely on. Uh what we are trying to pursue uh right now is uh is via this uh approach called uh application specific sequencing which I often like to call uh as. And um um and just for context you know I I before I I hopped on to really you know dive into this name of as I took a vote uh publicly on Twitter and made sure that everyone's actually you know happy with this name so that I can actually be confident about that okay I can say this publicly. Um anyway so so yeah that that was that. Um so so yeah so we're trying to do this as uh as thing but what what is as uh specifically um so uh some of the sort of like work that has previously inspired and reinforced our belief for as is actually done by some researchers who worked on like the verifiable sequencing rule for uh decentralized exchanges. Uh there was a paper um uh that was also uh written by Tarun on the um the theory towards uh MEV on uncertainty where they have extensively discussed and demonstrated that the um essentially like with uh with anything around like arbitrage, sandwiching, front running, back running, um that oftentimes yields a uh a very uh uh complex uh pay function for the users and also for the validators, meaning those people who are including those block behind the scene. Um it's oftentimes um more favorable to use something like application specific sequencing such that you can uh basically tailor and optimize uh one pay of functions over the others. So if I let's say if if my objective is to say that okay I wanna um I wanna optimize the the outcome for the swappers, right or or like people who are trading on the protocol then I would essentially be uh be be enforcing rules within this app as uh setup such that the users would be uh let's say getting the best optimal price possible within the the flows of transaction that needed to be sequenced all together. And in a similar fashion I can also have a objective function where we can uh we we we wanna optimize the economic payoff of the LPs right which are also participants in in this case and uh we can have the uh sequencing rules in such a fashion that LPs now would get the um most uh value out of this whole uh sequencing that is done uh in in our as uh setup. So in such fashion uh we are essentially trying to um help LPs help swappers get the best economic payoff possible by having our own app specific sequencing rules and app specific sequencing in general. So that's essentially what we're trying to do uh with uh with our protocol called Ethereum. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And so so like so so to put this into a perspective of applications on the L1 are almost like you sit down at a restaurant and there's a set menu and these are the these are the items that you're having and this is the rules that you're following based on this menu that's the night. The application specific sequencing model with customizations for different functions is almost like you walk into a buffet and you can kind of pick and choose what you want to optimize for that in that evening in that application in that chain and basically you can create the outcome that you want for your use case um and you can kind of eat whatever food you want. Is that a is that a is that an appropriate analogy even though kind of way out of the spectrum of blockchain?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Um and that that would be a uh yeah analogy that would make sense. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Cool."
  },
  {
    "speaker": "Andy",
    "content": "So Alex, when it comes to app specific sequencing are you equally convinced that that this is something that you believe can solve the lever and kind of uh this like sex sex arbitrage and this kind of differentiation between the block times of Ethereum and central exchanges or even L2s and central exchanges, or is there something else that you uh or is there any kind of uh other opinion that you may have?"
  },
  {
    "speaker": "Rob",
    "content": "Yes sure. And I'd like to start uh with a quick comment on block times. Yeah. Uh we seem to be discussing two things at once but I think it it actually gives me an opportunity to introduce the my framework of thinking about this issue really nicely. So in general how do we compete with Binance? Can price discovery ever happen on chain? Um, can we get there by reducing block times? And uh, my answer to this question in general is that well you can keep reducing block times, but Binance as a centralized sovereign. So they will always have an advantage there. It's clear that leading in price discovery is going to be a pretty long shot for decentralized systems. Because whatever you're doing in your nice decentralized system, I can also do on a server. And I can get a better result in terms of latency, I can probably process more transactions, and so on, and so forth. So there are huge savings by doing this in a centralized way. And so I don't think that, uh just doing that reducing block times, and they also should also mention another component is reducing the fixed cost of a transactions, so think about base gas. Those two things are known to reduce lever. But by doing that, can we compete with Binance? Well the answer to this is probably no, uh, centralized exchanges will still lead in price discovery. Does this mean that the whole exercise is hopeless then? Well the answer to this is no because remember that there are two sides to the income statement of LPs. You have the lever, you have the losses to arbitrageurs but then you have massive uninformed flows on chain. They're really big, and some pairs actually manage to break even, and some players actually manage to make money by relying on those uninformed flow. This is the flow that is not on Binance, it has to be on chain. So if you think about some transaction, uh, where it has to be atomic, and the part of it is a swap. Um, transactions like that happen all the time. There can be liquidations, you can be trading through multiple pairs, and so on, and so forth. So it's it's it's an area that is not super well studied, so I don't think that we understand it as much as we understand arbitrage flow now. But there are a lot of transactions that would acquire composability, and they are ready to pay to liquidity providers, to provide liquidity to them. And this is something that they cannot do on Binance. If you have an atomic transaction you cannot do a part of it on Binance. So even though you may not be able to lead in price discovery you can still make money because there are big, uninformed flows on chain. Which brings me to the point about app specific sequencing. As you could describe it very well, the idea is that if you are responsible for sequencing your own transactions then you can have for example an off-chain auction where multiple parties will bid to be the first transaction touching your pool, in a particular block. You'll pick the highest bid, and you will return this bit to LPs. For example. So ideas like that have been circulating for a while. What if you are to implement something like this, what you would have to do is that you would have to run this auction, and then you would have to ensure that a certain transaction is the first one on chain touching your pool. This in particular means that if somebody else wants to touch the pool ahead of that transaction that it will probably have to be reverted. Yeah."
  }
]