[
  {
    "speaker": "Guest 1",
    "content": "from those trading shops to be able to capture those uh uh value of the hands of LP and then put it into their own pockets. So maybe bid to to the to the block proposers um maybe validators. So that's uh that's the LVR. That's the six six arts that are being captured uh currently by those participants off the hands of LP's. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, so for the community LVR, and I think this is the agreed-upon term, loss versus rebalancing. Um in in kind of, when you go and you put your two assets into a LP, I mean, you know, a a lot of people here have been around since kind of like the DeFi summer days and and the early days of Uniswap pre-concentrated liquidity, now kind of moving into these different dex models, basically the the the the MEV that we're getting, or that that that these arbitrages are getting is those those LP's, the swaps that that are happening there and that are settling when you're LP-ing into these dexes, the the price on chain is slower to update than it is on centralized exchanges, and so that gap allows highly sophisticated actors to basically take profit from what would be LP uh either like trading fees or from rebalancing, and then they can basically ext- extract that into their own profits by doing a trade on centralized exchange. Is that kind of like how it's happening? Or maybe you could illuminate a bit more as to like exactly what these actors are doing uh that is causing the problem."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, so your description was kind of like, you know, uh roughly in line, but I I I do want to also emphasize though, that uh you know, uh uh LVR's and six six arts in general, is a one form of uh MEV that constitutes uh some chunks of the entire uh uh MEV that is being extracted. There is, however, this still like a pretty large sum of like atomic carbs that are that are out there that maybe take about like 50% each of the entire like MEV space as well. So just wanted to like keep that uh uh in mind. Um an an and in regards to like how exactly you know, those folks are uh actually extracting, and yeah, as you said Andy, like, uh there will be uh essentially uh executing trades on both legs on on the on-chain side, on the off-chain side, meaning like the the centralized exchange, like the, um, both they will be trading and um they will they will going to be picking on the the sort of like the more favorable price on off-chain and then, uh, essentially, uh incurring not so favorable price to on-chain entities like LP, so LP would have to essentially, sort of like, you know, buy or sell, uh, to those uh uh trading shops at a price that they wouldn't do otherwise. Um an and this kind of get into the discussion about uh mark-out that uh you know, Alex has uh uh talked about uh uh quite a lot previously, but um yeah, so essentially LP's are constantly uh being cheated um uh as a sort of like, uh, you know, uh uh incurring those toxic flow uh uh as well. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Perfect. Alex, could you kind of fill in any gaps here to this this LVR conversation? Um an and sort of give us your perspective on it."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, sure. So, I think on the lever side or LVR side, the thing that I'd like to mention is that, um, basically, you can describe the idea very well, right, since block time is so long, LP's end up quoting stale prices. 12-second stale prices. And so basically then arbitrageurs come, they come in, and they end up trading against that liquidity. And if you think about what LP's are doing essentially with their money, or what their contract is doing on behalf of their LP's, is that it ends up, uh, buying too rich selling too cheap all the time. And then there is a, if you mark to the current market pla- price at the time of the trade, you end up making little losses, every now and then. But these little losses, they accumulate over time. So if you look at mark-out plots, you will see that arbitrageurs make money slowly, but steadily usually. There can be some rapid increases also when there is high volatility, but it's sort of like an up-only slowly growing plot for arbitrageurs. Now, for LP's, the total income statement will look differently depending on how you calculate it. Um and, uh, LP's can still make money even with arbitrage flow alone. And this is because uh the overall position of LP's also has some delta exposure. What we call delta exposure, right? You're exposed to two assets and the exposure changes over time depending on the algorithm. And the algorithm is structured such that on certain price paths you are guaranteed to make money. Specifically when the price returns to where you started as an LP. You're still making money. But then on other price paths, you are losing money when the price deviates and doesn't come back. Uh but the nature of the game is such that arbitrageurs are always making money, so what ends up happening is that you lose money in expectation because of LVR. So LVR is sort of a running cost of doing business. And you can still magically recover that cost again on certain price paths, but on some you won't. Um but that's a cost in expectation. But then again there is also a broader perspective of things. So if there is this cost and the game appears to be a negative expected value game for LP's, why they're playing it? Well, the- there's this second big component to their income statement, which is the uninformed flow. Sometimes people want to trade against the pool not because they're arbitrageurs, but just because they want to trade for one reason or another. Um and uh uh those trades can make money for LP's even if you mark them to the current market price. So sometimes people are happy to pay a little bit to actually make the transfer, uh, to make this work. And so in an ideal world, the amount of money that you make from uninformed flow would be sufficient to offset the losses to arbitrageurs. Arbitrageurs are in a way providing a useful service to you, they're telling you where the price is. But they charge you for that, because what they're doing is that they notice that you are charging the wrong price and then they pick pick off the liquidity that is quoted at the wrong prices, but then after that, you know, where the price should be. But then there are other people who come in and just want to trade, and you can comfortably quote around the real price and make money on those trades. So, the the real question is always whether the money that you make on uninformed flow offsets the losses to arbitrageurs."
  },
  {
    "speaker": "Rob",
    "content": "Perfect."
  },
  {
    "speaker": "Andy",
    "content": "And that's how we turn this uh this expected value game from a negative to a positive for LP's. Um now, with that being said, there's still a draw, there's still a cost, and and uh kind of reverting back to Yuki's North Star of of overcoming Binance, you know, this is basically what what Binance is doing. They're drawing in there's arbitrageurs, and they're drawing uh and they're leaking the value from the on-chain liquidity games back to the the off-chain liquidity games on Binance by arbitrage. So, you know, I I think we do, and this was initially going to be a debate, but honestly, I think we have a common North Star. I think we all have a common goal to sort of overcome Binance, make on-chain liquidity and blockchain the liquidity hub for the entire global commerce. Um and and ultimately make make all of this a lot more verifiable and transparent. So, so solving lever LVR is is sort of a common problem that we all have. Now, there's a few proposed solutions for this, an I I think it's important to get into each of those. One that I haven't heard discussed, even when we were kind of leading up to this, was like you know, Binance has maybe millisecond block times, or the way that the prices change, you know, you can mark to market it every few milliseconds, you know, Ethereum's every 12 seconds. Why don't we just lower the slot times on Ethereum, right, so that the price updates quicker? Maybe that's one proposed solution. You keep, maybe you can get into some of the other proposed solutions, and and feel free to put forth what you think is the best solution that's available at the moment, and then we can kind of, you know, critique it and and sort of throw out you know, what what some alternatives might be."
  },
  {
    "speaker": "Guest 3",
    "content": "He's basically asking you to shill, uh, Sorella."
  },
  {
    "speaker": "Guest 1",
    "content": "Sure. Um and and I guess, just to also kind of like um uh put some perspective on the lower block time discussion, because I believe that was something that was quite um extensively discussed and probably still continue to discuss within the EF side as well, around the block time problem. An I I mean, my personal take on the block time, is that, um I do believe lower block time in general, is the utop-"
  }
]