[
  {
    "speaker": "Rob",
    "content": "as well as just in general like, uh, the AVS ecosystem."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, definitely. So, you know, um, we do think that there will be a very sustainable growth and very substantial demands, uh, coming from all fronts, uh, in the, uh, uh, dev space. And, uh, you know, uh, the first category is, as I mentioned, the first very major category would be, uh, you know, data driven DeFi and the intelligent DeFi. Um, and, uh, the amount of computation needed on those use cases are very actually very large. Um, you know, right now, none of that kind of intelligence and the, uh, you know, data driven insights are actually leveraged in many of the DeFi protocols, but they do have, uh, a lot of users. Many of the DeFi protocols have like, um, you know, millions of monthly active users, um, uh, you know, uh, right now. And we do believe many of them will actually be using Brevis Power features. And, uh, you know, then the competition requirements, uh, you know, on that front will be, uh, pretty huge. And, um, you know, one analogy we often want to, uh, like to draw is that, uh, uh, if you, if you treat like blockchain itself as the CPU of Web3. Now, uh, what, uh, you know, Brevis does here is essentially kind of the GPU of Web3. You know, it's a coprocessor for CPU and offload a lot of the computation that is inherently not friendly for CPU to do. And, uh, we do see there are a lot of demands on that front. And not only on DeFi, but also on infrastructure. So, you know, we do see a lot of kind of these infrastructure projects, such as, uh, DA solutions, um, that we work with, like, uh, uh, folks like, uh, uh, Zero Gravity, for example. And, uh, also, um, you know, things like block space, uh, trading solutions, uh, that is that are coming up, will also leverage, uh, uh, Brevis with a very high focusing manner. Um, so yeah, we do see a very strong demand. And, uh, you know, I think right now we are at this very interesting, uh, you know, uh, point where, uh, uh, Brevis is very much production ready. It's just like we have, uh, a lot of partners that are being, uh, uh, they are, uh, currently building features with Brevis. And we'll be launching the next few months. And, uh, you know, once we reach that point, you know, I think, um, the entire market and the entire ecosystem will start to realize the power of off-chain verifiable computing."
  },
  {
    "speaker": "Rob",
    "content": "Yep. Perfect. Yeah. Um, I think it makes makes perfect sense. You know, this, this is almost like a marketplace for verifiable computation. Uh, we have, uh, data driven applications, DeFi applications, uh, data driven, uh, infrastructure projects, uh, that are looking to pay for verifiable compute. Um, this is something like, like AI, I anticipate is going to continuously, uh, transform into verifiable compute. Um, especially as we have agents acting on our behalf. Um, I think we're gonna transition a little bit, you know, we're gonna transition, uh, certain sectors of projects like AI from more centralized, uh, cloud compute services over to verifiable compute. Um, and these applications and, and, you know, AI services and beyond are gonna have to pay for that computation. Uh, they're paying, uh, the operators, right? 'Cause, uh, the operators are either they either have a cost to submit a ZK proof, or they have a cost of capital, uh, to stake and submit an optimistic proof. Um, and so the operators here are, uh, you know, they have some cost, either cost of capital or cost of generating the proof. Um, and it's important to pay, you know, for, uh, to incentivize them to stake or generate those proofs. We talked a lot about slashing. But I guess you know, one question to to kind of take us here, home here is, you know, what what are some of the, uh, the, uh, incentives or, or ways that you intend that, you know, the this, the people who are staking, uh, in the operators that are submitting these proofs and, and proposing solutions, um, you know, what, what kind of, maybe this is too blunt, but what kind of APY could they expect? Or generally like, you know, what is the reward mechanism, uh, to incentivize, uh, operators to, uh, submit these proofs, uh, and, and incentivize stakers to stake in these operators."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. So you, you know, uh, I, I think, I think that's also a great question, like you know, basically to kind of to estimate, uh, the size of the market, uh, you know, long term. Right? So, you know, um, if, if we look at like the the current, uh, you know, one way to kind of, uh, evaluate and estimate the market size is look at the some of the yield that is currently being generated by the existing capital on these DeFi protocols, and how much we can boost that. And, uh, you know, that's kind of, uh, you know, the additional boost of the yield, and the additional boost of the revenue, will actually flow, uh, partly will definitely flow into, uh, Brevis Power protocols. Right? So, you know, just one very, very, uh, particular feature of the trading volume based fee discount, we believe that one single feature on taxes will actually, uh, be able to boost like 20 to 30% of the tax revenue, um, you know, very easily as we have seen this in many of the, uh, centralized exchanges. Right? So this is why every centralized exchange need to have that, because this is how you actually generate the, um, you know, better market structure for informed order flow and they kind of essentially harvest more fees from these informed order flows. Um, and, uh, you know, if we can boost that by 20%, 30%, then what that means, that on that particular, uh, feature, we'll be looking at like close to, uh, you know, $50 million additional revenue, um, on just the one single exchange. And, uh, yeah, if we add all of, uh, it's, uh, it's close to like $200 million annually, easily. So, you know, uh, if that will then it's kind of up to speculation in terms of how much of that revenue will be, uh, flowing into, um, the ZK co-processor, uh, or Brevis, uh, who provide that kind of services, um, then you know, we will have kind of a baseline of the, of the yield for, for the capital, uh, you know, uh, demands. But I guess, one way to kind of look at this entire, um, you know, restaking sector is that, uh, even though every single AVS right now, uh, has like large amount of ETH staked into, uh, these AVSs. But, you know, uh, when the operation, when the steady state is reached, um, you know, each of the AVS will, uh, have like, you know, it's, it's not really the the amount of capital that determines the yield. It's really the yield that determines the amount of capital, uh, you know, that is available for these AVSs. Right? So and we, we believe the same thing will happen to Brevis, uh, AVS, um, you know, when the fee is turned on, uh, initially, there will be the corresponding amount of a stake that is, uh, you know, that that their capital, the capital should feel reasonable that they should actually stake into an AVS. And this is a free market, it's not that we will, uh, enforce, enforce everyone to leave to stay in, uh, uh, in Brevis to kind of stake that, um, millions of ETH, probably in the beginning, that's not actually needed, uh, which is perfectly fine because again, uh, for AVS, uh, uh, based, uh, model, we're using the AVS as the optimistic proposer. And as the, the use case actually scale up, we will actually naturally see more and more stakers joining, uh, the pack. And in the end of day, we do see EigenLayer as a very, very good way to source low cost of capital for proof of stake system, and this is why we will continue to use EigenLayer for sure. And, uh, you know, to actually, uh, you know, enable this tradeoff playing for developer to choose between pure ZK, uh, and, uh, you know, also crypto economics plus ZK model. Uh, of course we'll also continue to offer full ZK model, which many of our developers and partners are based on today, but, uh, we are sure as the time passes, uh, as long as it's not latency sensitive use cases, they will actually look into, uh, this type of a crypto economics plus the ZK model more."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. That, that sounds great. And, uh, frankly, this is one of the earlier episodes in the series that we're we're recording, and so still kinda going through the kinks here. I think one of the things that, uh, we're gonna continue to forge ahead on is, uh, allowing, you know, founders and, and, uh, projects on, on this series, kind of pitch the users on why they should stake, uh, with this partic-, you know, each particular project. So, I think you did a great job here. Um, and thank you so much for coming on, this was a great episode."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Thank you, man. Thank you, Andy. Thank you, Robbie."
  },
  {
    "speaker": "Rob",
    "content": "It's been great. Speak to you soon."
  }
]