[
  {
    "speaker": "Rob",
    "content": "I think things are going to uh be a lot nuanced than this current two state that we have either you stake on EigenLayer's dashboard by operator delegation without too much information, right? Basically blindly trust EigenLayer uh or these operators are going to make the best decisions for you, or you go to LRTs and let them handle everything, right? I think what's going to happen is you're going to see a stratified approach where the role within the ecosystem is going to become very diverse, right? So you have potentially, uh, a vertical focused LRT, right? Um that specifically helps you to uh make decisions for a particular sector, for example DA, right? Because bear in mind not only the um assets are not created equal, the services are not created equal and the operators are not created equal, right? So we're we're we're really looking at a you know 4D chess right here for for the restakers. And uh what I think uh it's going to happen is for a very sort of trained uh or or restakers or institutions that knows what they are looking at, they're going to want tools that help them to make their individual um individual choices because that's the way to maximize their earnings, right? And for your you know average Joe's or someone doesn't want to really goes into every single aspect of it, we will see for example um you know potentially just simply helping users to diversify across an operator which is something that we currently designed um into one specific ABS because that's kind of like a very logical loop where I am the staker, I have the asset, and uh I want to stake into a service just like you use your Lido or you know uh you you stake into any other services uh we're just making it more similar, basically kind of like an app store where you can you can choose to stake in multiple services instead of one, right? Uh or you know um I know lots of uh there are lots of projects emerging to create vertical specific uh strategies and uh um you know very diligent um yield maximization strategies. So basically the point is that I don't think right now right now it's a very black and white situation where you don't have many choices but eventually what we are going to see is the prolific proliferation and specialization uh or specialization of different uh degrees of management uh within the chain of marketplace, right? Uh and uh as a consumer, as a restaker um you will have basically different flavored projects uh uh products that tailor to your your your liking."
  },
  {
    "speaker": "Andy",
    "content": "Makes total sense. I I I think uh this is part of the maturation process of the EigenLayer protocol and restaking in general. Uh this is something that we're only just starting to see come to fruition. And so it makes sense, you know we start out very uh minimal degrees of freedom really only black and white options. And uh as it matures, we'll continue to see more optionality uh for the participants to get involved. So, I I I think this was not only a great overview of how EigenLayer and restaking works today, I think it is a great uh insight and foresight to uh into what's to come uh for EigenLayer and restaking."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, absolutely."
  },
  {
    "speaker": "Andy",
    "content": "Absolutely. Yeah. I think uh you know personally I'm very bullish in terms of um the whole restaking ecosystem, or the restaking narrative because um you know obviously like I said before, we can go very low as you know restaking is just a scam and it's uh another you know leverage products for ETH, uh or or BTC, right? Uh or SOL, right? Uh any you know arbitrary assets as a matter of fact, but uh it could also mean a completely paradigm shift for uh you know decentralization for Web 3 um in the sense that uh more services can actually be bootstrapped um and uh uh be be shipped to the market. Uh whether it's an application, whether it's a middleware, whether it's infrastructure, it doesn't matter, right? And I I'm more inclined to believe that the latter will eventually prevail um if we we kind of go into towards that direction. And certainly I think for us uh we are going to help shape out uh a significant portion uh of that uh equation. And it's also not really just about EigenLayer, right? Um restaking is a coordinated system of all of these participants, right? EigenLayer uh obviously initiated it and built the initial architecture for it, but um so much work needs to be put into it, and uh I really hope to see more people kind of jump into the wagon and uh and uh uh start to see this potential."
  },
  {
    "speaker": "Andy",
    "content": "Yep. Couldn't agree more. Liam, thank you so much for coming on, and uh thank you for your presentation."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Thank you, Robbie, really enjoyed this, and hopefully we can catch up soon."
  }
]