[
  {
    "speaker": "Rob",
    "content": "Delegated operators are opted in. And operators certainly play a kind of like a a major influence in this and it kind of decides which operator quorum they want to be in at.  And finally, the type of assets that you put in to each operators.  So there is a chain effect, similar to if you know like calculus, there's like a chain rule, right? It's a very similar thing that uh that we're looking at here. Each layer affects the next layer and ultimately affects your final reward distribution. And those reward distributions can be night and day, right? If you put in the wrong assets into the wrong operator, into the wrong quorum, and ultimately into the wrong service, even though the service might be generating 100 percent, you know say a 100 percent of APY, you might still get zero percent at the end of the day, right? So this is why sort of the operator quorum although being very neglected at the current stage because of the complexity I would say, and because of the sort of the nested nature of it. is extremely important for the actual users. And uh I believe that you know, we as the ecosystem should give it more attention um a- as we sort of march further down the road in terms of where the ecosystem is going.  And uh I guess one final evidence is uh directly sort of coming down from the operator quorum and uh the APYs and the sort of the the the the um the the the dive- the diversity of the APY for each different assets, right? What we are really seeing as a generalization um of the current state of the uh restaking marketplace is that um you know, this mismatch of of this graph, just the TV- TVL, the economic security and the APY, indicates that the market is functioning very inefficiently, right? There should be a very positive correlation of your economic security and your APY that you're generating, because you know, you are rewarding um in theory, all of those TVL that are staked underneath you. And you are as a service, you should be actively managing exactly how much TVL that you have versus how much revenue that you generate for these TVL. But since we're not seeing that, the only sort of reason behind it is that we are still at the uh current moment you know, the Q4 of 2024, we're still looking at a very inefficient market where lots of um you know significant amount of hand holding um and behind-the-scenes movement and business development work occurring um that is not just being automate- automated, right? Not being handled by the so-called invisible hand of the marketplace. So there are obviously still a long way to go in the future, and uh um and I have sort of basically a few ideas in terms of where we will be going, right? Obviously the base case for restaking is uh um you know, it functions as a very simple derivatives for your sort of blue chip assets, and that can be it for restaking, right? Obviously this is the very bare case um for restaking itself. But if we want to really take restaking to where we wanted to be as the ecosystem, I think the four things um really needs to happen. um  And uh you know to- before that I think up until this point, EigenLayer has done a pretty good job in terms of nurturing and building out the uh protocols and ecosystem as a whole, right? Um and we as the ecosystem fo- focus primarily on the engineering aspects, um building out the core protocols ensuring the basic mechanisms of restaking works, and on boarding initial services to test the system, so on and so forth. um But um uh I think um we are actually standing at a very interesting phase, where uh um you know, this phase signifies the uh change from being builder centric as a restaking protocol to becoming governor centric to foster a marketplace, right? Uh and the markets governance must begin um you know um to allow those so-called invisible hands and op- um really the participants to make individual informed decisions, right? With decision making, we can slowly start to see that the marketplace functioning as intended. Uh and um aside of this sort of more broader aspect, I think the first thing that we as the ecosystem needs to focus on is starting to establish the open standard um and data coordination, right? Um  You know, data is the is the life blood of any market, right? It drives decisions, transparency, and competition, right? In the Eigen- in the case of EigenLayer, uh data becomes even more crucial, just because of the sheer um decision making factors and coordination points across these participants, operators, services, and stakers, right? Without accurate and openly accessible data, similar to you know the APY data we actually just got to see from like a a few weeks ago. Um you know nothing- nothing can really function properly, because people don't get access to the important, you know parameters that informs their decision. So the first, I think and the the most important thing that we need to establish very quickly, is actually um the data, right? The open standard, and the the implementation of the data systems. And the second thing is, really with the data, you know, know, we can then see open competition for revenue and slashing. Um up until now, for the past maybe a year, many services, you know, are technically being operated in something of like a incubated environment, right? It's protected, it's nu- nurtured, it's allowed to grow, um there are ton of resources pouring into each um basically handholding them uh to to to grow up. And uh while this is, you know, very necessary in the early stages of the restaking ecosystem, and for those projects, right? Um I do think that it's time to start embracing open competition, right? We need to foster a more dynamic and competitive ecosystem where services can compete for revenue and slashing conditions and true value is really discovered through competition, remember. Um from the very early slides that we talked about. And without it, we really won't identify the services and operators that brings the most value to the ecosystem. Um One area I think we need to be very cautious of continuing um to do, is to baby these services, right? Allowing them to, or even kind of conditions to allow them operate in a very protected environment. I think as the market matures, we really need to let the competition thrive, and this is how true innovations over- value brought you- brought forth, right? Um and the third thing, which is uh uh I guess an observation uh instead of where we're going, um is that specialization and the sophistication of different roles. Um more specifically, the tools and um assets for um strategy building for strategy um um uh vaults, right? Are- are going to emerge very soon. Um we are already seeing a lot of the emergence of more sophisticated roles within the ecosystem. Uh you know, uh particularly around strategy management, and much like how traditional markets have specialized traders, and um you know, those asset allocators, we'll see a rise in you know, potentially high frequency traders, strategy managers, and other specialized participants within restaking as well, right? um and uh I think they are extremely important, uh uh uh in the space of for this to happen, we really need to provide the right tools and infrastructures to support these roles. Right now one of the key problem with our restaking ecosystem, is that everything is diversified, and everything is chained, right? Operators are simultaneously opt into say 10, 20, or even all of the services. Because, you know, points are being given out uh by all of these services. But um it's basically similar to how in a traditional stock market, the only tool you have is ETFs instead of individual stocks, right? Um so we re- do really need to have a sort of some type of base assets for these strategies to work with, and we'll talk more about it as we go into um the specific sections where EigenExplorer is- is doing some of the initial exploration, in- in this regard.  And finally, I think it's really the composability of restaking focused finance, right? Uh if we are"
  }
]