[
  {
    "speaker": "Liam",
    "content": "You know, in in the traditional sense, we’ve been doing this quite manually through extensive business development work in the sort of previous staking um lens landscape, right? And now what we want to do is essentially replace all of these human labor with the invisible hand of the market, right?"
  },
  {
    "speaker": "Liam",
    "content": "So, we need to kind of like uh basically, to boil it down, we need to have a market that runs itself and ultimately produces the efficient frontier where uh every party are are working with each other in a very efficient manner. Um so, but first, let’s let’s actually introduce some players who are participating in the ecosystem, for for those who doesn’t know, right? Uh and first, we have the operators, which is a new concept, um if you are not familiar with restaking. Um these are the entities that run the services. You know, ensuring very smooth and efficient operation of those services. And they form a, basically, the backbone of the restaking ecosystem, providing the technical expertise and infrastructure necessary to keep services running."
  },
  {
    "speaker": "Liam",
    "content": "And stakers, we’ve already talked about the um uh the the provide, committing their assets to provide security to operations, and by extension, to the services. And uh service consumers actually, while you know, they they might not fit neatly in our chart. They are a very vital um sort of participant to the overall system. You know, these consumers generate revenue for the services over to the right corner. And uh uh which in turn, contributes to the return of the stakers who can earn. You know, without service consumers, the entire ecosystem will lack a sustainable source of value."
  },
  {
    "speaker": "Liam",
    "content": "And on top of this, the restaking space right now is actually incubating another very important role that I think people tend to generally, generalize a little bit, the strategy managers, right? Currently, all of the liquid restaking tokens, where the LRTs, or even operators are actually a very crude form of strategy managers. As we delve deeper into the inner workings of the restaking protocols, we’ll see that the complexities grow dramatically, and um the current sort of uh strategy manager landscape will change dramatically because of this. And this increasing complexity really makes the role of um sort of strategy managers very important, right? These entities will help uh stakers navigate the intricate landscape of restaking opportunities, and optimizing strategies to maximize return while managing risks, right?"
  },
  {
    "speaker": "Liam",
    "content": "As our ecosystem matures, we are likely to see you know, more and more modelers um uh and strategy managers in this emerging in this space, and uh creating sophisticated algorithms, the tools, to analyze uh and optimize the strategies. Uh very essentially, the market makers in the restaking marketplace, right? The people who bring efficient frontier to the market."
  },
  {
    "speaker": "Liam",
    "content": "And uh ultimately, right? With these participants, there are lots of complexities, right? Um but I think it’s both a challenge and an opportunity, and it opens up really a lot new a lot more new avenues for innovation, specialization, and value creation within the entire Web3 space. And uh as we move forward, you know, understanding and leverage this complexity will really be key to realizing the full potential of restaking. Uh not just you know, from a very simple narrative, a a a derivative that helps um asset holders to create more yield, but also a powerful tool that could potentially really really shape the future of our space, right?"
  },
  {
    "speaker": "Liam",
    "content": "So, hopefully, that’s kind of like a a a brief intro uh about restaking, and uh uh what I want to do now is actually breaking down some of the different incentives among the player. Right? Because, unlike traditional two-sided marketplaces, where participants’ incentives often align pretty naturally, um the restaking marketplace presents a very unique challenge where the incentives of stakers, operators, and services, even token holders, can seem very uh disparate, and sometimes, even conflicting. So, we must ensure that all participants’ incentives align, and that many incentive parameters are transparent to everyone in the ecosystem in order for the marketplace to work as a whole, right? So, if we’re for breaking things down, um stakers, they probably have the most simplest incentives. You know, um they’re basically driven by the pursuit of uh higher risk adjusted returns, right? Um they are, they aim to maximize their yield relatively to the risks they’re they’re taking, and uh so they are constantly evaluating and balance between potential rewards, and the possibility of slashing, or other penalties uh from these services. "
  },
  {
    "speaker": "Liam",
    "content": "Um and for the operators, they have a completely different set of uh priorities. First, you know, they need uh visibilities to attract stakers, a very robust security measures to protect their assets, as well as make sure the the the services are running on on top of their machine, are running smoothly. And a very smooth onboarding process to reduce the friction from both the stakers, as well as the services, right? And moreover, I think operators uh seek fair compensation for their work. Which is, right now, I would say missing in the current ecosystem. This sort of fair compensation um is really kind of generated from the uh differences in terms of the hardware, the managerial capacity, the DevOps capabilities. Right? An operator running a home PC versus a very elaborate sort of server warehouse, would definitely mean that they want they are seeking different levels of compensation, right? So, um this diversity in operator profile um kind of adds another layer of the complexity of the ecosystem, and really is the main driving force that we’re going to be talking a lot about today."
  },
  {
    "speaker": "Rob",
    "content": "Uh-huh."
  },
  {
    "speaker": "Liam",
    "content": "Which kind of refers to the operator quorum, or operator sets design."
  },
  {
    "speaker": "Liam",
    "content": "And finally, you know, the services, what they face is perhaps the most challenging"
  },
  {
    "speaker": "Liam",
    "content": "*laughs* set of incentives to balance because they are, first, grappling with the classic you know, cold start problem. Uh they need both economic security and a sufficient number of operators to function uh effec- uh effectively. Uh but attracting these resources is uh pretty difficult, you know, without an established track record. And the services must design, you know, a payout system uh to consider both their own token revenue, as well as um the revenue that they give out. Uh, you know, to properly reward uh the pretty diverse operators that we’ve we’ve already we’ve already said, right? And uh lastly, we have also the you know, the overarching need for native token utility. Uh which is vital for the entire ecosystem’s long-term viability and profitability, right? Because, right now, people are essentially trading the economic security um with the their own no name token utility, right? But without the strong token utility, services may struggle to grow, and remain sustainable. And these token economy must be carefully designed to you know, provide value to holders while also serving the restaking system’s functional needs. "
  },
  {
    "speaker": "Liam",
    "content": "So, um so previously, you know, we’ve already mentioned uh briefly, that uh all of the incentives um that we outline here are essentially coordinated um by these services, and a lot of the value of these services are actually generated by how well they coordinate the uh development with the entities of say, stakers, institutional um LPs or the operators."
  },
  {
    "speaker": "Liam",
    "content": "Right? And this is also why, sort of, it’s very expensive, and inefficient. Uh so the the restaking market is uh um it you know, the resting market is also very kind of difficult to realize uh unlike your traditional sort of online swaps because there are actually physical handoffs, right? You know, actual software needs to be ran on physical hardware, and uh tangible rewards need to be given out uh on a daily, or even hourly basis. So, it’s more like your traditional commodities market where the handoffs are still happening today, for example, if you’re exchanging oil, right? Uh so those also need to be considered when we are designing this uh marketplace."
  },
  {
    "speaker": "Liam",
    "content": "Yeah, so so so this is kind of like a brief overview of different entities and what they kind of wants. And they are all going to be boiling down to effectively uh how we’re going to design this market, coordinated market place, and how we want to make sure the marketplace uh runs smoothly, efficiently and minimizing sort of human intervention, right? Uh So, today, we probably not going to cover all of the tiny details of restaking, but uh we are going to go pretty deep with the operator quorums, or operator sets, which personally, I believe is um one of the most important, or crucial aspects of of staking."
  }
]