[
  {
    "speaker": "Rob",
    "content": "GM G Eigen. Welcome back guys. Uh today we've got Liam the founder of Eigen Explore, uh who is going to be talking about restaking in general and uh unifying this complicated ecosystem. Uh for more streamlined process. Liam, welcome to the show."
  },
  {
    "speaker": "Liam",
    "content": "Hey Robby, thank you. Uh thank you for having me."
  },
  {
    "speaker": "Liam",
    "content": "And uh yeah, today I'm going to really dive into the complexities of restaking protocols."
  },
  {
    "speaker": "Liam",
    "content": "And uh specifically focusing on Eigenlayer, obviously one of the"
  },
  {
    "speaker": "Liam",
    "content": "major player in this space and uh the entity who coined the, the name restaking, right?"
  },
  {
    "speaker": "Liam",
    "content": "And just kind of like to give you guys an overview of what we're gonna talk about. I'll walk you guys through"
  },
  {
    "speaker": "Liam",
    "content": "how your stake uh from the perspective of a staker, gets distributed internally within a restaking protocol."
  },
  {
    "speaker": "Liam",
    "content": "And uh how they're flowing through operators and services and highlight how restaking decisions are being rewarded, right?"
  },
  {
    "speaker": "Liam",
    "content": "And we'll focus specifically on a design called operator quorums or uh if you've seen Eigenlayer's latest blog, it's being sort of upgraded or rebranded into operator sets, but similar concepts, um, minute sort of uh differences in terms of how slashing are being"
  },
  {
    "speaker": "Liam",
    "content": "uh, uh"
  },
  {
    "speaker": "Liam",
    "content": "carried out, but we're not gonna focus on those areas today."
  },
  {
    "speaker": "Liam",
    "content": "And as we'll see, you know, this design, the specifically the operator quorum or sets design, not only affects all of the participants, but also influences how incentives flow through the ecosystem."
  },
  {
    "speaker": "Liam",
    "content": "And the key point that I wanna drive home is that not all restaking decisions are created equal, right?"
  },
  {
    "speaker": "Liam",
    "content": "Different assets, operators and strategies yield dramatically different outcomes."
  },
  {
    "speaker": "Liam",
    "content": "And uh, um, I'll show you guys how at the very end, I guess we, at Eigen Explorer are thinking about optimizing or simplifying the restaking infrastructure that makes it a lot more easy to use, um, and how"
  },
  {
    "speaker": "Liam",
    "content": "um, to make the entire restaking marketplace flow more efficiently."
  },
  {
    "speaker": "Liam",
    "content": "Cool, and let's get started. So"
  },
  {
    "speaker": "Liam",
    "content": "you know, restaking is really an appe"
  },
  {
    "speaker": "Liam",
    "content": "at first glance, as a staker holding quality assets like Ethereum or Bitcoin, you are already earning a base yield or market beta by taking on additional slashing risks basically, um, it particularly in a say delegated proof of stake uh, DPOS system you can earn extra rewards on top of your existing staking returns."
  },
  {
    "speaker": "Liam",
    "content": "And uh this is a really sort of um, enticing opportunity, really no-brainer, uh, honestly, especially when, you know, the service uh, at the very end"
  },
  {
    "speaker": "Liam",
    "content": "um, aligns with the Ethereum high standards, right?"
  },
  {
    "speaker": "Liam",
    "content": "So for restakers, you know, taken from the restakers' perspective,"
  },
  {
    "speaker": "Liam",
    "content": "restaking essentially offers them leverage, increasing your risk adjusted return, uh, provided that you understand the immense risks, right? And the understand understanding is, this risk understanding is very crucial, uh, as we'll, we'll explore it very shortly."
  },
  {
    "speaker": "Liam",
    "content": "And, uh, but from the other sort of perspective, if we're looking from the service perspective, this is actually where I believe restaking becomes vital to our industry, right? Um, if we're talking more broadly or or philosophically, um, uh, in this sense."
  },
  {
    "speaker": "Liam",
    "content": "You know, I recently watched uh, Lido's founder, Lewis, actually appearing in, in your show, um, the rollup."
  },
  {
    "speaker": "Liam",
    "content": "Um, you know, Lew"
  },
  {
    "speaker": "Liam",
    "content": "Lewis tal, uh discussed the evolution of services in web2."
  },
  {
    "speaker": "Liam",
    "content": "Uh"
  },
  {
    "speaker": "Liam",
    "content": "basically in a nutshell in web2 we witnessed a significant evolution in service hosting and management. We started with local hosting which was incredibly painful and inefficient. And this led to the rise of managed services like AWS and GCP, which provided virtual servers and alleviated much of the infrastructure management burden."
  },
  {
    "speaker": "Liam",
    "content": "But the industry then kind of progressed to even more specialized vertical specific managed platforms, uh, such as Vercel for frontend hosting,"
  },
  {
    "speaker": "Liam",
    "content": "you know, further simplifying development and deployment process."
  },
  {
    "speaker": "Liam",
    "content": "But there's a problem that in web3 this is hard to achieve, and really presents a unique challenge."
  },
  {
    "speaker": "Liam",
    "content": "Um, the solution for web3 isn't a single managed platform to host many services as we've already seen, you know, in Ethereum's case, I guess."
  },
  {
    "speaker": "Liam",
    "content": "Um, which this approach, which we've already seen has led to you know, a lot of the common pitfalls of a monolithic architecture."
  },
  {
    "speaker": "Liam",
    "content": "Uh, the fundamental issue is really that we can't horizontally scale our, our underlying infrastructure while maintaining decentralization in the same way, in the same way our web2 counterparts can, right? So how do we scale in web3?"
  },
  {
    "speaker": "Liam",
    "content": "Uh, the only viable path, um, that actually aligns with the channel's name very, very well is that we need to keep things very modular, right? We need to"
  },
  {
    "speaker": "Liam",
    "content": "keep things very modular, and in a philosophical sense, hyper scaling the quantity or the actual numbers of different services."
  },
  {
    "speaker": "Liam",
    "content": "And we've in fact already made significant progress on the technical aspects, right? Innovations like uh, ZK proofs, and a variety of types of roll ups um,"
  },
  {
    "speaker": "Liam",
    "content": "really makes it easy by the day to launch and scale services."
  },
  {
    "speaker": "Liam",
    "content": "But uh, other than the technical aspects, right, there's another crucial piece of the puzzle or equation that hasn't received as much attention, which is really the economic and incentive portion of the equation."
  },
  {
    "speaker": "Liam",
    "content": "Right? Until now, we've generally assumed that, you know, these services, whether it's a roll-up, whether it's app chain or whatever,"
  },
  {
    "speaker": "Liam",
    "content": "you know to follow the centralized first, and decentralized later pattern."
  },
  {
    "speaker": "Liam",
    "content": "Um, um, which is kind of hard, um, uh, for, for, for the ecosystem to grow,"
  },
  {
    "speaker": "Liam",
    "content": "right?"
  },
  {
    "speaker": "Liam",
    "content": "And uh this approach often requires, you know, these projects raising enormous amount of capital sometimes up to a few $100 million"
  },
  {
    "speaker": "Liam",
    "content": "before launching the actual product, right? And the effort involved in the cold start process,"
  },
  {
    "speaker": "Liam",
    "content": "assembling support from the operators and the stakers is, is, is immense, and this cold start problem of decentralized service really"
  },
  {
    "speaker": "Liam",
    "content": "poses a very significant barrier to innovation and growth in our space. And this is where I believe, I think from a um, uh, sort of I guess I mentioned this already, the philosophical sense where"
  },
  {
    "speaker": "Liam",
    "content": "uh, restaking can be truly transformative. You know, it's not just a tool. It's you know, obviously a tool for enhanced yield for the stakers, but"
  },
  {
    "speaker": "Liam",
    "content": "it's also a way to hyper scale the sheer quantity of services, which is very, very important, and by lowering these entry barriers and providing a ready pool of economic security uh, along with those operators, basically standing by to operate your service,"
  },
  {
    "speaker": "Liam",
    "content": "restaking could really enable a proliferation of new services and ideas, right?"
  },
  {
    "speaker": "Liam",
    "content": "And uh the beauty of this approach really lies in the numbers, right? It's much easier to generate one good service out of 10,000 competitors than just you know, 20 services in total, and by enabling simply the"
  },
  {
    "speaker": "Liam",
    "content": "sort of more services to launch and compete in our space, we create an environment where truly innovative and efficient solutions can emerge and thrive."
  },
  {
    "speaker": "Liam",
    "content": "Uh, may the fittest win, you know, if we're quoting Darwin."
  },
  {
    "speaker": "Liam",
    "content": "So"
  },
  {
    "speaker": "Liam",
    "content": "this restaking model could fundamentally change how we approach the creation and scaling of decentra decentralized services."
  },
  {
    "speaker": "Liam",
    "content": "Right? It democratizes the process,"
  },
  {
    "speaker": "Liam",
    "content": "um, allowing for more experimentation and innovation, and creates a natural selection mechanism where the most valuable and efficient services will attract more stake and flourish."
  },
  {
    "speaker": "Liam",
    "content": "So, how are we going to design this thing, right? Obviously from the previous slide, we are only seeing the very simple two-part exchange over here."
  },
  {
    "speaker": "Liam",
    "content": "Um, and in order to really fully realize what we wanna do,"
  },
  {
    "speaker": "Liam",
    "content": "um, or, or what we want to achieve here as an ecosystem, or to unlock the full potential of restaking, right,"
  },
  {
    "speaker": "Liam",
    "content": "connecting the stakers with valuable assets and funneling them to bootstrap services."
  },
  {
    "speaker": "Liam",
    "content": "What we really need to do is to design a well coordinated marketplace. I think if you guys have heard about three arrow talking about this coordination um,"
  },
  {
    "speaker": "Liam",
    "content": "is something he mentioned very often."
  },
  {
    "speaker": "Liam",
    "content": "But traditionally, you know we've been doing this um uh,"
  }
]