[
  {
    "speaker": "Guest",
    "content": "Restaking has been branded as many things, right? It is a derivative in itself, it is a launchpad for these services, and it is as we talk a lot about today is a marketplace, right? for decentralized services, right? And I, I really do think that if we are taking from a markets perspective, if we are taking from a decentralized marketplace uh perspective, you know, it is crucial um, for us as an ecosystem or as a community to start building uh, composability, right? uh or to building on top of the restaking protocols. Uh, and this is the only way that we can foster foster a positive change and the, the more efficient uh, market exchange uh within the ecosystem. The more sort of EigenFi or, or restakingFi uh, uh, projects there is, the more liquidity that comes into the system, and the more sort of uh, utility that goes all around, right? uh, through the participants."
  },
  {
    "speaker": "Guest",
    "content": "So, up until now I think we've basically covered uh, the, the, the, the broad aspect of restaking, and the tiny details of restaking, right? And, uh, now I want to talk a little bit, about, uh, what we are doing, and, uh, here at EigenExplorer, right? Um, so basically for us we're, we're, we're focused on two important aspects: the first is the data, and the second is the composability of the ecosystem. So we are currently the largest restaking focused data provider for ABS operators and stakers, and we serve thousands of different parties accessing restaking participants data, from tracking, you know, when our particular whale staker delegated to an operator to, you know, monitoring the specific operator quorums and sets and their individual reward distributions. Oftentimes people ask, um, you know, why do you guys care about data so much? Because, we really do think for a system like restaking data is the cornerstone, or the foundation of everything else, right? And, uh, um, you know, it's, it's absolutely essential in terms of, um, the, the, the, exchange of so many different participants in our system. And if you are familiar with, uh, say ancient Rome or Greek history, it's pretty comparable to how, you know, governments establish standards for silk or other commodities and even money in the first place. Um, then to see the boom of the market, um, um, and eventually the, the, the prosperity of the nation, right? Uh, and in our language data is basically uh the equivalent of the standard that we have in the very, very past. And the second portion of our product is um essentially a DeFi component designed for restakers, uh, aiming to improve market usability, um, and the exchange while fostering economic uh, ecosystem composability, right? We really do believe that you know choosing an operator although it's the correct sequence in the market exchange loop uh is challenging for consumers, right? And uh, just from the sheer number of decisions that you need to make, um, in, in the ecosystem we believe that, um, we want to start with just the, sort of the most basic needs from the staker since it's the easiest to solve. Um, and uh as mentioned earlier restakers primarily want to earn yield. Uh, they do so by understanding the services in which they want to share risks, right? Um, so we've designed a system uh called direct liquid restaking, where users can directly stake all of their stake assets into one ABS and sharing only that ABS's risks and rewards. And we achieve this through a step that diversifies across operators, uh, uh, and uh uh, with a mechanism that we called service contribution threshold, right? Which measures how user stakes are being utilized or put at risk for a given ABS. Um, and because of this constrained risk and reward exposure, other protocols can actually build on top of this to create more elaborate strategies so that protocols have a, uh, you know, a stock-like asset to work with instead of um every single strategy making decisions, uh, needs to source through all of the operator quorums, source through all of the um staking distribution basically automate that, and diversify cross operator to completely mitigate those risks from the, uh operator's perspective."
  },
  {
    "speaker": "Guest",
    "content": "And, uh, so to, don't want to bore everyone with, uh, just going over the list but, really with this sort of, um, the, the direct liquid restaking design we want to achieve is that, users as a staker, uh, or institutional staker, they get, you know, direct exposure to an ABS. Whether it's connection with that ABS uh, being a part of the community or in the sense of risk and reward, right? um And we do that with a much improved user experience by basically decreasing the number of decision-making, uh, you need to do. And second of all, um, this design really allows for a more elaborate asset management schemes to be built on top of EigenLayer or the other restaking projects. Um, basically, you know, strategy custodians and other EigenFi projects get a base asset to work with alongside with the isolated and accurate risk and reward profile. um Yeah, and that's what we are currently working on. We are super excited to see these acts, aspects slowly but surely I guess, bring out to the daylight. And, uh, uh, seeing the entire, sort of, market, uh, wheels slowly to start cranking. And, uh, personally I think we are, we are very close um, to that day. And uh, yeah. So that's pretty much it about today's, uh, presentation I guess. And for anyone interested, this is our, um, website, and feel free to check it out."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. Liam, I mean that was a, that was a fantastic overview of restaking, um, and, and a deep dive into the EigenLayer, uh, mechanism as well. The market participants when it comes to stakers, operators and services, um, and the incentives that play for each of those. Uh, I do have a couple questions, but, um, I mean that, that was a, that was an awesome presentation. So I think, uh, uh, questions are probably pretty, pretty quick here. I want to jump back, uh, uh, and basically share with you one thing that, that I learned today that I'm not sure, uh, is common knowledge amongst the people in the industry, which is, uh, is, is this cou- these couple of slides here. So this slide, Yep, this one and, uh, and basically that we have um yeah, so rewards are not created equal. Like this idea that, uh, I could be staking into a, an AVS, uh, but because the asset that I stake is a little bit different, or a different form of, of ETH or Eigen or different token, different asset. It doesn't receive the same sort of rewards from the protoc- from the, from the AVS. And so I think this, Right."
  },
  {
    "speaker": "Guest",
    "content": "Right."
  },
  {
    "speaker": "Rob",
    "content": "this shows that there is an extra degree of choice, or, or, uh, a decision that has to be made by the stakers. So this, this choice coupled with all of the other choices that, that are at play like you mentioned, the operators, the operator quorums, you know, most of the stakers right now are just delegating to the liquid restaking token. They have, Right. maybe just some, uh, uh, some ETH, uh, you know, they get easy ETH, they get swell ETH. They kind of, uh, stake their ETH into these liquids, liquid restaking tokens. And then all of those decisions are made on behalf of the staker by the LRT Dow. um They are allocating amongst the AVSs, amongst the different assets, um, amongst the operators, and, and into the AVSs. And so I'm curious about, do you think that there is a paradigm shift here where right now in its current state stakers because, you know, there isn't a lot of information available, stakers are currently just taking kind of the more convenient path and staking their ETH in these LRTs. Do you think as more data becomes available, and you guys are starting to help proliferate, you know, more information about the EigenLayer ecosystem so that it's publicly available, do you think stakers will take more of that information to make, make their own decisions about, which AVS, which asset, which operators they stake into and they'll make more of those decisions themselves, rather than delegating all of their ETH to an LRT Dow and, and, entrusting the LRT with making the decision, uh, for them?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah. um Robby that's a, excellent question. I think, you know, pe-"
  }
]