[
  {
    "speaker": "Rob",
    "content": "Welcome to the Rollup. We are here with another episode as part of our EigenLayer series. Today, we welcome Ellie from Espresso to talk about Espresso's sequencing marketplace and fast finality. Welcome, Ellie."
  },
  {
    "speaker": "Ellie",
    "content": "Yeah, thanks for having me. Um, all right, I'll dive right into it. So I'm Ellie, I am a researcher and engineer at Espresso. And yeah, today I'm going to describe our sequencing marketplace and fast finality layer. Why we even need those in the first place. Um, and then how they use EigenLayer to make them even better."
  },
  {
    "speaker": "Ellie",
    "content": "So, first off, why do we need this sequencing marketplace and fast finality layer? That's the obvious question. Well, the reason is composability. This is a really hot word all the time on Crypto Twitter, but you know, it's this is what we want."
  },
  {
    "speaker": "Ellie",
    "content": "And what do we mean by composability? We mean that applications on different chains can coordinate as if they were on one chain. So if we look at today, uh, we don't really have this. So let's take a couple of examples. Um, so each roll, a lot of the rollups that exist, they each have their own decks deployed to each rollup. Each of these decks has its own liquidity, and it's not very seamless to transfer this liquidity between all of these different chains, and it's not very efficient to have this liquidity in all of these different places."
  },
  {
    "speaker": "Ellie",
    "content": "Um, and then secondly, I think that another example is app chains. So I think app chains will be really awesome in the future and I can see them growing. But app chains, because they're focused on one specific application, they may never get a whole lot of liquidity or um, or a whole lot of, you know, it's very difficult for an app chain to like maintain the composability it has on L1 on their own L2. But there's a lot of benefits to creating an app chain, like they get customized sequencing, they can capture a lot more fees. Uh, so how do we solve this? Well, if we can make all of these rollups composable together, uh, then we can solve this and app chains can become a lot more powerful."
  },
  {
    "speaker": "Ellie",
    "content": "And then, of course, you know we have a lot of words that get thrown around. Uh, cross-chain interoperability, atomicity, synchronous composability. They're all they're all related, uh, they all mean sort of different things, but really the goal of each one of these is composability."
  },
  {
    "speaker": "Ellie",
    "content": "So now, uh, the obvious question is, \"Okay, well, how do we get to composability?\" Uh, the answer is that it's actually a lot trickier trickier than it seems. Um, and this why this is why we see a lot of projects working on it including Espresso. Um, it's very tricky to do it in a way that, uh, is seamless but also incentive compatible to all of the participants."
  },
  {
    "speaker": "Ellie",
    "content": "Um, but I'll explain how Espresso is going about this. So, uh, back to the question how do we get composability? Well, we're building a sequencing marketplace and a fast finality layer. That's how Espresso believes we can get composability."
  },
  {
    "speaker": "Ellie",
    "content": "And then where EigenLayer comes in is EigenLayer serves as this foundational infrastructure in which uh, both of these things can be built on, and we can get a lot of really cool benefits from that which I'll go into later."
  },
  {
    "speaker": "Ellie",
    "content": "All right. So I'll go into the marketplace, and then later I'll go into the finality layer. So the marketplace, it's fundamentally just about coordination. That's all it is."
  },
  {
    "speaker": "Ellie",
    "content": "So if you recall our definition of composability, we're just trying to coordinate as if we're on one chain. And this means that we need a way for different chains to coordinate their sequencing if you want to have composability between two different um, chains, they need to be, where it's best that they're sequenced together. And if we make an analogy to L1 in Ethereum, um, this is true. Apps that are deployed on Ethereum are sequenced together. They're sequenced in the same Ethereum block by the same party. And so really, to get composability among all of these different chains, we need to have something very similar to that."
  },
  {
    "speaker": "Ellie",
    "content": "Uh, but there's the issue that we have sovereignty. So this is a really popular reason for app chains is that applications don't want to give up their fees to L1 proposers or L1 builders. Um, app chains also want to be able to customize a lot of things. Like they want to customize their sequencing rules, uh, they want to customize their VMs, all of these different things which makes an app chain great. So we want to enable this coordination without forcing rollups to give up their sovereignty. And so this is where the marketplace comes in."
  },
  {
    "speaker": "Ellie",
    "content": "So I'm going to go through how the marketplace works at a high level. So we have these rollups: A, B, C, and D on the left side."
  },
  {
    "speaker": "Ellie",
    "content": "And they are going to sell their sequencing rights to the Espresso marketplace. The Espresso marketplace runs an auction. That's essentially just what it is. And so each rollup will decide to sell their sequencing rights. And then on the right here we have several different sequencers."
  },
  {
    "speaker": "Ellie",
    "content": "And these are parties, well, they're in charge of sequencing transactions, but oftentimes we can think of them as builders. They're very similar, and oftentimes they in fact are the same party. Um, so these sequencers or builders will bid in the auction to get sequencing rights for all of these different rollups."
  },
  {
    "speaker": "Ellie",
    "content": "And the key part here is that the sequencers can bid for multiple rollups at the same time. And so for example, this in this case, you know one sequencer, they bid for rollups A and B because they think that uh, you know, they can get a lot of benefit from seek from sequencing those together. Maybe there's a lot of interopera or cross-chain messaging between those two. Um, and then the other sequencer they bid for C and D."
  },
  {
    "speaker": "Ellie",
    "content": "So this is just one example, but in, uh, in this case, the auction, or the Espresso marketplace, it will find the most optimal solution to, um, to designate the sequencing the sequencing rights. So the auction will run a combinatorial auction. It'll consider all of the different possible combinations that people have bid on, and it'll choose the one that maximizes the revenue across all of the rollups. And so this is really great."
  },
  {
    "speaker": "Ellie",
    "content": "Um, and then how this works is yeah, step one, rollups sell their sequencing rights to the auction. Sequencers bid in the auction to earn the sequencing rights, and then the auction computes this maximum revenue across rollups. This is, you know, what the marketplace is fundamentally."
  },
  {
    "speaker": "Ellie",
    "content": "Um, so do we have composability like we want? Well, yes. I'd argue, yes, because the sequencers, since they can earn sequencing rights for multiple rollups at once, they can sequence those rollups together and they can, um, and then they can ensure that we have this really seamless composability between the rollups that they sequence together. So, yes, this is great."
  },
  {
    "speaker": "Ellie",
    "content": "Uh, but do we have sovereignty? Well, maybe not yet. So a clear issue with what I initially described is that, um, you know, the sequencers are kind of collecting all of the sequencing fees, right? They're deciding the order. They're going to generate MEV potentially, they are going to earn transaction fees. Um, like this isn't good for the rollups at all. Uh, and rollups don't want to, you know, lose their sequencing fees. So we're going to add an extra layer, and this extra layer says that the proceeds from the auction that the Espresso marketplace runs actually get redistributed, um, back to the rollups based on how the proportion of how much they contributed, uh, into in the marketplace. So for example, uh, let's say one rollup they or let's say the total, you know, value of all of the bids in the marketplace was 40 dollars and each rollup contributed equally, well then each rollup would be refunded 10 dollars. So in this way, rollups really do not have to lose their revenue,"
  },
  {
    "speaker": "Ellie",
    "content": "and you can actually design it such that rollups are always better off by participating in the marketplace rather than not. And so, well, okay, do we have sovereignty yet? Well, still no. And I'm going to introduce another thing which is uh, a reserve price or a floor price. So we can end up in a scenario where a rollup is selling their sequencing rights, but maybe the people bidding on it aren't willing to pay what the what the rollup thinks is a fair price. And the rollup says, \"Hey, I can make that much money just sequencing for myself. So I'll just sequence for myself.\" So this is where these floor prices prices come in."
  },
  {
    "speaker": "Ellie",
    "content": "And these floor prices can be designated by each rollup and they can be changed over time, and in order to earn sequencing rights, the builders must bid at or above this floor price. And if there's no bid that clears this floor price, then the rollup gets to sequence for themselves and then they again get to keep all of their sequencing fees like they normally would. So this is really neat because uh, rollups can be always better off in the"
  }
]