[
  {
    "speaker": "Andy",
    "content": "that these slashes are safe. Um and yeah, so then so that's pretty much the overview of the espresso marketplace and the espresso finality layer. Um, they work together in tandem. Um, that's the end of my presentation. And so I guess in summary just to conclude, uh the marketplace is mainly about coordination. It allows roll-ups to coordinate their sequencers together so that users can have uh transaction sequenced across many roll-ups at the same time. And this gives us a lot of great things. It helps app chains, it helps liquidity, all of these great things. And then also espresso has this finality layer um which can serve as a very strong pre-confirmation before roll-up settle on ethereum. Um, yeah, with that, that's all I have."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. Yeah, you you were on a roll, so I I sort of say my questions to the end. Um, but overall that was that was phenomenal. Um, you kind of addressed quite a few things uh that that you know we'll we'll dig into a little bit deeper, but starting with some of the eigenlayer uh things, you you know you hit on slashing. I think one criticism of eigenlayer in general has been this idea that everyone has to design their own slashing conditions and slashing contracts. But in in fact that's not the case, you can reuse a lot of these modules. Um, maybe there is some sort of attributable fault smart contract where you have double signing and equivocation in there, and then that's somewhat generalizable to a set of the AVSs, and we can reuse some of those contracts to to you know get some more shared infrastructure. Um, so you hit on slashing rules um and and those are pretty much the two key reasons that operators could be slashed. But the other side of that is uh is the APY for for stakers to stake uh into Espresso's AVS. And so because operators are taking on some risk uh in providing the capital that could be slashed, you know they there's kind of the uh the reflective reward uh or APY that you know you're paying for the economic security. So kind of, you know talk us through how how operators are uh being incentivized and how stakers are being incentivized essentially from and then that demand will go and and uh pay the APY for stakers."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Exactly. Uh, yeah. So the espresso network um is a data availability layer and a sequencing layer. So the the way that validators in the espresso network can earn fees is basically uh to sequence data in espresso, you need to pay a small sequencing fee. This is very similar to a lot of other data availability protocols. And you're paying this fee to ensure that your data remains available for a very long period of time, and um and then so yeah, you're paying that, and then also we have the auction which is generating revenue as well. So the main yeah, the main way that validators would earn APY by restaking in espresso is through these sequencing fees that uh are paid to the network to hold their data and sequence it and keep it around forever."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. Okay, that that makes a lot of sense. Um, so okay, great. So um so yeah, so stakers are incentivized uh to stake into these validators that are uh kind of like running the the nodes for Espresso uh it's uh uh these operators and stakers are earning these APYs because the the sequencers are paying a fee uh in order to sequence the transactions, right? And so they're paying uh a fee to the Espresso protocol, and then they're also buying the rights from the roll-ups to sequence their transactions. Um, and so I'm going to skip back here to uh some of the sequencing slides and talk a little bit about incentive compatibility because I think that is a a key thing here when it comes to um, I think maybe it's the next slide. So, okay, so we have um kind of just to illuminate like all of the uh economic actors and incentives that stake here. We have roll-ups, uh they have order flow, they have transactions, and uh they could sequence the transactions themselves.  Mhm. But they wouldn't, they wouldn't have composability between them. Yes. And so maybe there's we're missing out on atomicity, and some some order flow that would be uh extra excited about composability is kind of getting snubbed. Yeah. And then we have sequencers that uh in the Espresso marketplace could could provide uh cross-chain synchronicity uh through sequencing transactions. Mhm. And then we have Espresso the protocol which kind of takes uh like, you know, has to validate consensus, and so it takes this uh protocol fee, and that's ultimately how validators earn uh APYs for coordinating uh this this protocol. And so these these sequencers are going to bid uh at least the reserve price to these roll-ups. Uh if it doesn't meet the reserve price, the roll-ups will just kind of they'll just kind of sequence on their own. But let's say it does meet the the reserve price and they're they're uh sequencing for, you know, at least two or more of these of these roll-ups. Um then we have to choose the the combination that maximizes revenue across the roll-ups. And I think this has been like the most contentious part because how do you pro how do you choose the the combination, you know, that adds the most the maximum revenue to roll-ups? What if, you know, one combination provides uh twenty uh uh, you know, revenue points to roll-up A, but there's another one that provides twenty to roll-up B, right? How do you how do you And and let's say roll-up C, you know, gets five in the first case and ten in the second place. So either way, you know, they're not as much. But how do you chu how do you choose if you, you know, is there a tiebreaker mechanism, or ultimately like do you have to do you have to choose preference of one up roll-up or the other? How are some of these decisions made?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, so this is a really good question. So the uh marketplace compu computes the maximum revenue across all of the roll-ups, so it doesn't ensure that every single roll-up is maybe getting the maximum bid that someone bid for it. Um, it is possible that let's say someone bid for roll-up D and they were willing to pay ten dollars, but someone bids for roll-up A, B and C, and they're willing to pay fifty dollars. That may not result necessarily in roll-up D getting more than ten dollars. Um or or it very it could actually, in a lot of cases it will, but it's not uh uh guaranteed. So this is how that works. And and when we're uh when the auction is deciding these uh different combinations of roll-ups, so it takes a lot of things into you consideration. Um, so I I actually didn't touch on this, but this is a very interesting extension we can add to our marketplace is, instead of just selling sequencing rights, you can think of the roll-ups as uh providing intents, you know. I'm I'm hesitant to throw another buzzword in here. But roll-ups can kind of state their intents. They could say, okay, I need to match this reserve price, and they can also state the intent of like, I really want to also be synchronized um, and uh sequenced with Arbitrum, let's say, because that's really important for my roll-up. So they can they can specify these intents, and with that the auction will kind of come up with a uh the best case scenario that gives the entire protocol the most revenue. And the way that the revenue is split between protocols um, is based on reserve prices. So each um, each roll-up has a reserve price, and this price is like what they think their sequencing is worth by itself. And so uh when you're redistributing the revenue to all of the roll-ups, you take up all of these reserve prices, and you add them up, and then you calculate the percentage of each one. And then you take the revenue that's earned from the auction, and you divide up that percentage based on um you know, how much each roll-up was worth. Um, and so that's how we you kind of decide how much each roll-up is contributing into the auction. Um, because you could have the case, let's say that you have you have a roll-up that's really popular, and sequencers will bid a really, really high price to sequence for them. And then you have another roll-up that's maybe not so popular, and builders are not going to you know, bid as high just to sequence for them alone, but they'll bid a really high value if they can sequence for them and this really major roll-up. Um, and in this case it makes sense that most of the revenue should go towards the really popular roll-up that's really driving the high price of that bid. Um, so this is how we uh this is how we allocate the revenue to each roll-up, kind of based on how much they uh how much value they're adding into the network."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. Okay, yeah that that clarifies things quite a bit. So it's not about the revenue each roll-up gets, it's the the total aggregate revenue uh that A, B, C and D could could create together. Um, sequencers are going to bid on that total value, um, and then they're going to they're going to we're going to choose the the bid uh that has the total aggregate, the maximum total aggregate value. Yes. Um, okay. And then you you put out intents. I'll I think that's great because there is like a declarative nature to this. You can say, you know, you can define your outcomes and then you have a competition to to try to fulfill those outcomes the best the best way possible. You know, like you said, we have the reserve price, and, you know, roll-ups can opt in or opt out, I imagine at each block, right? Like each Yeah, each block they can opt in and out. And so you know I imagine like"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, per roll-up block."
  }
]