[
  {
    "speaker": "Rob",
    "content": "Um, and we’ll just, you know, coordinate the messages between the blocks."
  },
  {
    "speaker": "Andy",
    "content": "Got it. Okay. And so from the conversations you’re having, kind of the main opposition to rollups opting into this, uh, is, is, uh, uh, when it doesn’t make sense and you opt out, and you have kind of like a rever- a, a, a set of transactions that revert because, uh, you know, they, they don’t really fit within, within this framework, um, but we’re kind of adding the coordinator role to address that. Um, it, I’m al- I, I mean I’m just, I think, I think all of us have a really common goal of like achieving synchronicity. This is something that I, I continue to hear over and over again. It’s like, this is what we want even from the DeFi OGs like, this has been a very main value proposition of, of commerce on-chain. Like far and beyond, you know, i- it’s always been sort of this like, the composability of, of cryptocurrencies with one another and smart contracts, but then you know we got so fragmented, um, and now it’s like, this is the main core value principle of, of on-chain versus something like a Binance. You know they can’t, they can alway-, they can prob-, Binance can probably be faster and cheaper because they don’t do things in a decentralized environment, but they don’t have the composability that you can get on-chain. And so, to solve this, um, I, I think it is kind of like this greater good thing that a lot of us have as a common goal, um, a lot of users want to see it, a lot of rollups want to see it, and sequencers can make more money too. And so, you know, getting to the point where it is a no-brainer and rollups are, you know basically just ready to opt in, um, I think this is a point where a lot of us are, it still feels kind of idealistic but, um, this is where, this is where I think a lot of us want to get to."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Ellie",
    "content": "Yeah, 100%. And to comment on that so, Espresso is, it’s not the entirety of the solution. So there’s other projects that also are going to help this. Uh, for example wallets. When you have a cross-chain message, the user can’t actually be generating both of these messages together. The wallet needs to know how to generate messages that send messages to another chain, etcetera. So like, we need wallets on board, you need um, other projects such as like, Agg layer that are doing this proof uh, level. Uh, so Espresso is only one piece of the puzzle. Um, but yeah I also will say, uh, mainnet for Espresso is coming soon. So hopefully this can be a reality very soon."
  },
  {
    "speaker": "Andy",
    "content": "Cool. Awesome. And will you have, uh, lau- launch partners? Um, rollups ready to go live on day one?"
  },
  {
    "speaker": "Ellie",
    "content": "Um, sorry, I’m not sure if you can hear my dog barking in the background."
  },
  {
    "speaker": "Andy",
    "content": "I can but he, it’-, it’s all good."
  },
  {
    "speaker": "Ellie",
    "content": "Um, uh, yeah, so, um, our initial launch will be just the infrastructure, and rollups could, any rollup can decide to use it if they want. And then really shortly after the launch we will have partner rollups that will launch, um, you know, be launch partners, and are officially using our chain."
  },
  {
    "speaker": "Andy",
    "content": "Mm-hmm. Awesome. Because I, I really see the network effects here, um, they’re kind of, they’re kind of in plain sight like, once you get rollups A and B, you know rollup, if rollup C wants to be composable with A or B then they’re going to have to join. And so i- it, seems like, um, you know, i- it’s going to be slowly and then, and then all o-, all at once, uh, as, as rollups sort of launch and, and uh, uh, and, and are incentivized to participate in this ecosystem for composability and for their users. Um, you know, I guess kind of as we wrap up here there’s, because this idea again has been around for quite a while. And so, um, it’s cool to very, you know, to see it come to fruition hopefully here very soon. Um, but you guys aren’t the only ones in this arena that, that are trying, you know to build this solution. And so, you know, right now we have, we have a lot of, uh, sequencers that are building, uh, kind of interoperability amongst rollups in their own cluster. Um, and then we have, and then we have rollups that are you know, looking, and sequencers that are looking to coordinate amongst different clusters. Will we see, you know, like kind of like a, a layer on top, if you will. Like, we have the rollups, and we’re going to sequence the rollups in a sequencer marketplace. But then is there going to be half-, are we going to need a marketplace to sequence the sequencer marketplaces?"
  },
  {
    "speaker": "Ellie",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Ellie",
    "content": "Uh, yeah, this is yeah a good question. Um, I think in reality, no. Because I, I think that a lot of the projects that are working on things related to shared sequencing, um, they’re actually not direct competitors. They’re actually different components of the ecosystem that can, you know, plug in together. Um, you know so for example, Espresso offers DA for example, but rollups can always choose to use their own DA layer as well, and that’s perfectly fine. Um, you know rollups may, rollups may opt in to using kind of one of these clusters, but, uh, that doesn’t act-, actually that doesn’t mean that they can’t also use Espresso as well every once in a while to gain interoperability with things outside of that cluster. So, I don’t really view them as like competing. And because of that I don’t think we’ll end up with like, yet another third layer. Um, I think actually we’ll just have all of these modular components finally come together."
  },
  {
    "speaker": "Andy",
    "content": "Ah, that is the dream. Yeah, I, and I, I think so too. Like, off, again it doesn’t, when it c-, when it reaches this point, i- it’s a no-brainer, and there is no incentive not to participate. And so even if you’re you know, you’re participating, but you end up opting out for 99% of blocks, you’re still participating. Like, as long as you’re in the ecosystem, and you’re aware of when it does make sense to participate, I, I, I foresee that, you know, especially early on when their, maybe isn’t as, you know the shelling point of rollups where it makes sense to compose all the time. Um, you know that, that’s where I think, uh, a lot of rollups where it’s like, there’s no harm, there’s, there’s no incentive not to participate. Like, not-,"
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Ellie",
    "content": "No, exactly, there really isn’t."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. And then, and then you can see how it goes. Um, you’ll make as much or more. And then, you know that, that, I think will, will help to, uh, kind of get off the cold start. And then, and then once it gets going it really seems like it’ll get going. And I’m personally super excited for all of these applications that, um, are not possible right now, but are possible when we have the levels of scale and composability that we get from fast finality, and uh, uh, c-, uh, composability amongst these rollups."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Ellie",
    "content": "Uh, yeah I 100% agree. And I think, I’m most looking forward to appchains specifically. I think that like, composability is the key thing that appchains really need, and it’s a kind of the key difficulty right now why it’s very difficult to make an app chain. Uh, but when we have composability, app chains can be very common. And I think that that’s awesome because apps, like instead of having your app deployed on yet another rollup, which is essentially a chain, your app is your chain and you have full customization over it. Uh, so that’s what I’m partic-, particularly looking forward to."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Awesome. Um, tha-, it-, it’s always a pleasure. Yeah, I mean this was great. Um, always learn a lot and i-, it’s really cool to see how Espresso has evolved since our last series that we did in Modular March. So, thanks for coming on again."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Ellie",
    "content": "Yeah, I know. It was great, thanks for having me."
  }
]