[
  {
    "speaker": "Rob",
    "content": "A lot of times, these roll-ups are going to set really high reserve prices because a lot of times they can make quite a few, quite a bit of revenue on their own. You know, recently we we did a podcast and kind of dove into some of the numbers with Justin Drake and in fact, Base is making like 800 they're making like $200 million uh uh uh a month, I think and uh uh 80% of that is from MEV. And so and CEX DEX arbitrage and leverage so that is going to lead to quite a high reserve price. "
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And so oftentimes, you know, they might set a super high reserve price bidders may you know, they may not meet that or uh you know, let's say Base is roll-up B in this case and roll-up B doesn't get uh you know, let's say roll-up B could stand to make, you know, a million bucks on its own and the total aggregate is maybe 5 million but roll-up B is only going to get 10% not 20% Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And so they would opt out, right, for that block um but they can opt in and out on each block and so uh "
  },
  {
    "speaker": "Rob",
    "content": "I I imagine that a lot of times roll-ups are going to set quite a high reserve price, they may not they may not participate in the auction every single block. But even, you know, for the for the off-chance that they do get some sort of composability benefit, it makes sense to at least at least kind of have a visibility into what it could be uh if if they were to participate and take that you know, on a on a per-block basis."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Um and so I think the the declarative nature makes a lot of sense."
  },
  {
    "speaker": "Andy",
    "content": "Mm-hmm."
  },
  {
    "speaker": "Andy",
    "content": "And yeah I guess this uh  And now I was going to throw out another another buzzword actually."
  },
  {
    "speaker": "Rob",
    "content": "Oh, yeah. Please, please, please."
  },
  {
    "speaker": "Andy",
    "content": "Um yes, so just a quick response is that uh when the auction is calculating the uh this max this combination that maximizes revenue it it will calculate to make sure that each roll-up at least gets its reserve price back. So even if a roll-up is only contributing 10% to the total value, so long as that 10% is greater than the reserve price, they will still be sequenced. Um but yes, like you were saying, roll-ups can opt in and out of this marketplace very regularly and um on a block per-block basis. And I imagine that some roll-ups will do that. I think it depends on um for example, app chains. Not all app chains may need composability all of the time and it may make sense for them to opt into this say, once every 10 blocks, depending on what that application is. Um maybe it's like a gaming chain that doesn't really, you know, need a lot of composability with other chains. So that makes a lot of sense. And then you may have DEX app chains who would probably opt into this all of the time because they get access to this shared liquidity from other roll-ups. So uh yes, what you describe is something I could I think will will happen."
  },
  {
    "speaker": "Rob",
    "content": "I I mean this is a long a long time that you know shared sequencer sequencer marketplaces like composability has been discussed. "
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And to me you know this, in theory, this has always been possible. Like you know, I only want to participate if it's going to make me more money, otherwise I'll do it on my own. Yeah.  It's a pretty simple uh principle. And so now we have the mechanism to complete that. Like what are the what are the the downsides or the criticisms that you you guys are hearing because to me, like if I'm a roll-up operator, it's a no-brainer. I can either make the same amount of money or I can make more or like why wouldn't I do this? What are some of the the cons criticisms that you guys are hearing? "
  },
  {
    "speaker": "Andy",
    "content": "Yeah, so um this is um a problem that we've been working on internally at Espresso a lot and kind of the obvious question when I describe this is like, well, what if you have a cross-chain transaction between roll-ups B and C? Those are not sequenced together and now maybe you know you have to go back to using the old bridging approaches etcetera. Like that's actually not good because you're not guaranteed that your that a single user's combination of roll-ups will be sequenced in the marketplace together. Um so yeah this is a we've been actually focusing a lot on this problem internally at Espresso and uh I think in a few weeks, we should actually have something that will publish um we'll publish publicly but the synopsis of it is that the goal of coordinating between roll-ups can actually be separate from the sequencing of roll-ups. And this is it's very, very nuanced, but roll-ups can potentially sequence for themselves or they can sell their sequencing rights to whatever sequencer but then you can have this uh kind of coordinator come in and they the coordinator just makes sure that each roll-up is aware of each other, um but it doesn't sequence transactions. It's not taking transaction fees, etcetera, and because the coordinator can come in and do this, they can do this between roll-ups that maybe don't always get sequenced together and and uh so the the benefits of this are that users can get cross-chain interoperability no matter which roll-ups they're going from. Uh but you still the marketplace still provides an advantage because if you have a shared sequencer the shared sequencer can guarantee you things like execution. The shared, shared sequencer can guarantee uh what price you're going to execute at, give you pre-confirmations, etcetera. The coordinator cannot do this. Uh the coordinator may coordinate between two roll-ups and find out that all of the cross-chain transactions fail, for example. That could happen, but if they were being sequenced by the same actual sequencer, you wouldn't have all of those failed transactions. Um but yeah, so this is like this is an issue that we've been thinking about um and how we plan to solve it."
  },
  {
    "speaker": "Rob",
    "content": "Awesome.  I okay. And so basically you have like uh you know, you have some some cross-chain transactions between uh let's say A and B, right, Mm-hmm."
  },
  {
    "speaker": "Rob",
    "content": "um and then and then you know, let's say they so they were both to opt out of the auction and you would have to revert back to the previous like whether it's Mint-and-Lock or Intent-based, you'd have to kind of revert back to the original way, you couldn't do the sequencer composability maybe because it's only C and D that are participating in the auction. And so A and B still have to figure out a way to know what's going on with one another and so there's a coordinator and there's and so sequencers are kind of on the right part of this. Mm-hmm. Uh oh, and I see why you chose B and C actually in the in the in the first example."
  },
  {
    "speaker": "Rob",
    "content": "because it it kind of works with this diagram. So what you're saying is that and we have we have all the sequencers on the right but there's actually like this middle uh layer of the coordinator that can read the state on both roll-ups at the same time and sort of work as like a central uh hub of data availability to check what is in the mempool of each roll-up at any given time. "
  },
  {
    "speaker": "Andy",
    "content": "Um yeah, so we'll sort of So the coordinator would sit basically after to the right of the sequencers and so the coordinator would take in blocks that are already sequenced and the coordinator would just say, \"Okay, roll-ups, these are the messages that are getting passed between you guys. Now, go and execute those like you want.\" Uh so yeah, the the coordinator's role and like responsibility is very minimal. It's just to say, \"Here's messages from another roll-up.\""
  },
  {
    "speaker": "Rob",
    "content": "Got it. Okay. That makes sense. Um because it's actually coming from the fast finality layer, like the pre-confirmation is how they get uh okay."
  },
  {
    "speaker": "Andy",
    "content": "Mm-hmm."
  },
  {
    "speaker": "Rob",
    "content": "Um one one question I have is like you know, let's say and and you mentioned like an app chain, right, may or may not need composability, but then you know, another chain maybe really wants composability with Arbitrum Mm-hmm."
  },
  {
    "speaker": "Rob",
    "content": "and you know, what if this this is maybe I'm I'm just going to ask, but like what if like there's a subset of transactions for a particular roll-up block that really need composability because you know, it it would really benefit them, but not all of the transactions in that block need composability. Just a subset."
  },
  {
    "speaker": "Andy",
    "content": "Yeah"
  },
  {
    "speaker": "Rob",
    "content": "Would would you be able to kind of separate these bundles to apart and and then synchronize some of them but then opt out of the auction with the other the other set?"
  },
  {
    "speaker": "Andy",
    "content": "Uh yeah, that's a good question and this is something that I've thought about and I at this point, I don't think that that's a way to do it. And the reason is because app chains might, or any sort of roll-up, might want to enforce a certain cer certain sequencing rules. So even if you have a cross-chain message, they might want that cross-chain message to go at the top of the block or they might want it to go at the bottom of the block.  Um and so you if you separate the two of them, Mm-hmm.  you it it maybe works, but then you kind of need to recombine them in a way and when you recombine them, you might end up with a different execution. So um if I'm a user and I get a pre-confirmation for my cross-chain swap and it says it executes, well then when these non cross-chain messages are added back in back in, maybe it actually fails.  Um but but to address the the issue is that yeah, so sometimes blocks may not have a lot of demand for uh cross-chain composability. If um depending on the roll-ups reserve price, they maybe still get shared sequence or sequenced together. If you have no no messages between chains, you can still have the same person sequence them and maybe you can even still get a few benefits from that. Um you know, this shared sequencer can give pre-confirmations, etcetera, uh but in the case that you don't have enough demand, then you can use this coordinator role that is very minimal, doesn't do any sequencing."
  }
]