[
  {
    "speaker": "Rob",
    "content": "It’s refreshing to hear because frankly I thought that you were just going to shit on them."
  },
  {
    "speaker": "Rob",
    "content": "Not to get too political but I do think that this is indicative of some larger trend that we’re seeing."
  },
  {
    "speaker": "Guest",
    "content": "Now the FUDs have moved on to, “Oh, they’re parasitic to Ethereum,” right?"
  },
  {
    "speaker": "Rob",
    "content": "Now a new category, how much is being paid by AI agents because it lowers the bandwidth requirements and bandwidth usage of the whole network which means that we can add more blocks."
  },
  {
    "speaker": "Andy",
    "content": "Where are we headed in terms of the amount of block space expansion for Ethereum?"
  },
  {
    "speaker": "Andy",
    "content": "All right, welcome to Bangkok."
  },
  {
    "speaker": "Andy",
    "content": "I mean, first time here for in Thailand, Rob and I running around on our Grab bikes."
  },
  {
    "speaker": "Andy",
    "content": "No helmets, just…"
  },
  {
    "speaker": "Rob",
    "content": "Yeah, you got to helmet on today but uh that’s the way to get around, there’s so much traffic"
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "and uh these motorbikes just cut right through all the noise"
  },
  {
    "speaker": "Rob",
    "content": "and uh…"
  },
  {
    "speaker": "Andy",
    "content": "It’s like L2s."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, exactly. I’m not, I haven’t braved the motorbikes yet, I don’t think I will. It’s just looking at it from when I’m in the car uh and looking at the way they go and where they drive. Like, yeah, it’s cool cutting through all the traffic but I’m like, uh, I don’t know, it’s worth You’re stuck on mainnet."
  },
  {
    "speaker": "Guest",
    "content": "You’re stuck on, you’re mainnet maxi. Yeah, yeah, yeah. But no, it, Bangkok’s a very interesting city. It’s my first time here as well, yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Well, Anthony, it’s your first time on the show. Uh, appreciate you coming out this morning. First podcast of the day. Uh, I’m sure our, our audience is familiar with, uh, who you are, kind of your background but we’d love to actually just learn a bit more about your story of how you got into Ethereum personally. Uh, I'm not sure that I’m aware of kind of like your journey and then I think that’ll be helpful for our community too."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah. So my, my journey was one of, I guess, uh, it's a bit of a, a changing of the kind of tides as I went through it. So I got into Ethereum in 2017. Really just found it because a friend mentioned it to me. I was into Bitcoin in 2013 but then there was kind of the bull market and then the bear market and I kind of stopped paying attention to it. ‘Cause back then, I was just young and silly and didn’t have, really have much money and I lost it trying to trade Dogecoin back then uh when it first came out. So, I kind of got burnt out, which unfortunately made me miss the Ethereum ICO in 2014 um and kind of missed Ethereum until 2017 basically. But then my friend mentioned it to me, to me because he knew that I was into Bitcoin in 2013. And he’s like, “You should check this thing out.” And I immediately became a lot more interested in Ethereum that I ever was in Bitcoin because it wasn’t just like the money side of it, it was also the tech side. And I have a tech background, I’ve been building computers since I was a little kid and I was working in cyber security at the time. So, yeah. I mean, I, immediately kind of got the vision. Like I did, I didn’t even need to be convinced. They read like a couple of blog posts from Vitalik, uh, and I was like, you know what, this, this sounds awesome. And of course, like a lot of it was still very early but back then, I was looking at it through kind of starry, dreamy-eyed. Like, “This, this, even, even if this works at all. This is going to be, this is going to be awesome.” And then, you know, 2017 there was the bull market as well that, that kept me in. Like, ‘cause I mean, as much as people like to try and deny it, number go up feels amazing no matter who you are. Even if you’re in it for the tech, like number going up is, is good. And I think it’s just good for the tech anyway. Like, it’s, it’s, it, anytime the market goes up brings in a lot more attention. Um, but then, yeah, 2018, 2019 bear market, I actually decided to stick around this time. I didn’t exit crypto and that’s where I really grew my brand. Like, 2017, I was really just like a casual observer. I wasn’t known in the ecosystem, I wasn’t active on Twitter. But then in 2018 and 2019, Ethereum needed a kind of, I guess, like a group of core people to really keep the flame alive because it was just such a brutal bear market. Like, ETH went from $1,400 to $80. Everyone thought ETH was dead. Bitcoin was dead, this, this thing’s going nowhere. DeFi, what’s that? Like…"
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "And then, uh, in 2020 was when things really got super interesting because uh DeFi summer happened and then I think that really validated Ethereum’s kind of core use case of doing, you know, not just decentralized finance but decentralized applications on, on the chain. And then all these money came in and it was a kind of capitulation of narratives for all the haters who were just saying, “This is never going to work.” And then it worked and they couldn’t say it wasn’t going to work anymore. It’s kind of similar to the L2 stuff um to an extent. But then, yeah, obviously we had another bull market. Wrote all of that through. Um, and all, all the meanwhile, like I was doing different things as well, like during those years up until today. I started something called EthHub in 20, nine, early 2019 or late 2018 with Eric Connor. Uh, that was basically a, uh, an information resource, you know, podcast, stuff like that, to fill the gap. ‘Cause back then, there wasn’t really anything for Ethereum. Like, Bankless actually came just after EthHub um, but, uh, uh, yeah, Bankless and, and EthHub kind of, I guess, grew during that kind of period. Tried to, to better the narratives around Ethereum and spread the word about Ethereum uh back then. And then The Daily Gwei, which is what I mostly focus on now, was started in mid-2020 um, and I’ve been doing that ever since. So, that’s basically, uh, it used to be a daily kind of Ethereum podcast. I kind of slowed down a bit uh ‘cause things get just, just so noisy in bull markets. It’s deafening."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah. So it’s like every, maybe like a two or three a week if I can do it, do an episode. Um, but really, the, the whole time I’ve also been growing my, my Twitter presence, uh, and you know, for better or worse, Twitter is like the town square of crypto and, and of Ethereum especially. And yeah, just trying to, I, I guess like my north star as people like to talk about, with, with, with what I do is to just uh correct the misinformation and educate as much about Ethereum as I can because there’s just so much bad information out there as you guys are well aware of."
  },
  {
    "speaker": "Rob",
    "content": "I, I think we have a very similar mission. And we got our start in uh a university club. It was originally called the University uh Bitcoin Club."
  },
  {
    "speaker": "Guest",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "And it’s funny because we, we met in 2017, we were like, that, that’s kind of where we got our start there. And then you know, quickly, right afterwards, 2018, 2019, there was kind of that, that bear market that hit. It was like, and there was a movement going on, it, it was like, blockchain, not Bitcoin."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And actually the club rebranded and went full blockchain and we had this whole enterprise blockchain cycle where we had Walmart experimenting with blockchain on supply chain."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "IBM, they, like, they started sort of incorporating and kind of open their eyes to blockchain but still cryptocurrency was totally a scam. And there was nothing to do with this financial world on chain. And, and then you know, that has, has really started to shift in recent years."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "And so, I don’t, like, as you were kind of going through those cycles, you know, did you, did you ever lose faith? Did you ever lose, ‘cause those bear markets are tough, right?"
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "Was there a point where you were like, man, I don’t know like what, you know, what was sort of…"
  },
  {
    "speaker": "Rob",
    "content": "What was sort of that trough and then what kept you going through that and was like, “No, they,"
  },
  {
    "speaker": "Rob",
    "content": "that North Star if you will, right? Where like the education and the correcting misinformation,"
  },
  {
    "speaker": "Rob",
    "content": "was there something that stuck out that continued to persist, that you knew was true but kind of the market was telling you was sort of skeptical about, that, that really kept you going in those bear markets?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I, I think that being so close to the Ethereum development, especially during 2018, 2018, 2019, 2020 which were, I would say, the most formative years for Ethereum and has really been the path that Ethereum has been on since you know, since then, we’re still on the same path of the roll-up centric roadmap and all that stuff there. Um, I would say that just the fact that like I could see that the building was real and real things were happening, the community was, was there, was growing. People weren’t abandoning Ethereum, they were just doubling down on it. All, like that all collectively just made me keep the faith so to speak and also because I actually believe in what was being built and I believed in the potential here and I wasn’t blind to it, uh, to, to DeFi. Like, a lot of people in the crypto ecosystem were, they, they just didn’t use the chain. Like, it sounds insane but they weren’t on Ethereum, they weren’t using it at all. And they just heard about DeFi on Twitter or somewhere else and they’re like, “Well, that doesn’t sound real, doesn’t sound like it’s going to work.” But then I’m on there using it. I’m like, trading on UniSwap, right? I’m opening up like a Maker CDP. Like, “This is real. Like, I’m doing it. I’m not just delusional, uh, you know, being bullish on nothing, it’s real.” So, I think that when people go and use these things and, and realize that it’s, it’s, it’s real, it actually uh provides value and it actually exists, that’s when it immediately shifts for them. ‘Cause you can’t deny reality. Like, there’s the narratives that, that form but then there’s the reality and, and as soon as you’re exposed to the reality, I mean, you can try to deny it but it, it’s very hard to at that point. Like, with narratives, you can always write them off and be like, “Oh, that’s just a story people are telling. That’s just the Eth maxis being bullish on something that’s not real.” Whatever. And same happened with the L2s, you know, that for a while there, people were kind of fudding them and saying that they weren’t real and then they became real and now the FUDs have moved onto, “Oh, they’re parasitic to Ethereum.” Right?"
  },
  {
    "speaker": "Rob",
    "content": "Mhm."
  },
  {
    "speaker": "Guest",
    "content": "It always just kind of moves the goalposts. Um, but for, yeah, for me, it, it really was that core community that all kind of believed in the mission, believed in the thing and things were getting shipped. It wasn’t just the, the app layer, it was, proof-of-stake was finally happening. Like, I saw all of that. And admittedly, it was difficult to track this and that’s why I actually started EthHub and The Daily Gwei because it was so hard to track this stuff and I was like, you know what, like, I, I get that, like, I’m bullish on it and I can keep track of it but so much of it is very complex, very technical. Uh, no one knows what these things mean, what these, these terms mean. So, I started my show with the goal of being able to essentially break down that, that information barrier."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. And, and at certain point it’s like all you got to do is survive."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "Like, if you survive the bear market, you get…"
  },
  {
    "speaker": "Rob",
    "content": "You get to times like today."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Like, right now where things are very, very different."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Um, I mean, it, it’s incredible. I mean before we kind of turned on the recording we were talking about like how the paradigm has, has shifted. “Oh, yeah, today, ETH has the best narrative…”"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah, yeah, yeah, exactly. Like, that, since the election is like six days now. Yeah, the tech has just improved by 30%, right?"
  },
  {
    "speaker": "Rob",
    "content": "It’s, it’s been like a whole month since the election, it’s, it’s gone crazy."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah, yeah. Yeah, exactly. Yeah, that’s, that’s what bull markets feel like. It feels like it just goes on and on and on forever, yeah. And then it just abruptly ends so…"
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "We can’t possibly keep this pace up, right? Like that’s, that’s what it feels like but then…"
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And then it just continues to happen. I mean, we really have just gotten started. It’s kind of the feeling. And I think because we’re in it, we’re doing this every single day, you know, we’re, we’re the ones that are kind of like in it as it’s happening and it feels like it’s taking a really long time and it’s already, it’s already been going on for so long but…"
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "But, I mean, we were talking this morning. Just this morning, people are starting to hit us up, that normies you could say, right? Where like, they’re just starting to take notice."
  },
  {
    "speaker": "Guest",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "And, and I think again, like that is just starting to happen. And so, where, I mean, guys, where do we go from here?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, yeah. Yeah, I mean, I think that, it’s, it’s the same kind of story every cycle where, yeah, because we’re in it every day and we’re paying attention to it, it may feel like everyone’s in it because it’s our little bubble. And then you just for, forget that most people don’t even hear of crypto until it’s at all-time highs. And I was actually speaking to one of the ETF issuers recently and I was saying you know, what’s going, how’s it going with the, the ETF, you know, how you going talking to, like, TradFi people about it. And they’re like, “Honestly, most people haven’t even heard of Ethereum.”"
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Like, that’s insane to me hearing, I’m like, “Are you kidding me? Ethereum is obviously not, you know, as big as Bitcoin, it’s second, it’s not first.” But uh the thing is, is that Ethereum has been around for so long, it’s been talked about in mainstream media and everything. But then, I, I, I kind of sat there and I thought about it for a bit. I’m like, you know what, like, when you actually look at the mainstream media, they only really mention Bitcoin most of the time, right? Bitcoin’s this thing that only, like, Trump for example only, only mentioned Bitcoin in crypto. He doesn’t say Bitcoin and…"
  },
  {
    "speaker": "Rob",
    "content": "Yeah, they never mention Ethereum."
  },
  {
    "speaker": "Guest",
    "content": "Right. So, it’s, because it’s like, it’s that thing of you just mentioned one or like the broader, the broader class…"
  },
  {
    "speaker": "Rob",
    "content": "Right."
  },
  {
    "speaker": "Guest",
    "content": "Um, it's, it’s the same with everything, I think. But that was insane to me and then when I, when I, when I sat down and thought about it, it was like, “That’s actually incredibly bullish because it means that there’s still so…"
  }
]