[
  {
    "speaker": "Rob",
    "content": "All the ones have already kinda made their move where they started to acquire BTC, um and they may acquire other assets in the in the future as well. Of like, um what is El Salvador doing it and a few others."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "So, it starts with the smaller ones. Right. Um maybe I mean, you know Trump said and he and people around him said that they might buy BTC as like a reserve asset but, we'll we'll see."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I I'm hearing that from senators like, uh the senator from Wyoming who really has some very friendly crypto uh uh regulation in their state. Is has been tweeting that. There is like RFK that's very now closely associated with Trump who's been pushing for this Bitcoin reserve treasury to be added. I I I think, like not to get too political but I do think that this is indicative of some larger trend that we're seeing where it is a move away from the globalists Mm and the one-world government type of use the currency that we tell you to use, think the things we tell you. And then, this transition into more like, I mean even Trump transition into a less federal government, more state government. Mm. More localized government, less federal national worldwide economies, more local driven col community-driven commodities and and economies. And I I yeah who who who's to say what the consequences of this are, but"
  },
  {
    "speaker": "Rob",
    "content": "Mm."
  },
  {
    "speaker": "Rob",
    "content": "It's it's funny though that you mentioned that like, that world yeah is becoming more kinda I guess, insular whereas the digital world is just becoming more global, right? Like, it's i it's not like you can control the kinda I guess like, Bitcoin blockchain or Ethereum blockchain. You can't like, force people that o only in a certain jurisdictions to transact on it because it's it's truly decentralized, right? So, I think that, while, yeah the the physical world is becoming more kind of insular, the digital world is just becoming more global. And more people are coming online all the time, getting connected and, now that we have a native way to transact value because, before it was just information now it's value through through the use of of crypto, um it's gonna be funny to see those two things try and like, actually work in harmony. I don't think there's any harmony to be to be happy."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "So, the software eats the world thing, but like with crypto rails now."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Exactly. Yeah. Mm hm."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "And and it I think it gives the, not just people but some economies, an escape hatch. Yeah. And so you think about some, I mean we were walking around this this Thai market the other day and they have USDT. Pay with USDT on Tron."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Yeah yeah yeah yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "That's that's that's crypto adoption in Asia for ya, in the Tron USDT."
  },
  {
    "speaker": "Rob",
    "content": "Yes. Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, it's big it's big."
  },
  {
    "speaker": "Guest 1",
    "content": "Why are why are they using Tron?"
  },
  {
    "speaker": "Rob",
    "content": "Cheap."
  },
  {
    "speaker": "Guest 2",
    "content": "It was ch- it was ch-"
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, I mean it's it's not so cheap these days, but what happened was Ethereum L1 was expensive, there wasn't uh L2s, um Tether wa- there was a lot of Tether on Tron cuz they issued issued it there because the fees were cheaper. Mm. Mm. Hm And then, what happens is that it it builds a network effect, Mm hm. and then, you know as you said like, at the Thai market like, they tell their friends about it. Like, hey you could do this on Tron. So, it's it's hard to kind of break that network effect even if the fees have gone up. Right. But yeah, and and Binance was a big player too cuz Binance was available"
  },
  {
    "speaker": "Guest 1",
    "content": "Across all of like Asia and they they got their hands in all sorts of pockets, you know."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "We're gonna chat with Reznik a little later today, and talk about parasitic L2s but I mean, Yeah.  like, just kinda break into that a little bit. How parasitic or symbiotic is Tron and this Tether activity on Tron? Yeah. Is there value accrual to ETH as a result of this economic activity or is it too side load with its own network effects and it doesn't bring value back to, and I, you know you can talk about ETH the asset bringing value there or back to Ethereum the protocol. Mm hm. How do you like using Te- Tether on Tron, as an example here? Yeah.  What what would you how how how do you what do you think is the right way to think about the the economic activity that is existing on sort of these these roll ups or these alternative side chain type of frameworks? Mm hm. How how parasitic or symbiotic is that?"
  },
  {
    "speaker": "Rob",
    "content": "Yeah, so I mean, when it comes to Tron, it's a separate L1, right? Like, it's a separate L1, it it has a completely separate ecosystem. It uses TRX as its gas token, doesn't use ETH. It's TRX is, I mean it's not a money or anything like that, but it it's it's the heart of the ecosystem, basically. Yeah. So, I think that, uh like, those L1s are definitely parasitic to Ethereum because, they're actively like, not in Ethereum ecosystem, they're not trying to help Ethereum ecosystem, they're not giving anything back to it whether it be directly by fee revenue or socially via like, you know talking with people in Ethereum ecosystem, uh collaborating with them, working with them. They're not doing any of that, right? So, I think that every kind of user that's on Tron is a user that Ethereum"
  },
  {
    "speaker": "Guest 1",
    "content": "Lost, or didn't gain."
  },
  {
    "speaker": "Rob",
    "content": "Lost or didn't gain. Yeah. Uh and I think that's true for pretty much like, BSC as well Binance smart chain. Even though these things are EVM networks, by the way. Yeah. Really. They're not doing anything really, except, you could make the argument that the the most that they're doing is, in increasing the EVM network effect, bringing more Solidity developers in, who can then go and develop on the L2s or on on Ethereum L1. But other than that, yeah no I I wouldn't consider those to be symbiotic uh"
  },
  {
    "speaker": "Guest 1",
    "content": "But we're we're still bullish on adoption, right?"
  },
  {
    "speaker": "Rob",
    "content": "For sure. I mean,"
  },
  {
    "speaker": "Guest 1",
    "content": "But I'm talking about this in the context of Ethereum. Yeah yeah yeah."
  },
  {
    "speaker": "Rob",
    "content": "I mean I mean"
  },
  {
    "speaker": "Guest 2",
    "content": "100% 100%. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "100%. Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, there's there's no ties there back to Ethereum at all. Not no, none."
  },
  {
    "speaker": "Guest 1",
    "content": "But it's good to see like, the USDT sign. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "The sign yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "On on the crypto adoption side, it's beneficial, of course. Yes, definitely. But on the Eth like, for the Ethereum ecosystem, I wouldn't say that they're like, adding value to Ethereum like, it's it's it's very clear to me. Yeah, definitely. Yeah. But then, people will argue the same for L2, saying that, well what's the difference between an L2 and and Tron, for example, and, well I mean the obvious difference is, uh they use ETH as as gas that's that that that's a big difference. Right now. For for for now, but I know people say that they'll extract that awa- abstract that away, and then stable coins will be used and and that's fine. Like, I don't think that's that's an issue. Um they they do pay, um I guess like uh, a fee down to the L1, and I know that's not huge right now but we've already seen blobs to that capacity now. They they they're going into price discovery, all all that stuff. But then, the thing is with the L2s is that, the top ones today they're all actively giving back to the Ethereum ecosystem. Like, if we just take Base for example. Like, they they were heavily involved in in blobs and getting blobs over the line. They were working on them with the Ethereum core developers. You don't see that from Tron or from BSC or anything like that. That they they don't want to work wi- within the Ethereum ecosystem. So, so the L2s like, as they exist today, I I'm not talking about the ones in the future which can can have uh I guess tighter, um uh tighter economic alignment with L1 through base uh, the base architecture. But just L2s as they exist today, they're still increasing the network effect of ETH as an asset, not just as as using as gas fees, but also because people are using ETH within those economies. You can actually go on and see what are the most popular assets on those different L2s, and ETH is number one across all of them. Obviously, stable coins, are also uh very popular there, but ETH is number one across there. Right. And, I think that the more people that kinda go into these L2s and and the L2s are using the Ethereum L1 for their security, for their settlement guarantees. It just, increases the Ethereum network effect overall, increases the Ethereum's strength overall, Yeah. and maybe the best kind of I guess way to to think about this is that, the L2s are like, the states in the United States and Ethereum is the the whole US, right? Yeah.  And it all adds value there. And then, there are arguments to be made that, well, there's nothing stopping an L2 from becoming its own L1 directly. Like, it's not like Ethereum has an army that can go after the L2 and say, hey no you can't leave us, you're staying in here. But, Ethereum offers so much to these L2s that it just doesn't make any sense for them to become an L1, um especially because becoming an L1 actually limits their scalability as well. Because, I'm a strong believer that, um L1s have a fundamental scaling limit and L2s um h- have one that that's just like, way bigger than than the L1. So, I I really don't don't buy into that argument, but I can see how people think that they're parasitic because every dollar that's on the L2 isn't on the L1. Right. But then, you could make the argument well we di- Ethereum's road map doesn't um, it it scales the L1 over the long term but not like uh Solana for example. It's not trying to scale the L1 to to a million TPS or whatever. Uh and then, you could say, well if Ethereum didn't have L2s, then all of those L1 users would just go to other L1s because they're priced out of L1. Right. Be done. So, the the the question in the beginning to me, doesn't make much sense, because you're implying that Ethereum would keep the users if it didn't have L2s, which it wouldn't."
  },
  {
    "speaker": "Guest 2",
    "content": "Right."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And so, and so you you have this uh, this talk later this week about whether or not blobs are good for Ethereum and, and more specifically on this topic. Uh a a question that I'm kinda like, toying with right now is like, um, is this advent of alternative data availability providers, Celestia, Avail, EigenDA, uh which are gonna help bring much higher throughput to Ethereum L2s and help scale Ethereum as a whole. But uh, but remove one of the core properties of Ethereum's supposed value accrual in fee generation, as well as kinda like, broader alignment, which is using Ethereum DA, using blobs. Like, are these rollups any less aligned to or any less like, important than the ones that are using ETH DA? Um and like, how should we kinda think about these types of L2 designs in this broader conversation of like, are blobs good as well?"
  }
]