[
  {
    "speaker": "Andy",
    "content": "It gives the not just people but some economies an escape hatch. And so you think about some I mean we were walking around this tie market the other day and they have USDT pay with USDT on Tron."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Yeah. Yeah. Yeah. Yeah. That's That's crypto adoption in Asia for you in the Tron USDT. Yes. Yes. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. It's big. It's big."
  },
  {
    "speaker": "Andy",
    "content": "Why aren't Why are they using Tron?"
  },
  {
    "speaker": "Guest",
    "content": "It was it was cheap."
  },
  {
    "speaker": "Andy",
    "content": "Super fast."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. I mean It's It's not so cheap these days but what happened was Ethereum L1 was expensive. There wasn't L2s. Um Tether wa there was a lot of Tether on Tron because they issued issued there because the fees were cheaper. Hmm. And then what happens is that it it builds a network effect. And then you know as you said like at the tie market like they tell their friends about it. It's like hey you could do this on Tron. Right. Right. Right. So it it's hard to kind of break that network effect even if the fees have gone up. But yeah. And and Binance was a big player too because Binance was available as that Yeah. Exactly. Binance uh all like Asia. Yeah, they got their hands in all sorts of pockets you know. Yeah. We're going to chat with Resnick a little later today and talk about parasitic L2s but I mean like just to kind of break into that a little bit, how parasitic or symbiotic is Tron and this Tether activity on Tron? Yep. Is there value accrual to ETH as a result of this economic activity or is it too siloed with its own network effects and it doesn't bring value back to And I you know you can talk about ETH the asset bringing value there or back to Ethereum the protocol. Mhm. How do you like using Tether on Tron as an example here. Yeah. What what would you how how do you what do you think is the right way to think about the economic activity that is existing on sort of these these rollups or these alternative side chain type of frameworks. How how parasitic or symbiotic is that? Mhm."
  },
  {
    "speaker": "Guest",
    "content": "Yeah. So I mean when it comes to Tron it's a separate L1 right? Like it's a separate L1. It it has a completely separate ecosystem. It uses TRX as it's gas token doesn't use ETH. It's TRX is I mean it's not money or anything like that. But it it's the heart of the ecosystem basically. So I think that uh like those L1s are definitely parasitic to Ethereum because they're actively like not in Ethereum ecosystem. They're not trying to help Ethereum ecosystem. They're not giving anything back to it. Whether it be directly by fee revenue or socially via like you know talking with people in Ethereum ecosystem uh collaborating with them, working with them. They're not doing any of that, right? So I think that every kind of user that's on Tron is a user that Ethereum lost or didn't gain. Yep. Uh and I think that's true for pretty much like BSC as well, Binance Smart Chain. Even though these things are EVM networks by the way, they're not doing anything really except may you could make the argument that the the most that they're doing is in increasing the EVM network effect, bringing more solidity developers in, who can then go and develop on the L2s or on on Ethereum L1. But other than that yeah no, I wouldn't consider those to be symbiotic uh Yeah. Really. But we're we're still bullish on adoption right? For sure. I mean, I mean, I I love these But I'm talking about it in the context of Ethereum. Yeah. Yeah. Yeah. 100% 100%. And so yeah. Yeah. But I mean there's yeah there's no ties there back to Ethereum at all. Not no not Yeah. But it's good to see like the USD design Yeah. But on the crypto adoption side it's beneficial of course. But on the Ethereum like for the Ethereum ecosystem I wouldn't say that they're like adding Great. Yeah. Definitely. value to Ethereum like. Yeah, it's it's very clear to me. Yeah. No. But then people will argue the same for L2 saying that well, what's the difference between an L2 and and Tron for example. And well I mean the obvious difference is uh they use ETH as as gas, that's that that's a big difference for now. But I know I for now, but I know people say they'll extract abstract that away and then stable coins will be used and and that's fine like I don't think that's that's an issue. Um they they do pay um I guess like a fee down to the L1 and I know that's not huge right now but we've already seen blobs at capacity now. They're they're they're going into price discovery. All all that stuff. But then the thing is with the L2s is that the top ones today they're all actively giving back to Ethereum ecosystem. Like if we just take base for example, like they've they've heavily involved in in blobs and getting blobs over the line. They're working on them with the Ethereum core developers. You don't see that from Tron or from BSC or anything like that. They they they don't want to work with within Ethereum ecosystem. So so the L2s as it exists today I'm I'm not talking about the ones in the future which can have uh I guess tighter um uh tighter economic alignment with L1 through base uh the base architecture. But just the L2s as they exist today, they're still increasing the network effect of ETH as an asset. Not just as as using as gas fees, but also because people are using ETH within those economies. You can actually go on and see what are the most popular assets on those different L2s and ETH is number one across all of them. Obviously stable coins are also uh very popular there, but ETH is number one across there. And I think that the more people that kind of go into these L2s and and the L2s are using the Ethereum L1 for their security, for their settlement guarantees, it just increases the Ethereum network effect overall, increases Ethereum's strength overall. Yeah. And maybe the best kind of I guess way to to think about this is that the L2s are like the states in the United States and Ethereum is the the whole US, right? Yeah. And it all adds value there. And then there are arguments to be made that well there's nothing stopping an L2 from becoming its own L1 directly. Like it's not like Ethereum has an army that can go after the L2 and say hey no, you can't leave us. You're staying in here. But Ethereum offers so much to these L2s that it just doesn't make any sense for them to become an L1. Um especially because becoming an L1 actually limits their scalability as well. Because I'm a strong believer that um L1s have a fundamental scaling limit and L2s um have one that's just like way bigger than than the L1. So I I really don't don't buy into that argument. But I can see where people think that they're parasitic because every dollar that's on the L2 isn't on the L1. Right. But then you could make the argument well we did Ethereum's roadmap doesn't um it scales the L1 over the long term but not like uh Solana for example. It's not trying to scale the L1 to to a million TPS or whatever. Uh and then you could say well if Ethereum didn't have L2s then all of those L1 users would just go to other L1s because they're priced out of L1. Correct. We're doomed. So the the the question in the beginning to me doesn't make much sense because you're implying that Ethereum would keep the users if it didn't have L2s, which it wouldn't. Right. Yeah. And so and so you you have this uh this talk later this week about whether or not blobs are good for Ethereum and more specifically on this topic uh I'm uh a a question that I'm kind of like toying with right now is like um is this advent of alternative data availability providers? Celestia Vail, I can DA uh which are going to help bring much higher throughput to Ethereum L2s and help scale Ethereum as a whole but uh but remove one of the core properties of Ethereum's supposed value accrual and fee generation as well as kind of like broader alignment which is using Ethereum DA, using blobs. Like are these rollups any less aligned to you or any less like important than the ones that are using ETH DA. Um and like how should we kind of think about these types of L2 designs in this broader conversation of like are blobs good as well."
  }
]