[
  {
    "speaker": "Guest",
    "content": "So many people that need to learn about Ethereum and then, you know, possibly buy ETH and invest in ETH as well. So we may feel like we're so late now because these assets are so big, and everything feels like it's going crazy. But I mean we're so early it's not a meme, there's still so many people to come in."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Okay. So on that point then we on our podcast with Arthur Hayes and Murad a couple days ago, Murad basically put out the idea that in order for ETH to get to $20,000 or $30,000, the only way in his thesis, right, which is that is that it's valued basically as a store of value. It it it has to have this monetary premium to reach this kind of, you know, $600 billion, trillion dollar mark eventually. Uh and basically it can't be it can't be viewed as like this tech asset like this um kind of like computer, right? And so Bitcoin's obviously got that first kind of like meme, it's like it's got the memetic property of being Bitcoin. Mhm. And so it thus, you know, it's trading over $1 trillion today, could be worth multiple trillions even, I mean, $10 trillion in the future. Uh do you see Ethereum's path to $20 or $30,000 per ETH as a similar narrative? And I mean we can kind of get into this North Star where Bitcoin's got this digital gold. Solana's got trading as fast as Nasdaq at the speed of light. Ethereum's kind of trying to figure it out like, is what's the path to Ethereum at $30,000?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I mean I totally agree with that, and it's something that I've been talking about for a very long time now since the last I mean, the previous bull market. So like 2019 um because it's obvious that Bitcoin is not valued based on its revenue at all, right? It does barely any fees compared to its market cap. I think it's like $1-$2 million fees a day and its market cap is 1.5 trillion. So if you do like a price to earnings kind of thing on that or do any fundamental analysis on that, BTC would not be worth anywhere near that, and that's that's obvious to everyone at this point that it is a store of value, it is a money. Um the same is true for ETH as well like ETH has higher fees, but not enough to justify a $350 billion market cap, right? So you you naturally come to the conclusion that these things have a monetary premium, that are like a store of value, and there are plenty of people who will tell you that they use it as a store of value, like I buy ETH to store my value, like I'm not buying ETH based on how much free revenue it's doing. I've never done that, right? Not to say that fee revenues aren't important and then we shouldn't keep increasing those so that when you stake your ETH you get you know, you get the revenues from that um and it's better and more people want to stake their ETH and so on and so forth. But yeah, for ETH to get to 20, 30k like and if you're talking about just from a market cap perspective that's trillions of dollars in market cap. It needs to be a store of value, a money. It needs to keep increasing that monetary premium. And I I really think that that comes down to a the story that you tell about it, the the story that you tell about ETH as an asset, and Ethereum as a network. Yeah. And I know that Ethereum doesn't have like a fancy one-liner, and I actually think that's a positive thing over the long term because Ethereum shouldn't just be boxed into something. Like Bitcoin being digital gold is fine, but like then there's a ceiling on it, your ceiling is basically gold, right? Um but and Solana being decentralized Nasdaq, I mean, it's already worth more than Nasdaq like in terms of market cap, and also you're boxing yourself into like one kind of use case, really. And the thing is, is that these narratives uh a guess a social consensus and they change over time as well, these North Stars change, because even in Solana, for example, they you know, they say they want to be decentralized Nasdaq, but then there's other people saying that they want to be something else. They want to do something else with it, they want to and and that just happens as the community grows, and I think that Bitcoin also evolved over time, originally it was peer to peer money, right? And now it's digital gold, but there's still a fraction within Bitcoin that wants it to be peer to peer money, and they're trying to build like these new Bitcoin L2s that are better than the lightning network in order to scale Bitcoin payments. But the the problem becomes is that well Bitcoin is, they spent the last 10 years convincing everyone that BTC is not to be used for payments, it is a store of value. Correct, yeah. Whereas in Ethereum, ETH can be a store of value, but we also have stable coins on the network, right? We that that that can be your like your money, and when we say ETH is money, that's that's a meme within the ecosystem. I'm talking about ETH as a commodity money. Correct. Not not as a fiat money, people think that fiat is the only form of money. You're not going to use ETH to buy your coffee, it's not practical."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "No, no, exactly and and that's that's totally fine um and and I think that, you know, stable coins are great and and everything they obviously have their drawbacks, they're centralized, they're still pegged to U.S. dollars or euro, uh and maybe we get better stable coins in the future that aren't pegged to those sorts of things. But yeah, I I think people just get it wrong when they think, \"Oh, ETH is money.\" It's not, it's not like U.S. dollars, it's like, \"Yeah, it's not.\" It's not. It's commodity money, it's a store of value, um but yeah, I fully agree with that, and I and I think that even to um other things that Murad and other people have said about like uh cults forming around these things really like these these coins get a lot of value from the cult energy, and and I think, you know, Bitcoin is the perfect example of that, like there's a very strong cult around Bitcoin and that's where they're getting a lot of their value from. Uh but I think that uh that a a strong cult forming around an asset is very very rare, there's not that many assets that have strong cult like strong lasting cults, like talking about ones that last like 10 plus years, like decades, it's really, I think, only Bitcoin and Ethereum so far, you know, maybe Solana gets there but it hasn't been around long enough yet. All of the meme coins that you see right now besides maybe Dogecoin have not been around long enough. So yeah."
  },
  {
    "speaker": "Andy",
    "content": "Correct."
  },
  {
    "speaker": "Rob",
    "content": "Mhm."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. So think about the the Gamestop era of 2020 was maybe the only other time or asset that we saw people rally around. Mhm. So I think it is a relatively recent phenomenon that people are forming these these mind hubs around different financial assets, and I think that's a sign of of the times, like it it used to be like, you know, there we didn't have access to finance like we have access to finance now and and investing. Mhm. And and personal uh like self-deployed finance and peer-to-peer finance was not possible or not really, not practical like pre-Bitcoin. Mhm. With the first peer-to-peer network, and then things got kind of hyper-financialized and and then we kind of got that era where we had more community-driven finance, and the whole I see era ICO era was part of that as well. And so like this, I think we really can't point to any historical examples of how cults have formed around money un-like until like even in recent eras. Maybe there's some like national currencies that people rallied around. We can kind of like draw some examples from the past there. But I I really think we're in like this new paradigm where the people are realizing that they have more of an impact on the financial ecosystem than they've ever had in the past. Mhm. And that is going to have some some long-lasting consequences and domino effects into the future. I don't know what the possibilities are are I don't know what results from that, I think it I mean we could speculate, but essentially like I mean, I I would say that maybe like Gamestop, Tesla, we have some of these other ones in the traditional financial ecosystem, but crypto has really taken that as it's as a stronghold and and ran with it. Mhm. What do you gu- I mean, what do you think are the the the consequences of of more community more localized finances rather than like one global finance, but more localized sort of economies?"
  },
  {
    "speaker": "Guest",
    "content": "It's it's difficult to tell because, as you said, it is something relatively, I guess, new, because you could say that there's not really like a cult around fiat currencies. Maybe the U.S. dollar is like a reserve currency, and there's like a way for um um, you know, America to assert its dominance on other nations, but you've never really seen like a similar thing, like no one's worshipping the U.S. dollar as like a store of value or anything. There was gold bugs."
  },
  {
    "speaker": "Andy",
    "content": "Right."
  },
  {
    "speaker": "Guest",
    "content": "Well that I was going to mention gold, gold bugs is the closest thing, you know, they're they're definitely a gold cult, right? Um but a lot of, I think, a lot of gold bugs got converted in-into Bitcoin definitely. Uh yeah yeah, but there's still a lot of gold bugs, and gold has been doing well. Like it's not like it's down or anything, it's actually, yeah it's it's gone crazy. And I think Bitcoin is liked that as well because it means that the target or the ceiling for Bitcoin goes up, too, right? If they're targeting like a $15 trillion gold market cap, if that goes up to 20, 25, 30 trillion, then Bitcoin can also kind of go there. So and and and I think uh yeah, gold is definitely uh much more of a community-driven, like people-driven thing than anything else, because yeah, if you if you're like born in a in a country, they force you to use their fiat currency to pay for taxes and and services in that country, but now with a globally kind of proper global decentralized financial ecosystem where the cost to issue an asset is basically zero, yeah, the people are the ones in control now, like no one's telling the people, like you need to go uh value this one, like you need to pay your taxes in this one, or you need to you need to do commerce in this one, no. Every, uh, the community just coalesces around that, and I think that's uh uh uh a strong reason why I believe that ETH is this commodity money within the Ethereum ecosystem and and beyond, is that people have just naturally chosen ETH as that. No one forced ETH upon them. You know, a lot of the core devs actively early on told people that ETH was just to be used for gas. It wasn't actually to be used for anything else. And there is an argument to be made that because you have to use it as as the fee token, that it kind of forced people into using it, but the thing is, is that like that people only have to hold what they need for gas in that world, they don't have to hold ETH as a money, as a store of value, but they've chosen to. And ETH now has the cult energy around it just like BTC has and just like a few other assets have. But yeah, I don't know what the long-term consequences are here, I think that nation-states, like the smaller ones have already kind of made their move where they started to acquire BTC, um and they may acquire other assets in the in the future as well. Uh like um what is it, El Salvador doing it and a few others. So it starts with the smaller ones. Um maybe, I mean, you know, Trump said and and people around him said that they might buy BTC as like a reserve asset, but we'll we'll see."
  },
  {
    "speaker": "Rob",
    "content": "Still pumping."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Yeah, they did. Yeah. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. And I'm hearing that from senators, like the uh, the senator from Wyoming, who already has some very friendly crypto uh, regulation in their state, has been tweeting that. There is like RFK that's very now closely associated with Trump, who's been pushing for this Bitcoin reserve treasury to be added. I I I think like not to get too political, but I do think that this is indicative of some larger trend that we're seeing where it is a move away from the globalists Mhm. and the one-world government type of use the currency that we tell you to use, think the things we tell, and then this transition into more like I mean even Trump transitioned into less federal government, more state government, more localized government, less federal, national, worldwide economies, more local-driven, community-driven, commodities and economies. And I I, yeah, who who's to say what the consequences of this are, but"
  },
  {
    "speaker": "Guest",
    "content": "It's it's funny though that you mentioned that like that world, yeah, is becoming more kind of, I guess, insular whereas the digital world is just becoming more global, right? Like it's it's not like you can control the, kind of, I guess like the Bitcoin blockchain or the Ethereum blockchain. You can't like force people that are only in a certain jurisdiction to transact on it because it's it's truly decentralized, right? So I think that while, yeah, the the physical world is becoming more kind of insular, the digital world is just becoming more global, and more people are coming online all the time, getting connected and now that we have a native way to transact value, because before it was just information, now it's value through through the use of crypto, um it it's going to be funny to see those two things try and like actually work in harmony. I don't think there's any harmony to to be had there."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Is it the software eats the world thing, but like with crypto rails now."
  },
  {
    "speaker": "Guest",
    "content": "Exactly, yeah, yeah."
  },
  {
    "speaker": "Andy",
    "content": "And it and it"
  },
  {
    "speaker": "Guest",
    "content": "[inaudible]"
  }
]