[
  {
    "speaker": "Rob",
    "content": "It's refreshing to hear because frankly I thought that you were just going to shit on them."
  },
  {
    "speaker": "Rob",
    "content": "Not to get too political, but I do think that this is indicative of some larger trend that we're seeing."
  },
  {
    "speaker": "Guest",
    "content": "Now the fud's moved on to, \"Oh, they're parasitic to Ethereum,\" right?"
  },
  {
    "speaker": "Rob",
    "content": "Now new category, how much is being paid by AI agents."
  },
  {
    "speaker": "Guest",
    "content": "Is because it lowers the bandwidth requirements, and bandwidth usage of the whole network which means that we can add more blocks."
  },
  {
    "speaker": "Andy",
    "content": "Where are we headed in terms of the amount of block space expansion for Ethereum?"
  },
  {
    "speaker": "Andy",
    "content": "All right, welcome to Bangkok."
  },
  {
    "speaker": "Andy",
    "content": "I mean, first time here for, in Thailand."
  },
  {
    "speaker": "Rob",
    "content": "Robin and our, running around on our Grab Bikes. <noise> No helmets, just..."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, you, you got to helm on today. But uh, that's the way to get around. There's so much traffic..."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "...and uh these motorbikes just cut right through, all the noise..."
  },
  {
    "speaker": "Guest",
    "content": "...and uh..."
  },
  {
    "speaker": "Rob",
    "content": "It's like L2's."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. <noise> They're like..."
  },
  {
    "speaker": "Guest",
    "content": "I'm not, I haven't braved the motorbikes yet. I don't think I will. Uh, there's just, looking at it from when I'm in the car uh and looking at the way they go and they, where they drive. It's like yeah it's cool cutting through all the traffic but I'm like uh, I don't know. If it's worth..."
  },
  {
    "speaker": "Andy",
    "content": "You're stuck on mainnet."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah, I'm stuck on mainnet. <noise> Mainnet maxi. Yeah yeah yeah yeah."
  },
  {
    "speaker": "Guest",
    "content": "But no, uh, Bangkok's a very interesting city. It's my first time here as well. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, well Anthony, it's your first time on the show. Uh, appreciate you coming out this morning, first podcast of the day."
  },
  {
    "speaker": "Andy",
    "content": "Uh I'm sure our, our audience is familiar with uh who you are and kind of your background. But, we'd love to actually just learn a bit more about your story of how you got into Ethereum personally. I, I, I'm not sure that I'm aware of kind of like your journey, and then uh I think that'll be helpful for our community too."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah. So, uh, my journey was one of, I guess uh, it, it's a bit of a, a changing of the kind of, of tides as I went through it. So I got into Ethereum in 2017."
  },
  {
    "speaker": "Guest",
    "content": "Really, just found it cuz a friend mentioned it to me. I was into Bitcoin in 2013, but then, um, there was kind of the bull market and then uh the bear market and I kinda stop paying attention to it cuz back then I was just young and silly and didn't ha, really have much money and I lost it trying to trade Dogecoin back then uh when it first came out. So, <noise> I kinda got burnt out, which unfortunately made me miss the Ethereum ICO in 2014. Um and kinda missed Ethereum until 2017, basically. But then my friend mentioned it to me to me, cuz he knew that I wasn't a Bitcoin in 2013, and he's like \"You should check this thing out,\" and I immediately became a lot more interested in Ethereum than I ever was in Bitcoin, because it wasn't just like the money side of it. It was also the tech side. And I have a tech background. I've been building computers since I was a little kid, and I was working in cybersecurity at the time. So yeah, I mean I, immediately kind of got the vision. Like I, I didn't even need to be convinced. They read like a couple of blog posts from Vitalik uh and I was like \"You know what, this this sounds awesome.\" And of course like a lot of it was still very early, but back then I was looking at it through kind of starry dreamy eyes. I'm like \"This, this, even if this works at all this is going to be, this is going to be awesome.\" And then, in 2017 there was the bull market as well that, that kept me in. Like cuz, I mean as, much as people like to try and deny it, number go up feels amazing, no matter who you are. Even if you're in it for the tech, like number going up is, is good, and I think it's just good for the tech anyway. Like it's, it's, it, anytime the market goes up, brings in a lot more attention. Um, but then yeah 2018, 2019 bear market, I actually decided to stick around this time. I didn't exit crypto, and that's where I really grew my brand. Like 2017 I was really just like a casual observer. I wasn't known in the ecosystem, I wasn't active on Twitter. But then in 2018, 2019, Ethereum needed uh kind of, I guess like a group of core people to really keep the flame alive, because it was just such a brutal bear market. Like ETH went from $1400 to $80. Everyone thought ETH was dead. Bitcoin was dead. This, this thing's going nowhere. DeFi, what's that? Like. <noise> And then uh in 2020 was when things really got super interesting, because uh DeFi Summer happened. And then I think that really validated Ethereum's kind of core use case of doing the, you know, not just decentralized finance, but decentralized applications on, on the chain. And then all this money came in, and it was a kind of capitulation of narratives for all the haters who were just saying \"This is never going to work.\" And then it worked and they couldn't say it wasn't going to work anymore. It's kinda similar to the L2 stuff, um, to, to an extent. But then, yeah obviously we had another bull market. Rode all of that through, um, and all the, all the meanwhile like I was doing different things as well, like during those years up until today. I started something called ETH Hub in 20, uh, early 2019, or late 2018, with Eric Connor. Uh, that was basically uh, an information resource, in a podcast, stuff like that, to fill the gap cuz back then there wasn't really anything for Ethereum. Like, Bankless actually came just after ETH Hub. Um, and, uh, yeah, Bankless and, and ETH Hub kind of, I guess grew during that kinda period. Tried to, to better the narratives around Ethereum, and spread the word about Ethereum, uh, back then. And then The Daily Gwei, which is what I mostly focus on now, was started in mid 2020. Um, and I've been doing that ever since. So that's basically uh, it used to be a daily kind of Ethereum podcast. I kinda slowed down a bit uh, cuz things get just, just so noisy in bull markets. So I've kinda..."
  },
  {
    "speaker": "Andy",
    "content": "Spamming."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah. So it's like every maybe like a two or three a week, if I can do it, do an episode. Um, but really the, the whole time I've also been growing my, my Twitter presence, uh, and, you know for better or worse, Twitter is like the town square of crypto and, and of Ethereum especially. And yeah, just trying to, I, I guess like my North Star, as people like to talk about, <noise> with, with what I do, is to just uh correct the misinformation and educate as much about Ethereum as I can because there's just so much bad information out there, as you guys are well aware of."
  },
  {
    "speaker": "Rob",
    "content": "I, I think we have a very similar mission."
  },
  {
    "speaker": "Rob",
    "content": "And, we uh, got our start in uh a university club. It was originally called the University uh Bitcoin Club."
  },
  {
    "speaker": "Guest",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "And, it's funny because we, we met in 2017. We were, like, that, that's kind of where we got our start there. And then, you know, quickly right afterwards 2018, 2019, there was kind of that, that bear market that hit. It was like, and, and there was a movement going on. It, it was like blockchain, not Bitcoin."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "And actually the club rebranded and went full blockchain, and we had this whole enterprise blockchain cycle where we had Walmart experimenting with blockchain on supply chain. Mhm. IBM, they, like they started sort of incorporating and kind of open their eyes to, to blockchain, but still cryptocurrency was totally a scam, and there was nothing to do with this financial world on-chain. And, and then you know, that has, has really started to shift in recent years."
  },
  {
    "speaker": "Rob",
    "content": "And so, you know, as you were kind of going through those cycles, you know, did you, did you ever lose faith? Did you ever lose, cuz those bear markets are tough, right?"
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "Was there a point where you were like, \"Man, I don't know. Like, wha,\" you know, what was sort of, what was sort of that trough, and then what kept you going through that and was like, \"No, they,\" that North Star, if you will, right? Where like the education and the, and correcting misinformation, was there something that stuck out that continued to persist, that you knew was true, but kinda the market was telling you was sort of skeptical about, that, that really kept you going through those bear markets?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I, I think that being so close to Ethereum development, especially during 2018, 2019, 2020, which were, I would say, the most formative years for Ethereum, and it's really been the path that Ethereum's been on since, you know, since then. We're still on the same path of the roll-up centric roadmap, and, and all that stuff there. Um, I would say that just the fact that, like, I could see that the building was real and real things were happening, the community was, was there and was growing. People weren't abandoning Ethereum, they were just doubling down on it. All, like, that all collectively just made me keep the faith, so to speak. And also because I actually believed in what was being built, and I believed in the potential here, and I wasn't blind to it uh, to, to, to DeFi. Like a lot of people in the crypto ecosystem where, they, they just didn't use the chain. Like it, it sounds insane but they weren't, on Ethereum they weren't using it at all, and they just heard about DeFi on Twitter or somewhere else and they're like \"Well that doesn't sound real, doesn't sound like it's going to work.\" But then I'm on there using it. I'm like trading on Uniswap. Right? I'm, I'm opening up I'm like \"Make a CDP!\" I'm like \"This is real! Like I'm doing it.\" I'm not just delusional, uh, here, being bullish on nothing. It's real. So I think that, it, when people go and use these things and, and realize that it's, it's, it's real, it actually uh provides value and it actually exists, that's when it immediately shifts for them, because you can't deny reality. Like there's the, the narratives that, that form, but then there's the reality. And, and as soon as you're exposed to the reality, I mean you can try to deny it, but it, it's very hard to at that point. Like with narratives you can always write them off and be like \"Oh, that's just a, a story people are telling, that's just the ETH maxis being bullish on something that's not real, whatever.\" And same happened with the L2s, you know, that, for a while there people were kinda fudding them, and saying that they weren't real and then they became real, and now the fuds moved on to \"Oh they're parasitic to Ethereum,\" right? <noise> It, it always just kinda moves the goalposts. Um, but for, yeah for me it, it really was that core community that all kind of believed in the mission, believed in the thing, and things were getting shipped. It wasn't just the, the app layer that was, Proof of Stake was finally happening. Like I saw all of that, and admittedly it was difficult to track this, and that's why I actually started ETH Hub and The Daily Gwei cuz it was so hard to track this stuff, and I was like \"You know what, like, uh, I get that like I'm bullish on it and I can keep track of it, but so much of it is very complex, very technical, uh, no one knows what these things mean, what these, these terms mean. So I started my show with the goal of being able to essentially break down that, that information barrier."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, and, and at a certain point it's like all you got to do is survive."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "Like, if you survive the bear market, you get, you get to times like today. Like right now, where things are very very different."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah yeah."
  },
  {
    "speaker": "Rob",
    "content": "Um, I mean, it, it's incredible. I mean, before we kinda turned on the recording, we were talking about like how the paradigm has, has shifted."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "\"Oh yeah, today ETH has the best narrative..."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah yeah yeah."
  },
  {
    "speaker": "Rob",
    "content": "...of the last six months.\""
  },
  {
    "speaker": "Guest",
    "content": "The SEC got incredibly better over the last two weeks. <noise>"
  },
  {
    "speaker": "Guest",
    "content": "Yes, yeah yeah yeah yeah yeah. Exactly. Like that, since the, the election, it's like six days now. Yeah the tech's just improved by 30%, right?"
  },
  {
    "speaker": "Rob",
    "content": "It's, it's been like a whole month since the election. It's, it's gone crazy."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah yeah. That, that's what bull markets feel like. It feels like it just goes on and on and on forever, yeah, and then it just abruptly ends. So <noise> Yeah, we can't possibly keep this pace up, right?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Like, that's, that's what it feels like. But then, and then it just continues to happen. I mean, we really have just gotten started."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "It's kind of the feeling, and I think, because we're in it, we're doing this every single day, you know, we're start, we're the ones that are kind of like in it as it's happening and, and it feels like it's taken a really long time, and it's already, it's already been going on for so long. But, I mean, we're talking this morning, just, just this morning, people are starting to hit us up, that normies, you could say, right?"
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Guest",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "Where like they're just starting to take notice."
  },
  {
    "speaker": "Guest",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "And, and I think, again, like that is just starting to happen. And so, we're, I mean, guys, where do we go from here?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah. Yeah I mean I think that uh, it's the same kind of story every cycle where, yeah cuz..."
  }
]