[
  {
    "speaker": "Rob",
    "content": "And I mean, that's gonna be"
  },
  {
    "speaker": "Guest",
    "content": "It's it's a new it actually literally is a new paradigm. I think AI got a lot of hype very quickly, because it um you know, the internet tends to be able to hype something up very quickly, cause the information is just disseminated so quickly. But the thing is is that people still don't understand that these AI agents are now have a native value kind of token that they can use. Like they don't have to use fiat. They're not blocked from anything. They can actually do everything on chain, and no one can stop them from doing it."
  },
  {
    "speaker": "Rob",
    "content": "And yeah. And traditional finance is even going into this direction as well. Like I think they just opened up market hours in the US trading hours. From was it five days to seven? No. It's like just more market hours, something something, yeah yeah yeah. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "I I I wonder how much of that was crypto impacting it."
  },
  {
    "speaker": "Guest",
    "content": "I'm I'm sure. They'll never admit that it was crypto. But it it could be it could be that. But but also, I just generally think that because the world is becoming more interconnected, more digital. Yeah. Yeah. More more digital, more 24/7. Just naturally customers demand this. They're like you know, why do I have to only trade between these hours or why can't I access my money between these hours? Give me 24/7 trading. Like obviously, from the human perspective it doesn't make much sense, because we don't operate on 24/ 24/7 right? We have to sleep for eight hours, and then we have like outside of business hours. But again going back to the AI stuff, there's no concept of that for them."
  },
  {
    "speaker": "Andy",
    "content": "There's no business hours. Truth terminal is tweeting horny jokes every hour of the day."
  },
  {
    "speaker": "Guest",
    "content": "Exactly! 24/7. They work 24/7. But they just shit posting everyday all day long. Exactly. Which is why they're way more bullish cult leaders than like I don't know, Mirad, or like whoever right, or like Justin Sun, or Vitalik like these AI's can simply outperform you. Because they don't have a brain, they don't have a clock."
  },
  {
    "speaker": "Guest",
    "content": "Yeah exactly. Exactly. It's the same with but an and this is this is something that I don't think should be surprising to people considering that we've automated a lot of the world already using machines. They don't have to sleep, don't have to eat, you don't have to pay them, right? They have none of the drawbacks of a of a human worker so to speak or a human in general. Uh and that's the same is gonna be true with these AI bots. They're gonna rule the they're gonna rule the chains. There's no way humans can compete."
  },
  {
    "speaker": "Rob",
    "content": "This world is wild. We just have a few minutes, and I know that we could probably go for hours on the AI, but I'd like to ask you about the Pectra upgrade for Ethereum Max, just to kind of kind of wrap us up. What's the what's the TLDR for our community? Uh are you for it? Against it? What's been the community sentiment, and what do you think are the implications?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, so definitely for it. I I think hopefully it'll get delivered by March of next year, so not too far away now. Maybe push into April, just depends on test nets, cause they're at the test net phase now. If everything goes smoothly with the test nets, I I suspect March as a main net date for it. Uh it's got a few different upgrades in it. Nothing that I would consider to be like, strongly user facing, besides maybe some account abstraction stuff. Like, it was hard to follow along because they included account abstraction EIP then they removed it and replaced it with another one, and then I haven't checked the latest on it yet. But uh I I think there is something in there for account abstraction which affects the end users interface there. But the one that I'm most excited for, the EIP I'm most excited for is called Max EB, which essentially increases the maximum amount of ETH you can put on a validator. Right now it's 32 ETH per validator, both minimum and maximum. So if you have 320 ETH, you have to spin up 10 individual validators. Uh whereas in the in in the Max EB world, you can have up to a maximum of 248 ETH, I believe unless that was changed on one validator. On one validator. So the thing is is you still have the same uh uh economic security. You still have the same node operator. It's just that now, instead of having to split it up into 10 validators, you can do it on like one, right? And the reason why this is good, is because it lowers the bandwidth requirements and bandwidth usage of the whole network, which means that we can add more blobs."
  },
  {
    "speaker": "Rob",
    "content": "So it's funny how like you can get from that staking change to an L2 upgrade essentially. But that's that's how generally it's gonna work, and you just take load off the network, seriously."
  },
  {
    "speaker": "Andy",
    "content": "Why does that work, sorry?"
  },
  {
    "speaker": "Guest",
    "content": "Because because right now we have like a million plus validators on the network. But we we've got like what, 10 15,000 node operators? Because as one node operator you can operate many different validators. So it doesn't add any more security having a million uh validators, it the security comes from the node operators. So if me as an individual is running a hundred validators, I'm one person, right? So that me having one or a hundred validators it's the same thing from a a node operator perspective. From an economic security perspective, it's a bit different. But but yeah."
  },
  {
    "speaker": "Rob",
    "content": "Can I ask you a question? Is that is that because uh we have to gossip the transactions amongst all of the validators?"
  },
  {
    "speaker": "Guest",
    "content": "We're gonna get to that, yeah. Like that that having more validators means more uh gossip on the network, which means more bandwidth usage, which means more overhead on the network, which means that we can't scale up blobs more because blobs add a lot of bandwidth Blobs."
  },
  {
    "speaker": "Andy",
    "content": "usage to the network."
  },
  {
    "speaker": "Guest",
    "content": "usage to the network. So we're essentially swapping that out. We're saying okay we're gonna take what you guys are using on the validator side, um and then we're gonna collapse that down, and then we're gonna give it to the blobs. But there's also other bandwidth work being done of course, but that's a huge thing. And and I I I also think that it's good for for stakers generally, like solo stakers as well. Because now they can compound their stake. Because in this current world you have to wait until you have 32 ETH again to spin up another validator. But in the Max EB world, you essentially get to compound your rewards ins not instantly, but like whenever you get them, you can put them back on your validator, and start earning rewards on them. No need to wait to get another 32 ETH, which is a lot of money you know. So uh it's it's better for solo stakers uh and and it's better efficiency for staking overall."
  },
  {
    "speaker": "Rob",
    "content": "Yep."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And an anything else in the upgrade to be mentioned?"
  },
  {
    "speaker": "Guest",
    "content": "I mean, as I said, I think there's that account abstraction EIP that was I I I can't remember if it was included in Pectra or pushed out to the next upgrade because there was a bit of discussion around this. Uh and a few other things that um as I said, aren't directly user facing. I believe there's one that allows you to exit a validator from the execution layer, which essentially means that you can send a normal ethereum transaction on the normal kind of um uh where you do normal transactions uh and essentially do uh exit a validator. So uh with uh withdraw the stake but also shut down that validator. Yeah. Right now, you can only do it from the consensus layer side, which means that the staking protocols that exist today aren't fully trustless, because you have to basically go to them and say, \"Hey, I wanna exit this validator,\" and they have to go to the the validator operator and say exit it. In the future with this upgrade that's coming, uh you won't have to do that. You can just send the exit message on the normal user facing side. Yeah, and then you have a fully trustless staking protocol, which is cool. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Awesome man. Thank you so much for uh joining us today. I hope you have a great week in Bangkok. Um, try to s you know it's a marathon, it's not a sprint. So"
  },
  {
    "speaker": "Guest",
    "content": "Yeah. Yeah, o exactly yeah. Yeah. Thanks for having me on. It's been a great discussion."
  },
  {
    "speaker": "Rob",
    "content": "I got one more question for you."
  },
  {
    "speaker": "Guest",
    "content": "Oh yeah yeah. For sure."
  },
  {
    "speaker": "Rob",
    "content": "Could you could you show the camera your tattoo that you got there?"
  },
  {
    "speaker": "Guest",
    "content": "Oh yeah, sure, yeah. I don't know how many people know where this is from. But"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, way up. First tell us where where this is from."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, so it's from an anime called Hunter X Hunter. Um yeah, it's a very popular anime. Uh it's uh it's a very like this scene, I'm not to spoil it too much for people, but like the this like this scene, I guess in the anime is like the combination of the whole story essentially, uh and it just it means a lot to me like personally. But if I say why it means a lot to me, I'm gonna spoil it for people, and I don't wanna spoil it."
  },
  {
    "speaker": "Rob",
    "content": "Okay."
  },
  {
    "speaker": "Andy",
    "content": "It's an intense look that guy has on his face. So like definitely definitely looks captivating. Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Yeah yeah yeah."
  },
  {
    "speaker": "Andy",
    "content": "But my my question was uh around the next tattoo."
  },
  {
    "speaker": "Guest",
    "content": "Oh yes yes. So I said on my my podcast recently that uh for a long time now I've wanted to get like an ETH tattoo on the other arm, like here. Yeah. And I would only do it when ETH got to 10K. Uh so yeah yeah yeah. And that's since like I I've been saying ETH is gonna go to 10K since 2019. So it's been a long time coming. But once ETH hits 10K uh you know, I wanna get the design done maybe before then, but I kinda have an idea of what design I want. Okay. Uh but yeah, I wanna get that here because Ethereum changed my life in so many ways, and it's not just about like ETH getting to 10K. But I think, obviously like ETH getting to 10K means that Ethereum has succeeded in such a large way and has kept building, kept improving, kept growing. Uh and I yeah, I just wanted to to get that. But that's the only I think crypto tattoo I'll get. I'm not gonna get like the Terra Luna thing like"
  },
  {
    "speaker": "Andy",
    "content": "Oh god. Or I think never again. Yeah yeah yeah."
  },
  {
    "speaker": "Guest",
    "content": "I'm gonna regret getting yeah."
  },
  {
    "speaker": "Rob",
    "content": "I think you'll be safe with ETH. Exactly, yeah yeah. Let's uh let's run this back with that new tattoo."
  },
  {
    "speaker": "Guest",
    "content": "Yeah exactly yeah yeah. Yeah yeah yeah. We'll have our next pod at 10K. Shouldn't be too long. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah. Definitely, yeah. Yeah exactly. Next week or something, yeah?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Thanks Anthony."
  },
  {
    "speaker": "Rob",
    "content": "Cheers guys."
  },
  {
    "speaker": "Guest",
    "content": "Cheers guys. Peace."
  }
]