[
  {
    "speaker": "Guest",
    "content": "We're in it every day and we're paying attention to it. It may feel like everyone's in it because it's our little bubble. And then you just forget that most people don't even hear of crypto until it's at all-time highs. And I was actually speaking to one of the ETF issuers recently and I was saying, you know, what's got How's it going with the ETF, you know? How are you going to talk into Tradify people about it? And they're like, honestly, most people haven't even heard of Ethereum."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest",
    "content": "And that's insane! To me hearing that I'm like are you kidding me? Ethereum is obviously not, you know, as big as Bitcoin. It's second, it's not first. But the thing is is that Ethereum has been around for so long. It's been talked about in mainstream media and everything. But then I I kind of sat there and I thought about it for a bit and I'm like, you know what? When you actually look at the mainstream media they only really mention Bitcoin most of the time, right? Bitcoin is this thing that our, like, Trump for example on, only mentioned Bitcoin in crypto. He doesn't say Bitcoin and Ethereum."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. They never mention Ethereum."
  },
  {
    "speaker": "Guest",
    "content": "Right! So it's because it's like it's that thing of you just mention one or like the broader broader class. Um, it it's the same with everything I think, but that was insane to me. And then when I when I when I sat down and thought about I was like that's actually incredibly bullish because it means that there's still so many people that need to learn about Ethereum and then, you know, possibly buy ETH and invest in ETH as well. So, we may feel like we're so late now because these assets are so big and everything feels like it's going crazy. But I mean, we're so early, it's not a meme. There's still so many people to come in."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Right. Right."
  },
  {
    "speaker": "Andy",
    "content": "Okay, so on that point then, on our podcast with Arthur Hayes and Mihailo Bjelic a couple days ago, Mihailo Bjelic basically put out the idea that in order for ETH to get to $20,000 or $30,000, the only way in his thesis, right? Which is that, is that it's valued basically as a store of value. It it has to have this monetary premium to reach this, you know, $600 billion trillion dollar mark eventually. Uh, and basically it can't be it can't be viewed as like this tech asset, like this, um, kind of like computer, right? And so Bitcoin's obviously got that first kind of like meme. Like, it's like it's got the memetic property of being Bitcoin and so it thus, you know, it's trading over $1 trillion today. Could be worth multiple trillions even, I mean, $10 trillion in the future. Uh, do do you see Ethereum's path to $20,000 or $30,000 per ETH as a similar narrative? And I mean we can kind of get into this North Star, where Bitcoin's got this digital gold. Solana's got trading as fast as Nasdaq at the speed of light. Ethereum's kind of trying to figure it out. Like is, what's the path to Ethereum at $30,000?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah. I mean, I totally agree with that and it's something that I've been talking about for a very long time now, since the last, I mean, the previous bear market, so like, 2019. Um, because it's obvious that Bitcoin is not valued based on its revenue at all. Right? Like, it does barely any fees compared to its market cap. I think it's like $1-$2 million fees a day, and it's market cap is $1.5 trillion. So, if you do like a price to earnings kind of thing on that, or do any fundamental analysis on that, BTC would not be worth anywhere near that, and that's that's obvious to everyone at this point that it is a store value. It is a money. Um, the same is true for ETH as well. Like, ETH has higher fees, but not enough to justify a $350 billion market cap, right? So, you you naturally come to the conclusion that these things have a monetary premium. They act like a store value and there are many people who will tell you that they use it as a store value. Like, I buy ETH to store my value. Like, I'm not buying ETH based on how much fee revenue it's doing. I've never done that, right? Not to say that fee revenue is unimportant, that we shouldn't keep increasing those, so that when you stake your ETH you get you know you get the revenues from that, um, and it's better and more people want to stake their ETH and so on and so forth. But yeah, for ETH to get to 20-30k, like, and if you're talking about just from a market cap perspective, that's trillions of dollars in market cap, it needs to be a store value. And money, it needs to keep increasing that monetary premium. And I I really think that that comes down to a, the story that you tell about it, the the story that you tell about ETH as an asset and Ethereum as a network. Yeah. And I know that Ethereum doesn't have like a fancy one-liner, and I actually think that that's a positive thing over the long term because Ethereum shouldn't just be boxed into something. Like, Bitcoin being digital gold is fine, but like, then there's a ceiling on it, your ceiling is basically gold, right? Um, and and Solana being decentralized Nasdaq, I mean, it's already worth more than Nasdaq, like, in terms of market cap. And also, you're boxing yourself into like, one kind of use case really. And the thing is is that these narratives are a guess a social consensus and they change over time as well. These North Stars change. Because even in Solana, for example, they, you know, they say they want to be decentralized Nasdaq, but then there's other people saying that they want it to be something else. They want to do something else with it. And and that just happens as the community grows. And I think that Bitcoin also evolved over time. Originally, it was peer to peer money, right? And now it's digital gold, but there's still a faction within Bitcoin that wants it to be peer to peer money and they're trying to build like these new Bitcoin L2s that are better than the Lightning Network in order to scale Bitcoin payments. But the the problem becomes is that, well, Bitcoin has just spent the last 10 years convincing everyone that BTC is not to be used for payments, it is a store of value."
  },
  {
    "speaker": "Andy",
    "content": "Correct. Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Whereas in Ethereum, ETH can be a store of value, but we also have stable coins on the network, right? Well, that that could be your like, your money. Right. And when we say ETH is money, that's a that's a meme within the ecosystem. We're talking about ETH as a commodity money. Not not as a fiat money. People think that fiat is the only form of money. You're not going to use ETH to buy your coffee or that sort of much."
  },
  {
    "speaker": "Andy",
    "content": "No, no, exactly. And and that's that's that's totally fine. Um, and and I think that, you know, stable coins are great and everything. Obviously, have their drawbacks. They're centralized. They're still pegged to US dollars or euro. Um, and maybe we get better stable coins in the future that aren't pegged to those sorts of things. But yeah, I I think people just get it wrong when they think, \"Oh, ETH is money,\" it's not, it's not like US dollar. Like, yeah, it's not, it's not. It's a commodity money. It's a store value. Um, but yeah, I fully agree with that and and I think that even to, um, other things that Mihailo Bjelic and other people have said about like, uh, cults forming around these things. Really, like these these coins get a lot of value from the cult energy. And I think, you know, Bitcoin is a perfect example of that. Like, there's a very strong cult around Bitcoin, and that's where they're getting a lot of their value from. Um, but I think that that that a a strong cult forming around an asset is very, very rare. There's not that many assets that have strong, like strong, lasting cults, like, talking about ones that last like 10 plus years, like, decades. It's really, I think, only Bitcoin and Ethereum so far. You know, maybe Solana gets there, but it hasn't been around long enough yet. All of the meme coins that you see right now besides maybe DogeCoin have not been around long enough. So, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. So, think about the the GameStop era of 2020, was maybe the only other time or asset that we saw people rally around. So I think it is a relatively recent phenomenon that people are forming these these mind hubs around different financial assets. And I think that's a a sign of of the times. Like it it used to be like, you know, there we didn't have access to finance like we have access to finance now, and and investing, and and personal, uh, like self-deployed finance and peer-to-peer finance was not possible or, you know, really not practical like, like, pre Bitcoin. With the first peer-to-peer network. And then things got kinda hyper-financialized, and then we kind of got that era where we had more community-driven finance, and the whole IC era, ICO era was part of that as well. And so like this I think, we really can't point to any historical examples of how cults have formed around money, unt- like until like even in recent eras. Maybe there's some, like, national currencies that people rallied around, we can kinda like draw some examples from the past there. But I I really think we're in like this new paradigm where the people are realizing that they have more of an impact on the financial ecosystem than they've ever had in the past, and that is going to have some some long lasting consequences and domino effects into the future. I don't know what the possibilities are are, I don't know what results from that, I think, I mean, we could speculate, but essentially, like, I mean, I I would say that maybe like GameStop, Tesla, we have some of these other ones in the traditional financial ecosystem, but crypto has really taken that as it's, as a stronghold and and ran with it."
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Rob",
    "content": "What do you got, what do you think are the the the consequences of of more community, more localized finances, rather than like one global finance, but more localized sort of economies?"
  },
  {
    "speaker": "Guest",
    "content": "Mhm."
  },
  {
    "speaker": "Guest",
    "content": "It's it's difficult to tell because, as you said, it is something relatively, I guess, new, because you could say that there's not really like a cult around fiat currencies. Maybe the US dollar as like a reserve currency and as like a way for um uh, you know, America to assert its dominance on other nations. But you've never really seen like a similar thing. Like, no one's worshipping the US dollar as like a store of value or anything. Because..."
  },
  {
    "speaker": "Rob",
    "content": "There is gold bugs."
  },
  {
    "speaker": "Guest",
    "content": "Well, that I was gonna mention gold gold bugs is the closest thing. Yeah, they they there's definitely a gold cult, right? Um, but a lot of, I think a lot of gold bugs got converted into to Bitcoin, definitely. Um, yeah, yeah. Yeah. But there's still a lot of gold bugs. And gold has been doing well. Like, it's not like it's gone down or anything. It's actually gone Yeah, it's gone crazy and I think Bitcoin has liked that as well, because it means that the the target or the ceiling for Bitcoin goes up, too, right? They're targeting like a $15 trillion gold market cap. If that goes up to 20, 25, 30 trillion, then Bitcoin can also kind of go there as well. So and and I think, yeah, gold is is definitely um, much more of a community driven, like, people driven thing than than anything else. Because yeah, if you're like, born in a in a country, they force you to use their fiat currency to pay for taxes and and for services in that country. But now with a globally kind of proper global decentralized financial ecosystem where the cost to issue an asset is basically zero, yeah, the people are the ones in control now. Like, no one's telling the people like, \"You need to go uh uh, value this one. Like, you need to pay your taxes in this one, or you need to, you need to do commerce in this one.\" No. Everyone the community just coalesces around that, and I think that's what uh uh uh, a strong reason why I believe is like ETH is this commodity money within the Ethereum ecosystem and beyond is that people have just naturally chosen ETH at that. Like, no one forced ETH upon them. It you know a lot of the core devs actively early on told people that ETH was just to be used for gas. It wasn't actually to be used for anything else. And there is an argument to be made that because you have to use it as uh, as a the fee token that it kind of forces people into using it, but the thing is is that like, people only have to hold what they need for gas in that world, they don't have to hold ETH as a money, as a store of value, but they've chosen to. And ETH now has the cult energy around it just like BTC has and just like a few other assets have, but yeah, I don't know what the long-term consequences are here. I think that nation states like a  a P..."
  }
]