[
  {
    "speaker": "Andy",
    "content": "Down the road, you know, Superchain comes out with their native interop experience. Would that break my connection to these other zones, Solana? So, I can, I can maintain the connectivity to these other enemy zones if you will, through Hyperlane. And then I can also, within my zone, I can have my native experience."
  },
  {
    "speaker": "Rob",
    "content": "No. No. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yes. The, the only two things you'll need to do is first, within your zone, basically say, 'Hey, we were all pointing at that contract that was like the original Superlane zone, and now we're going to point at this other module contract that represents the like Superchain native.' And then as the, uh, app that accepts it, like in any of the other zones, you need to say, 'Oh, wait. So, we were all cool with accepting the first module. We're now doing the same thing. We're pointing from here to here.' So those two actions, and everything else stays the same. So there has to be some type of like informed consent of like, 'Wait, they just switched something. I want to make sure that like I don't, uh, just like fall victim to, uh, their choice without any consent on my side. But you do those two steps? Good to go."
  },
  {
    "speaker": "Andy",
    "content": "Awesome. And so that would occur on the, on the Solana, the ZK Sync, Arbitrum side? They would have to basically thumbs up this new, uh, rece-, uh, receiver? The thing that they're receiving is now coming from the Superchain native rather than the Superlane."
  },
  {
    "speaker": "Rob",
    "content": "Yep."
  },
  {
    "speaker": "Rob",
    "content": "Exactly right. Exactly right."
  },
  {
    "speaker": "Andy",
    "content": "Got it."
  },
  {
    "speaker": "Rob",
    "content": "And so, you know, so far we talked about using Hyperlane for an ecosystem like Superchain, but, you know, what if you're an app builder? Can you get something like this as well? And yes. Yes, you can. So, uh, excuse me, I'm getting a little, uh, little burbs here. Uh, you're an asset issuer. You know, your product is a token of some sort, maybe stablecoin, LST, LRT. Again, should you put all legs, uh, all of your eggs in the basket of like some third party provider? Depending on where you're at, maybe, maybe not. Now, if you don't want to, here's how you can get around it. With Hyperlane you have the choice to place yourself on a spectrum of how involved do you want to be in the security of your bridging. All the way from zero to 100%. In the zero case, basically, what you're doing, you're just running on the existing modules. They're there, anyone can leverage them. You don't need to like ask someone, 'Hey, can I do that?' The- they're already running it, you go ahead, you do it. There's no harm in that. Totally fine. You know, dozens of teams are doing that today. On the other end of the spectrum, you want to be 100%. You know, meaning you want to completely insulate your product from any trust in the third party. Well, you can do that too. Maybe you want to be in the middle, right? Benefiting from some of the existing ones, and bolstering them with your own. Right, still requiring your own sign-off. And you can do that too. And I got a, an example I think it's a pretty great, uh, story for it. So, I picked here one of my favorite case studies of this design, of that like in the middle design, uh, that's in production. And that is Renzo. Uh, specifically, Renzo's Easy ETH, and, uh, more recently, Peasy ETH use this in production. Right, these are some of Renzo's most prominent assets, hundreds of millions, uh, deposited in them. And they run atop Hyperlane rails. And because these are so consequential, right, like the size is large, Renzo security setup is such that they augment the existing modules, with a Renzo specific module, uh, one that then and their operators are a part of. So when you're like, if you go on like, renzo.superbridge.app or like renzo.hyperlane.xyz, uh, those are like front-ends to move around, uh, Easy ETH and Peasy ETH. That transfer is validated by, uh, the Renzo module, or else it just cannot occur. It cannot occur. Right? And, um, you know, in the last 30 days alone, about, uh, well, a little over a billion dollars was transferred through this setup. And probably my favorite thing about it, is that once the setup is there, well, like a lot of, uh, companies that their business is this form of asset insurance, well, once the setup is there, it can be reused for any other asset, uh, without any additional work. So, take the case of Renzo. They start with Easy ETH, uh, right, like the EigenLayer asset. Later on, they add Peasy ETH, which uses, uh, different network, Symbiotic. Well, they can reuse the setup for it, just by saying, 'Okay, well like, the modules are there, just use those.' Done. Just part of the initial configuration. So, all the moving parts are already there. Or, everything is live and operating, you just go ahead and use it. And so to me, the moral of the story is if you're someone who wants this, you can use Hyperlane to really easily achieve this, and do it significantly more easily, than if you were going to start from scratch. Like I can't tell you how many times in the last four months we've run into teams that are like, 'Are you fucking serious? We just spent like six weeks of our top engineer's time trying to build like a rate-limiting system, a like extra-monitoring system, on top of like the bridging we have from provider xyz. And you're saying, this is, this was there, and you get like a, uh, both slightly exasperated like, 'Ah I wish I know about this earlier.' And a-, well at least I see the light in the end of the tunnel 'cause we spend this six weeks and I don't know when the fuck that was going to end. Uh, and now, like we can basically get this done in a few days. Uh, it's, it's a pretty great thing to, to witness. And so, that's, all that's already there. Right? I mean, there's obviously a whole lot more that's already there but like, you know, uh, I've already taken up enough of these good people's time. So we're going to get to, um, the-, you know, the stuff that's coming. You know, I would say, saving the best for last really, this is what's coming to the, um, open framework to radically improve the experience of using it. So, at a high level, what's coming in the medium term, to short term, think, you know, over the next, uh, six, seven months. Handful of things, and they're all very related. First, economic security. Right, like putting real money on the line behind these validator attestations. Right? More interestingly, this could be even used as a form of insurance. Right? Say or like, you know, uh, it's time to make that big transfer. You got, you got 100k, you got to move it around and you're like scared to death. You're like, 'I heard bridging is, is dangerous.' In this, uh, what's coming kind of world, it's not just that the validators who are securing your transfer, are putting money on the line. That money can even be used to make up any whole that will be done as a result of like a failure on the part of, of a validator. And this economic security can come in the form of many assets. Right? Such like, if you're the app builder, you're the ecosystem, you could leverage your own token for this purpose. Um, the next thing is, and this is what we're going to talk about before we finish up here, is a security provider marketplace. Right? So that the next Renzo, the next interop zone, right, like the next Superlane, will have a much easier time galvanizing the, um, that provision of security for their zone. Right, like gathering, wrangling up those, uh, operators that I told you about when we were just starting. Right? Whether it's an app, whether it's an ecosystem, doesn't matter. Just want to make it easier for them to tap into something like this. And of course, all of this is going to be powered, uh, in part by restaking networks like EigenLayer. Right? They play a material, material part in doing this. And how is this going to materialize in practice? Like how would you actually build a security marketplace like this? And of course, it all starts with an available pool of capital to use, to provide that economic security. That's why I got this, uh, beautiful fountain here. Thank you, uh, Miyazaki, and thank you Google Gemini for the help. I asked Google Gemini to generate a, uh, Miyazaki-styled beautiful fountain in the middle of a town square, and I'm sorry Miyazaki, I know you don't like AI but, you know, you're stuck in Japan, nothing you could do about it. Uh, so we start with the AVS, and the AVS acts as a shelling point, a shelling point that draws operators and capital to it, which you know, uh, metaphorically creates this fountain. So, now you're the next person looking to create one of these, uh, interop zones. Whether it's for your app like in the Renzo style, it's for your ecosystem like in the, uh, Superlane style. You approach the fountain, and you describe what you need. It's kind of like a wishing well, uh, except a lot more practical, and one that actually comes true every single time. You come to the well, you come to the fountain, you say, 'I need $150 million to secure communications between chains A, B, and C.' Now in practice, what is this going to look like? It's going to look like a unified interface to express that, uh, that ask. So I'm-."
  }
]