[
  {
    "speaker": "Rob",
    "content": "GM, G Eigen, G Hyperlane, and G modular. What’s up, John? Welcome back. You’re no stranger to the show."
  },
  {
    "speaker": "Jon",
    "content": "Yeah, here."
  },
  {
    "speaker": "Rob",
    "content": "knows you here, and uh yeah, man, you guys have had a bunch of like really exciting developments coming out of the out of the woodwork here, and uh one of the modular teams that are shipping day in and day out. So kudos on all the latest shipments, and uh very excited to dig into uh some of those that are uh most recent and most exciting. Um and again, thank you for coming on the show again. It’s always a pleasure."
  },
  {
    "speaker": "Jon",
    "content": "Of course. No, always always happy to be here. I think we’re going to have, uh you know, a fun time today. What I’ll say before we get started is um you know, I'm going to be a little bit more loose, less sharp, and less crisp, then uh you know, maybe folks on the show are used to. Think of it like uh I’m a big big fan of standup and, you know, like the best comedians when they go on their tour, that uh first few stops, they’re like testing out the new material, they’re seeing what hits, what works. Going to be a little bit like that today.  Uh So we're going to get to it. And before we dive in, I'm going to give you an overview of what we’re going to be talking about today. We’re going to keep it simple."
  },
  {
    "speaker": "Rob",
    "content": "And so to start, we’re going to touch briefly on what’s already been built and what you can do with what’s already been built. Then we’re going to talk about why it matters. Now, if this was a pitch deck, right, if we were, like, uh you know, a venture to to to team trying out there to to to raise a venture money, this would be in like the problem section. Now, I know most people like to open with their problem section, and you know, that’s cool. Not one of those people. I like to open by telling you what is the thing that’s happening here as a brief introduction, and then build the foundation uh  of what the problem is, and then go back to how that problem is being addressed in more depth.  Once we cover the problem, we’re going to get into what’s coming next, how it relates to those problems specifically, and how it builds on what already is there. And most importantly, what you’re going to be able to do with it.  So it’s on now. So today, we’re going to be talking about an open framework for interoperability. Like, what does that even mean, right? Well, there’s numerous ways today to go about interoperability, about connecting chains. But there aren’t many ways to do it with an open framework. In fact, I’d say that there are really two open frameworks for interoperability. The first being IBC, and the second being Hyperlane, and guess what? Today, we’re going to be talking about Hyperlane.  So earlier, I told you, we’re going to start by talking about what’s already been built.  So uh as a brief uh on Hyperlane and what exists today, to really better understand everything I’m going to be telling you today, let me also give you some insight into how we view the world. Really, think of this is like this is our point of view.  So before we ever started building Hyperlane, before we even started thinking about what it will eventually become Hyperlane. We, you know, my co-founder and I, really believed firmly that if crypto was going to scale, if it was going to serve an internet scale of demand through blockchains, we’re going to need to horizontally scale. Right, like the internet doesn’t run on one gigantic server that’s like underground somewhere despite there’s like a great South Park episode where everything is basically in an underground server somewhere.  Well, then it, in reality, it’s not built like that. It’s like an ungodly large number of servers distributed all over the world.  And our view is that blockchains will scale um horizontally in a similar way. Now the audience may know this as the modular thesis, right? Ethereum's roll-up roadmap, call it whatever you want.  But we believed firmly that this is the way that things are going to pan out. As far back as 3-4 years ago. And this high-conviction view that there has to be an increasingly large number of chains. That view is the basis for every decision we’ve been making in building Hyperlane.  Right? So a world with an increasingly large number of chains, with an accelerating number of chains, must have a permissionless and scalable form of interoperability to connect those chains, to make sense of all those chains. We got to have a way for anyone to connect any chain, and certainly to do that, you need an open-source framework, and that’s why we built and build Hyperlane as the open framework for interoperability.  So, going to move to the next slide. Uh Oh, I just told you: letting anyone connect any chain. Well, it sounds kind of simple, but it’s obviously much harder than it looks, but today, anyone who’s watching us right now, anyone, can go to the Hyperlane docs. They can download the CLI, and they can get started deploying Hyperlane to any chain, and then get that chain connected with any other that already has Hyperlane, right? So like let’s if the roll-up decides to launch its own roll-up today, you can do this with Hyperlane. But I would say that this really it’s just kind of the tip of the iceberg. You know, if you take a step take it a step further, you get what I like to call an interop an interop zone, or you know, maybe a trade alliance. Like bear with me on this for a little bit because we haven’t settled on naming here, so it’s all a work on progress. This is part of that, like, material testing element.  But once you develop that capability, of letting anyone connect any chain. The really cool thing you can do with it is not just these you know, these one-off connections. It’s much more than that. It’s this it’s this idea of a sort of interop zone. You know, you keep hearing about all these ecosystems, and you know, they’re like we’re all going to have our own native form of interoperability, right? But I would say outside of Polygon, I don’t know if anyone that’s actually delivered uh on this so far, right? It’s you know, it’s true that they all say it, and that’s amazing, and we know that uh these people are hard at work at it, but nothing’s there yet. Well, today, already today, with Hyperlane, this can be done for any ecosystem, and in just a second, we’re going to talk about one of the first cases of this happening.  So you know if you’re listening to this and you’re at one of these places. I would say don’t spend all the bandwidth, all the resources spinning your wheels here, just use Hyperlane.  And so Superlane, you may have seen this come out uh in the past week. Superlane's a collaboration between Velodrome which, uh for those who happen to be unfamiliar, one of the largest dApps in the the optimism ecosystem, and certainly one of the largest dex’s.  So this is the first such interop zone.  And we’re going to dive much deeper into this specifically, in just a few minutes, uh and really everything else that I’ve said, but uh this should be moving into production in the next few weeks, and this is an effort that was really spearheaded by the Velodrome team. In fact, they did so much of it already before even bringing it up to us, and they were only able to do that because Hyperlane is, as I’ve been saying, right, an open framework. Like, I really can’t think of any other uh  tool in the interoperability landscape that would allow them to do this, and with Hyperlane, they’re able able to go kind of from zero to 100 really so quickly, you know? They’ve only been working with Hyperlane for, like, a couple of months. So it’s kind of bonkers to even think about it.  But the brief answer on what is it? It’s a distinct security zone with the distinct validators that can and will serve any and all interested members um of the Superchain Alliance. And in my view, it’s going to be something that is a precursor to the Superchain native form of interoperability. So earlier, I told you, I like to lay out what the thing is in a simple way, and then get into the problem and kind of explain why it matters. So we’re going to do that.  So why does it matter, you know? If you look at this very compelling uh stock photo here, that I found of a man pondering, that was the the search that I had, so he must be pondering as well, like, what’s going on. So let me tell you why it matters.  So beyond the obvious that we covered earlier when I was talking about the uh point of view that we have here, the point of view that informs everything we do, it’s pretty clear now to any uh astute observer that the industry is moving at a breakneck pace, and not only is the number of chains uh increasing, the number of chain architectures uh that are being used that are being adapted, that’s also increasing. Right, just in the roll-up space, right? Go back 18 months, go back 24 months, you know, two years, you really you had only OP stack uh to begin with, and then quickly, right? Like this OP stack that was really just like an EVM extension. Now you got uh just within EVM roll-ups like"
  }
]