[
  {
    "speaker": "Rob",
    "content": "Is being a command in something like the Hyperlane CLI at first. Eventually like a distinct you know UI you enter the amounts, you enter the assets that you want the chains, the size of the set that you're looking to drop on, and of course, right, ‘cause you gotta you gotta throw a coin into the wishing well, right, doesn't do it for free. You gotta tell it, what are you willing to offer for it? So now, as we said before, there's a shelling point. So all the operators will gather around that fountain, all of the ones who are part of that Avs. They receive that requests in a programmatic fashion. Think like getting a notification. They get all the relevant info, the size, the chains, the assets, the type of the ask, and of course what they’ll get, uh for doing that. And then it’s their choice, to say do I want to fill this request, right? There's lots uh, of operators. I want to say it's over 80 might even be close to 100 uh, that are related to the Hyperlane ABS today. And so you don’t need 80 of them to fill the request? No, you're probably not gonna get 80. But, can you get nine? Sure. Whatever, you get nine. Then once they fill it, you need a way to programmatically let the system know that they are alive, that they are operational, that they are fulfilling their requests. And so in Hyperlane parlors today uh, it's called like the validator announced, so you announce to the system that you're there. That system is then made aware of it, those will be added to the ISM, and then the thing goes live request filled. Now at first, this starts with economic security and validators, but I think you can really see how this moves forward towards different forms of security that are instantiated and are made real as Hyperlane security modules that then any builder who is using Hyperlane can easily use for their needs, right? Like as we get more of those like bulletproof ZK magic things. Well uh, you can, you know, come to this, uh, security marketplace and you can say, “Hey, this is what I’m willing to put on this side. I can provide this service here. Who wants it?” Then you come back, the person comes back to the wishing well like, “I wish, I would love to have ZK magic.” And you throw the coin in, and there you go, and you're done. And, you know, Robbie, that's all I got for you today. Uh, I've already taken even longer than I was planning to."
  },
  {
    "speaker": "Andy",
    "content": "Oh, this is phenomenal. I love, your presentations are great. Sometimes you’re you're rapping or we’re we're actually J. Cole other times we’re we're going going through and wishing wishing wishing for different forms of economic security from the the security marketplace wishing well. Yeah, well you know. Always a pleasure."
  },
  {
    "speaker": "Rob",
    "content": "It's always fun. I, I mean like um, someone was like, “Oh do you want to, do you want to go on and do this thing?” And I was like, “If I have the time, I, god damn, of course I want to do this thing.” I like, this is fun. I have fun doing this, so I’m certainly sorry, you know, like I’m sure you've had people who come on as part of this series who are much more uh, maybe formal, maybe um, you know, more direct and if, I like to have fun. That's, that's what it's all about. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And uh, I mean, we we went all the way from a cozy and charming uh, security module, all the way up to a fully economically secured one with potential ZK magic, so. We went we went all all the way here."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. We try. Cool. J. Cole, you're the man. Thank you so much. An absolute pleasure, my friend. Anytime."
  }
]