[
  {
    "speaker": "Rob",
    "content": "Full distinct stacks. You got OP, you got Arbitrum, you got ZK Sync, you got Polygon, CDK and I'm sure that I'm even missing some."
  },
  {
    "speaker": "Rob",
    "content": "Right?"
  },
  {
    "speaker": "Rob",
    "content": "Add onto that you're also seeing an increased amount of SVM based roll ups right, like Hyperlane just launched with Eclipse the, uh, I want to say, ready the first, uh, SVM based roll up. And what I can tell you is that what we see from the folks we work with that there is now even divergence in the architectures in SVM, just as we saw within the EVM."
  },
  {
    "speaker": "Rob",
    "content": "Right? Like"
  },
  {
    "speaker": "Rob",
    "content": "This is happening there too, and we haven't even gotten to, right the, the fact that beyond that, you have other VM's like Move, like Telegram, Cosmos, Near. That list goes on, and I think of course you're going to see VM di-, uh, you know like, stack divergence, architectural divergence there. And you know, like a great example of this is, I'm sure over the course of the show you've talked about things like Move, like Aptos, uh."
  },
  {
    "speaker": "Rob",
    "content": "And now imagine having to manage all that complexity just because you want to access like, more than a handful of chain. Like come on now, right? That's just,"
  },
  {
    "speaker": "Rob",
    "content": "not manageable."
  },
  {
    "speaker": "Rob",
    "content": "But, there's more, right? And the current day, even the interoperability you do have, between these roll ups, it's, it's pretty sparse. Like, it's so often that we talk to folks, who you would really think, like, have this all covered, have this all figured out,"
  },
  {
    "speaker": "Rob",
    "content": "and they're like, 'Shit man', like, 'No', we, we have no easy way to connect between our chain and this like, big other chain that you've definitely heard of.' And I'm like, "
  },
  {
    "speaker": "Rob",
    "content": "'No. No way.' And they're like, 'No way.' Yeah, for sure. It's,"
  },
  {
    "speaker": "Rob",
    "content": "It, it is, um, somewhat confounding that it's still the case in, you know, the year of our lord 2024, soon to be 2025, but"
  },
  {
    "speaker": "Rob",
    "content": "it seems to be true."
  },
  {
    "speaker": "Rob",
    "content": "And there's even more. The last two things I'd say here in terms of why this matters,"
  },
  {
    "speaker": "Rob",
    "content": "why the problem that this Open Framework is,"
  },
  {
    "speaker": "Rob",
    "content": "was and will be meant to tackle, um,"
  },
  {
    "speaker": "Rob",
    "content": "are quite relevant."
  },
  {
    "speaker": "Rob",
    "content": "Well first, because more often than not, basically everywhere outside of IBC interoperability is still to this day, pretty permissioned you know? Like it's gate kept, you got to talk to somebody, and then they got to do something, and they may even have to talk to another somebody and like"
  },
  {
    "speaker": "Rob",
    "content": "why did we get into crypto, right?"
  },
  {
    "speaker": "Rob",
    "content": "I don't have to talk to anybody before I just develop an app, and, and build it, and launch it on Ethereum. I don't have to talk to anybody before I do that with Solana with any, uh, Public Blockchain like"
  },
  {
    "speaker": "Rob",
    "content": "why is it here that I have to do that. It's not a choice. I just kind of have to."
  },
  {
    "speaker": "Rob",
    "content": "Now say you're like, you know what, I don't want to talk to anybody. I'm going to do it all myself."
  },
  {
    "speaker": "Rob",
    "content": "Well, good luck to you. Because now you're looking at spending an ungodly amount of your resources just to try and build an interop scratch,"
  },
  {
    "speaker": "Rob",
    "content": "uh, interop stack from scratch."
  },
  {
    "speaker": "Rob",
    "content": "And by the way, that's not even something that it relates remotely to your value prop, to the things that are in the realm of your core competence."
  },
  {
    "speaker": "Rob",
    "content": "Right?"
  },
  {
    "speaker": "Rob",
    "content": "Why should you, as a startup, as a organization with very finite, very limited resources, why should you do that? And like trust me,"
  },
  {
    "speaker": "Rob",
    "content": "it sucks to build an interop stack from scratch. Like I know,"
  },
  {
    "speaker": "Rob",
    "content": "'Cause we've had to do it."
  },
  {
    "speaker": "Rob",
    "content": "Right? And of course last but not least, you know, you did all that work,"
  },
  {
    "speaker": "Rob",
    "content": "you got it all done,"
  },
  {
    "speaker": "Rob",
    "content": "you put in that resources."
  },
  {
    "speaker": "Rob",
    "content": "Well, now that the software is done. Well now you got to wrangle up a group of operators and you got to get them to com-power this thing that you built. And that is, of course, no fun."
  },
  {
    "speaker": "Rob",
    "content": "And so that's where something like Hyperlane, right? This notion of an Open Framework for interoperability comes in."
  },
  {
    "speaker": "Rob",
    "content": "So what we're going to go on now is, more so that we've talked about, uh, to this point,"
  },
  {
    "speaker": "Rob",
    "content": "is why an Open Framework like Hyperlane addresses these problems that we just covered."
  },
  {
    "speaker": "Rob",
    "content": "Think of the first thing I mentioned, right? That this industry moves at, uh,"
  },
  {
    "speaker": "Rob",
    "content": "a break neck pace in which there is an increasingly rapid adoption of multiple chains, multiple architectures, multiple stacks."
  },
  {
    "speaker": "Rob",
    "content": "Now you're, you're just a developer out there."
  },
  {
    "speaker": "Rob",
    "content": "It's, it's been made so easy for you to launch a chain. So you go ahead, you do that"
  },
  {
    "speaker": "Rob",
    "content": "and you just want it to be able to connect to all these new ecosystems. Or"
  },
  {
    "speaker": "Rob",
    "content": "maybe you're not, you're not, uh,"
  },
  {
    "speaker": "Rob",
    "content": "someone who's building a chain. You're an app builder."
  },
  {
    "speaker": "Rob",
    "content": "You're an app builder, who's really like an asset issuer, or where your product"
  },
  {
    "speaker": "Rob",
    "content": "is a token. Like say you're a stable coin, your an LRT, an LSD. "
  },
  {
    "speaker": "Rob",
    "content": "What do you do? How do you deal with a problem like this? And how do you take on"
  },
  {
    "speaker": "Rob",
    "content": "all that complexity without going insane, and really running out of resources, which is, of course, the death of your operation."
  },
  {
    "speaker": "Rob",
    "content": "Well, Hyperlane this Open Framework, it gives you a singular consistent interface for all of your interoperability needs. That interface stays the same, but you, you keep expanding. So you just save a tremendous amount of development time. Now when you need to expand to new chains either"
  },
  {
    "speaker": "Rob",
    "content": "this interface, this Hyperlane thing, it's either already there. Today Hyperlane's on, you know, I want to say already over or close to, uh, 80 different Mainnets. And that number is going to keep, uh, rising."
  },
  {
    "speaker": "Rob",
    "content": "But, say it wasn't there. By some odd twist of fate, no one's done it yet, you can do that yourself, because like we talked about before, anyone can go on the, uh, Hyperlane Docs, download that CLI, and get going."
  },
  {
    "speaker": "Rob",
    "content": "And now switch the slide, but the diagram, still there. You look at this beautiful diagram. You'll see that the last step here, or I guess the penultimate step, step number five, is the inter chain security module."
  },
  {
    "speaker": "Rob",
    "content": "So, I'll tell you, I don't think it really would be an Open Framework, if you were forced to settle for something. If you were forced to, just accept something, as is. If you couldn't, uh, wrangle it, change it, customize it, to your needs and wants, right? That is what makes a framework, a framework."
  },
  {
    "speaker": "Rob",
    "content": "And to me this piece, the, the security module piece, that, to me is where the magic of something like Hyperlane is really born out of. It's the flexibility, it's the control that you can have over what is an integral part of the interoperability stack, of course, security."
  },
  {
    "speaker": "Rob",
    "content": "So usually for most people, bridging for their chain or app means inherently developing a, material, a massive dependency on a third party. And really, trusting that third party."
  },
  {
    "speaker": "Rob",
    "content": "Now imagine you're one of those asset issuers that I was talking about."
  },
  {
    "speaker": "Rob",
    "content": "Right? You're literally, explicitly, putting your entire business, your entire product in the hands of a third party."
  },
  {
    "speaker": "Rob",
    "content": "And some people, totally okay with that, in some settings. It's some point the stakes get so high, that it starts being a little bit, uh, off-putting."
  },
  {
    "speaker": "Rob",
    "content": "And so should you do that? I'd say not today. Not with the Open Framework, right? Hyperlane lets you, the integrator, whether you're a chain, you're an app,"
  },
  {
    "speaker": "Rob",
    "content": "somebody's neighbor,"
  },
  {
    "speaker": "Rob",
    "content": "whoever you are, it lets you dictate what that security should be."
  },
  {
    "speaker": "Rob",
    "content": "So an ISM, right? This inter-chain security module. It can be anything that provides a state attestation, or a state proof. So think of it, uh, you know, as ranging from as simple, as like, 'Hey,' you know 'Using some', you know, 'signatures from like a validator, state attestation right?', all the way to as complex and amazing as some form of ZK magic."
  },
  {
    "speaker": "Rob",
    "content": "You can even use multiple security modules, and stack them together and aggregate. You can use just one. Now best of all, you never need to depend on any default settings."
  },
  {
    "speaker": "Rob",
    "content": "You can use Hyperlane without ever using a module that's being run by anyone other than you."
  },
  {
    "speaker": "Rob",
    "content": "That to me is what it means to be an Open Framework, right? You take it, you run it, you own it, you operate it, if you want to. You don't have to, but if you want to. Having that flexibility. I kind of liking it to"
  },
  {
    "speaker": "Rob",
    "content": "why do crypto companies, especially the ones who hold our funds in custody, why do they many times operate very differently from the financial institutions that we're used to, from say banks, right?"
  },
  {
    "speaker": "Rob",
    "content": "Well, Wells Fargo treats me a certain way because Wells Fargo kinda knows that I don't really have an easy way to opt out. Like any other bank I'm going to go to is going to basically treat me the same, present the same obstacles, and the same inconveniences that they do. But if you're Coinbase, Coinbase knows, that at the end of the day, you, me, anyone who's on Coinbase, we can opt out. We can just click withdraw, and we can be our own bank, right? We can self custody."
  },
  {
    "speaker": "Rob",
    "content": "And that completely changes the thinking process, the incentives, decision making of how they operate it. And similarly, presenting that type of optionality,"
  },
  {
    "speaker": "Rob",
    "content": "uh, in so far as interoperability is concerned, I think, is very, very important."
  },
  {
    "speaker": "Rob",
    "content": "So, not only do you get that level of flexibility, but because these modules are adaptive, because they do not, uh, impact the interface that you're using to communicate between the chains."
  }
]