[
  {
    "speaker": "Rob",
    "content": "Uh I a- yes I I agree I think yeah that's that's really good point, but what if I'm uh you know um another super chain user and I want to hold some meme coin uh from Base?  Wha- What do I do? Right?"
  },
  {
    "speaker": "Wei Dai",
    "content": "You you're not going to L1 at all."
  },
  {
    "speaker": "Wei Dai",
    "content": "Right and and I think you know the- there's a main problem right which is um yes it creates more assets and and kinda of just liquidity that's on on the roll up, but that actually doesn't get bubbled to like all one, other L2s. So I actually wrote this uh research posts uh uh I think around ECC a couple month ago. Where so I think we can canonically bridge assets from all one to all two.  From all two to L3.  We should have to do it the reverse way as well.  So I call this reverse canonical bridging or two way canonical bridging. Where um you could say that actually if you have a Base meme coin, I can actually bridge it back to all one.  Right, using the exact same security mechanism that uh you know the super chain uses.  The same will apply to fo- for example elastic chains, right?  So you could have this effect where maybe DJing right this uh super chain uh arbitrum on arbitrum L3, we will be able to say okay, now our assets actually bridge back to the you know arbitrum one, then back to all one, but then can be going going to Base or going to elastic uh elastic chains like sequencing error. Yeah I think this could be a standard actually.  And then the  Yeah"
  },
  {
    "speaker": "Andy",
    "content": "So is that your mental model for like this cross roll up cluster?  Cause we talked a lot about like this inside of these roll up cluster interop in- in terms of value accrual and I think their standardizations are happening way faster than kind of like broader standards, but like is this a similar mental model that you have to like the broader cross roll up interoperability or like how should we think about the progression of interoperability amongst all these clusters and like bringing this all together as a- as a whole?"
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah.  Um I think that's a really good question. And maybe what I have just mentioned you know two way canonical bridging is one way to kind of Yeah yeah Could be part of it."
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah like a cross cross cluster. Um and that's actually very simple VIP I think we we could uh the community could come together and and agree on. Um but yeah there's a lot of other other aspects to this. Um you know I I think to be honest, interop within a cluster is probably something that we'll we'll be saw first and then we will see interop between clusters.  And and I think that maybe the question is more to Ethereum right?  As rollup clusters proliferates and build their own eco systems, how will the Ethereum respond as as a base layer?"
  },
  {
    "speaker": "Rob",
    "content": "Got it. So the two way canonical bridging is is functionally or technically possible because both of these coins are ERC20s, but like what are the implications on security and like the trust principles of of moving an asset that's native on Base like back onto the L1?"
  },
  {
    "speaker": "Wei Dai",
    "content": "Um you will use the same settlement contract right?  So uh imagine we you deposit or withdraw from Base you're interacting with settlement contract.  The Base has on L1.  This will be the exact same mechanism. But instead of for canonical wrapped assets, you will be for assets on Base.  So so the security is is effectively exactly the same."
  },
  {
    "speaker": "Rob",
    "content": "You would have a similar like mint and lock or mint and burn Exactly yeah. mechanism?"
  },
  {
    "speaker": "Wei Dai",
    "content": "So imagine basically on on Base there's a system contract that'll say if you transfer asset to me, I will actually mint it for you on L1, right? Yeah And so an- and this is actually creates a lot more network effects uh on Ethereum and base layer and because actually requires storage um so right now the set- settlement contracts on all one for the all these roll ups it it it actually incurs minimum storage and so it it's not actually pay much to Ethereum.  But imagine if you ask to bridge reverse reverse bridge a lot of meme coins back to all one.  Each of this uh so for each coin and each holder this actually incur uh storage slots, right?  And so this it's actually a good way for Ethereum to actually like price these things right?  Um you know as it accrues network effect, it gets actually price this in in in in the form of like payment into into all one. Right"
  },
  {
    "speaker": "Rob",
    "content": "Yeah And um I- I uh uh you're kind of like moving this in- into the L1.  Um this wouldn't require you to sell the token which was like one example was like potentially like a accrual back to- to ETH, but it would also solve for some of this parasitic L2 type of rhetoric because you would end up with more of more value accrual to the Ethereum protocol, and then in- in kind of like transitively ultimately back to- to ETH the token.  And so how does like when you're thinking about storage slots, like what is how what are the economics behind that?  Cause I mean we we hear a lot about like transactions and DA and like how some of these things end up accruing value to ETH, but we don't hear so much about storage slots.  Like what what is that in terms of the settlement contract, what are kind of the economics that are around that a- and how do they accrue value?"
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah so if you look at Ethereum uh today, um the state is increasing right? It's it's it we actually removed the the opcode to uh uh you know um uh destroy co- contract code and I I think uh there's so there's state and this history hi- history is uh for- forever growing and state and then there's a question like do we actually uh try to remove part of the state?  So right now if you pay for storage slots, it's 20k gas on all one and you that storage will be there forever.  Right? So in fact if you're paying it o- one time, and every single full node uh that want to produce and execute transactions will have to store that storage slot, right?  So this is a conversation on 444. Do we actually try to limit amount of working state over time Mhm and and and you know do we do state rent?  So Solana does state rent and I think it's actually the correct choice and and so um so effectively, if you have state rent with Ethereum I think it's you know vitally put out this four four four part post which includes uh this transition right? Mm Once we move into state rent.  So every single piece of state that has to be stored all one will actually generate value for all one because it needs to be paid for. Right Is this part of the purge?"
  },
  {
    "speaker": "Rob",
    "content": "I believe so.  I I'm actually not too familiar with exactly which part fits into which part, but I th- this sounds like the purge. Yeah"
  },
  {
    "speaker": "Rob",
    "content": "Cause this is this is an uh attempt to solve the state bloat issue on- on Ethereum. Exactly exactly And limit the amount of storage slots.  Would that would that limit this kind of possibility for two-way canonical bridging?  If you couldn't all if you had to limit the amount of meme coins that you can bridge back to the L1?"
  },
  {
    "speaker": "Wei Dai",
    "content": "Well it's it's all uh it's a market right?  And and I think um Ethereum will only accrue the value if if it's market for um storage slots, it's actually saturated right?  If you look at DA, uh it's  Yeah it's pretty saturated. almost there, it's almost saturated.  Almost Pretty saturated Almost saturated right?  But before it yeah, price is zero right? But the time this comes out, it'll be saturated."
  },
  {
    "speaker": "Wei Dai",
    "content": "Exactly and so we we actually want to use these storage slots.  If you look at if everyone move to ro- move to all two roll up, even all three.  How much storage will be on all one?  It It's basically zero.  Like we'll have some stake elements and and uh and that's it.  Like you know we're we're using DA, but like the actual state storage on all one for these uh uh uh settlement contracts is very very small and so this is actually a way a mechanism for- for Ethereum to take control uh right off like off off this market market and actually put more demand on there.  And so I I think it's actually really good way to fix fix the roll up eco system and accrue more value back to Ethereum um Yeah  Yeah.  Mhm  Yeah You know what's interesting is that some of these uh newer um rollup ecosystems that are being launched are so- some of them call themselves roll up because they've seen these they've seen this problem and like they've had the advantage of  of being able to build their stacks after Ethereum's roll up centric roadmap has played out after cosmos app chains have played out and so so so yeah I don't know if- if you guys did uh any of these recent ones like the like the ones that come to mind are Anisha, Delta Pod and these are all kinda like uh Pod and Delta are interesting like they're calling themselves almost like consensus less and then Anisha's got this L1 just used for state transitions and for liquidity for their um L2s basically app chain focused.  And so we we have these dynamics where these these ecosystems are like solving these problems that Ethereum's facing where it's like is Ethereum an execution environment, is it a DA layer?  It's like no, you know Anisha's L1 is just for state transitions and just it's kinda like this like proof of liquidity type of hub uh and then uh Delta and Pod have these kind of like uh domain models and these consensus less models and so you know I'm curious on like what your thought of like this next iteration of these roll up ecosystems are like is this something that like will keep being iterated on, are these exciting to you?  Like like wha- like it's just it's it's interesting to me because they've able to be being built these th- they're able to build these ecosystems after seeing all the problems of Cosmos and Ethereum."
  },
  {
    "speaker": "Wei Dai",
    "content": "Exactly Yeah an- and no taking a step back I think so blockchains are application platforms and application platforms could take different shapes and forms and they don't actually have to be an all one blockchain, right?  And I think the the way that we have evolved from Ethereum L1 to roll ups to shared settlement, to shared sequencing, to you know pre-confirmation.  Um that's a- a very specific way of of doing things. And and it has gotten us to a point that you know it's hard to navigate right? It it I I will say it's a local up- optimum point, right? But if you just zoom out. Let's build application platforms for applications with security, interoperability, sovereignty for the application, and network effects right? And and if that if that's a question, I think there's other ways to approach this.  And we've seen increasing number of projects uh trying to take take this first principle approach.  How do we build application platforms? What are the features uh that could be different than the current platforms?  Um I think you know if you take a really long view uh of this, it'll be better and bad platforms.  I I don't think uh Solana today, right? They I think it will quickly converge uh just like Ethereum did in 2020. And yeah and you know there's also concretely, there's a couple of different advances that is would be really hard to integrate back into Ethereum, Solana.  So for example, uh orderless consensus.  It turns out if you just do settlement, uh or if you want to do auctions as a service, you don't actually need ordering.  And and and we can actually uh have faster way of of of getting things um arriving into consensus.  Uh another example is so that's on the on the consensus layer, right?  We talk about parallel execution and um it it turns out right, orderless consensus actually goes really well with parallel execution. Because you know certain ordering doesn't matter when things are parallel right? Mhm Right And so um so yeah, so I think we're seeing in- increasing number of projects you you mentioned a few like Pod Delta Anisha.  Um yeah it we're we're we're very very excited about this you know ne- newer directions. Especially  Exactly Yeah. Yeah, and so you wrote in one of your posts like these are these are interesting from an application perspective because uh unlike Ethereum you can you can uh quote unquote tax economic flow thr- through the system and have that accrue to the base asset or you can build interoperability out of the box that cosmos did but then cosmos kinda struggled to really get the the underlying network effects of having like one hub, right?  It it you know the cosmos hub never really kinda accrued that value and then then you can also and you know I think Anisha does this well.  I'm not so sure about Pod and Delta.  They're a little bit more early in development. You have these like uh sovereign app chains that can control their their MEV, their their transaction logic, you can do application specific sequencing for some of your uh apps on- on the L1 per se, so like you get these like features this feature set out of the box that feels like the logical next iteration of like the the broader community agreeing that like horizontal scaling is the way, but then like here is how we can improve on it. Um and so I mean from an investing thesis i- it must seem like an easy kind of idea to back or to like uh like see value and ju- just basically on those three iterations that you put in that post."
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah definitely.  Um interoperability is what applications want, sovereignty, right? able to retain its own MEV, customize a VM, um and third, most importantly, taxing taxing the economic um v- value economic kind of velocity. In in in ecosystems.  I think this might be a controversial point, but but I think if you do the math, the base layer will have to do this. Um you know, I I don't think it's a question of um you know should base layer do this or not.  It's a question of like exactly like how much, right? How to do it properly.  And and and I think the analogy I want to use is you know blockchains are a- applications platform our countries. And applications on there are you know maybe like companies and individuals and you know the country should generate a network of fact security right for its for its uh uh constituents, but constituents will create value and then contribute back to to to that country right?  Um an- and and I think that's a really good analogy um because in- in a system like that, you have to think about you know how- how do we properly set up the you know incentives economic uh factors so that that everything works properly."
  },
  {
    "speaker": "Rob",
    "content": "Tha- that just, you know, we hear that analogy a lot like the country's analogy. For some reason I thought about the fat protocol thesis and fat application thesis, and I never really thought about that and the country analogy with that, because like in that in that analogy, you have citizens, maybe those are the applications, and the- and then you have the country as the protocol. And the o- like the people in a country make money, like they have- they make a living, right?  And then you have the country that also makes money. And they make money by taxing like the citizens or you know, in- in the country.  And so it's not so much about fat application or fat protocol thesis. It's more, it's both."
  },
  {
    "speaker": "Wei Dai",
    "content": "Fat eco system."
  },
  {
    "speaker": "Rob",
    "content": "Fat eco system that applications."
  },
  {
    "speaker": "Andy",
    "content": "Eco system has applications. Fat wallet thesis."
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah yeah yeah."
  },
  {
    "speaker": "Andy",
    "content": "You guys haven't heard that one?  Tell us."
  },
  {
    "speaker": "Andy",
    "content": "The fat wallet thesis is- is the- is the aggregation of all of this.  It's like the- the the whatever, whoever con- controls the end user relationship can basically aggregate all of the applications and all the chains, and just control all the order flow as well as the end user kind of relationship, and just have that have this fat value accrual.  Like MetaMask charges I think half a percent or .85% on swaps, um, Phantom has a similar thing, so these these these wallets are like this next era of this application thesis."
  },
  {
    "speaker": "Rob",
    "content": "I- I would argue that ETH Ethereum is the- the wallet of the app chain ecosystem.  And- and actually David Hoffman from Bankless made- made this on like a panel that he was on.  Basically that Ethereum is the launchpad for other app chains, and it's been the only ecosystem that has encouraged other projects to launch their own chain. And so in the same way that you're talking about wallets as this middle ecosystem uh uh aggregation of users, as well as chains, and kind of like that intermediaries probably not, but it's like more of a portal into that world. Yeah, it's a brand. Yeah, exactly. Yeah.  Ethereum is the portal into The"
  },
  {
    "speaker": "Wei Dai",
    "content": "Distribution yeah. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Platf- Platform application platforms also offer distribution, right? Yeah  Yep. Yep."
  },
  {
    "speaker": "Wei Dai",
    "content": "The way I think about this is like, think about App Store and like AWS. So like, you wanna build a blockchain that's both simultaneously like AWS, like the backend, but also like the App Store. Yeah Right Yeah An- and one of you guys' portfolio is Abstract, which disclaimer, we also uh have been invested in abstract since seed round 2022, when everything was dead. Um there like I think they're The same rounds. Yeah Yeah They're building you guys have wa- way more size but that's okay.  Um they're building like this consumer portal in addition to this global wallet, and like also have this- this idea of like this app store that you come on, you interact with, uh and then you kind of have like this consumer fun chain, like um I don't know, the question is like what makes Abstract appealing to you guys uh now and I know you guys doubled down once they were kind of uh building this out.  We're kinda coming to a- a wrap up here so I think this is a good place to kind of end out as like abstract as an application platform.  Why is this a good example of something that you believe in as like the future of distribution and of kind of blockchain for consumers?"
  },
  {
    "speaker": "Wei Dai",
    "content": "Yeah definitely. So, you know brands are re- really effective ways of um building building a platform right? And and I think to certain extent Ethereum Solana has built a brand, but we actually have like what two builders, like you know, traditional founders coming in an- and building a brand that is not necessarily like from the crypto native community, right?  I think that it that is somewhat unexplored and I think the- the team Abstract um you know it it's basically doing it the be- best way possible, right?  And and so this is like coming at uh from a different perspective, right?  How do you really create this community? And I think um yeah, so that- that's really the- the edge that they have, and I think they'll continue to uh to harness that the edge they have right?  And and uh you'll bring brand new users to the space, um which is perhaps not possible if you just just talk about okay, let's build a new blockchain right? Yeah But what about their funnel right? So like let's say they have this brand, they bring users on chain.  Like what is the- what is your uh vision for like blockchain as application platforms as like a funnel for value accrual for like abstract token at the end, or even like all the way down to ETH at the end?  Like- like how does this work? How does I-  how does Pudgy Penguin bring in buys a toy comes on chain, Pudgy World, then goes to Abstract, how does that turn into like Ye- Ye- Yeah. revenue?"
  },
  {
    "speaker": "Wei Dai",
    "content": "I think you have to bring Peter on- onto the podcast. We'll have to We'll have to debate- I have- I have debate with Peter a lot you know, because um you know i- it's good debate in the sense that look, I I do infrastructure and Peter focuses you know on- on uh consumer. And an- and you know if you look at Web2 actually, the applications typically verticalize and become the infrastructure right?  Yeah.  With Google, Facebook, Meta, right? And but in the Web3 world, it has has it has been you know, different right?  The- the infrastructure becomes the bigger player and um you know, how this evolve into the future is something that's open question.  I think we'll see uh we'll see interesting consumer applications verticalized and become infrastructure.  We'll also see right infrastructure project becoming brands themselves like Ethereum Solana.  So yeah, I think this convergence here um and and yeah and both sides will well will continue to make progress right? And and there's- there's players to watch on on either side. Yeah they- they building their own moat.  It's that uh it's the final loop from the beginning of the conversation of the abst- Info cycle.  So, wei- it's been an absolute pleasure. Thank you so much for coming out man."
  },
  {
    "speaker": "Wei Dai",
    "content": "It's the same thing."
  },
  {
    "speaker": "Wei Dai",
    "content": "Thanks for having me.  It's been fun."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, great. Thanks man."
  }
]