[
  {
    "speaker": "Rob",
    "content": "This is why I call this the evolution of blockchain architectures. Moving from an entirely crypto-economic system to a proof-based future where crypto economic guarantees on EigenLayer are used for liveness."
  },
  {
    "speaker": "Rob",
    "content": "And so I mentioned this idea of our double auction design, but what we haven't talked about is why this matters. Why does it matter to have an incentive compatible auction design to match buyers and sellers? And why would a user care, right? Why would anyone care about any of this stuff beyond an interesting paper? And the reason is because incentives and efficient pricing are core to making sure you have to pay the least amount possible to be able to get what you want. If the network has collusion, or doesn't have group strategy proofness, which is the academic term for that, then it means that the amount you pay could be proportionally much higher. There could be rent-seeking done by provers. If the network isn't able to guarantee efficient pricing or welfare maximization, another of the properties that we discuss in detail and depth in the paper, then there's no guarantee that you get to pay the lowest possible fee or that across the whole network proofs will be delivered in a way that maximizes everyone's ability to get what they need from this network. And so by solving for these core properties, buyers have the best experience possible as these sellers, which means that everyone we've discussed, from the NFT projects like Azuki, to the DeFi projects like Gearbox, EtherFi, and more, Tokemak, Usual Money, all the way to some of the Rollup partners, all the way to the Entrop protocols like Polymer, LayerZero, Acala, all can have the best experience possible as buyers of proofs. And many of the provers, the institutional operators who are generating these proofs, can make sure that what they receive for generating them is proportionally higher than anywhere else in the industry. When everyone wins, we believe that networks succeed."
  },
  {
    "speaker": "Rob",
    "content": "And so what I want to end with is just a way for people to get involved."
  },
  {
    "speaker": "Rob",
    "content": "So we're doing a hackathon right now alongside EigenLayer and AltLayer, where we have a bounty for using our ZK coprocessor, which I've discussed briefly before. We also are throwing the inaugural Proof Summit, Lagrange's uh, owned event at um, Devcon, alongside many of our partners, including Polymer and AltLayer. Um, and we also invite everyone to join our Discord and to follow us on Twitter or X to stay apprised of some updates that are coming very soon. And if you want to run a prover alongside some of the top operators in the space, reach out to our team. We're always looking for new people who can participate as network participants, who can run provers, who can run, um, infrastructure and who want to generate rewards and fees from doing so."
  },
  {
    "speaker": "Rob",
    "content": "So that's the presentation."
  },
  {
    "speaker": "Rob",
    "content": "Um, and it will be great to move into kind of some, some dialogue over, over anything that we can, can dive into. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Absolutely! I mean, I, I think, frankly, what one of the things that I, I love about the presentation is one of the last things you said, which is that networks succeed when everyone wins. Um, I, I really like that, and I think that is something that Sree Ram and EigenLayer have alluded to over the course of their, their, their development, which is that these infinite games and these positive sum games are, you know, there's kind of like levels to it, you have zero sum, then you have positive sum, and then you have infinite sum. And so EigenLayer becomes sort of this network of infinite sum games, Lagrange being one of those, and so diving, you know, a little bit deeper into Lagrange and it's, it's network here, you know, Yeah. I, I think maybe it's a little bit, it, it's pretty straightforward, but, um, who are the, like, the supply and demand side of Lagrange's network?"
  },
  {
    "speaker": "Andy",
    "content": "Um, and then, you know, you mentioned that, like, a lot, a big part of this is incentive compatibility between the two. Yeah. And so, you know, I think at a surface level, it's not, it's not as simple as just like an order book, right, of people, like, bidding on proofs, so could you just expand a little bit upon like the economics that you guys have come up with, and maybe the secret sauce is in these double auctions, but could you just unpack that a little bit more and, and help, you know, me and our audience understand the incentive compatibility between the supply and demand side of Lagrange's network?"
  },
  {
    "speaker": "Rob",
    "content": "Yeah, so very broadly speaking, we define a set of properties under which we believe a network to be incentive compatible. This is very similar to what Ethereum did with defining the properties in, in Tim, uh, Roughgarden's paper related to Ethereum's transaction fee mechanism. And the properties that we define are truthfulness, group strategy proofness, welfare maximization, uh, budget balanced, and computationally efficient. Um, in effect, it is, can we run an auction efficiently that is both compute efficient, ensures that everyone involved is able to maximize their own outcome, and to ensure that the reported prices and the dominant strategy is to have the correct private values reported, um, to the auctioneer by both the buyers and sellers of compute. And in this case, um, we work on a double auction mechanism that has a novel composition rule of how we match buyers and sellers such that participants of the network can have guarantees that those properties are met. And when we talk about our ecosystem, it is really about how do we ensure that, you know, the, the group in, this diagram under ZK Prover Network, the, the people who are lending and who are, who are providing compute can guarantee that what they're receiving is the best possible outcome. And how can we ensure that all of the people using our zero-knowledge proofs, the people using our coprocessor, you know, Azuki, EtherFi, Gearbox, and more soon, the people using our state proofs, all are able to guarantee that what they receive is um, the lowest cost of the proof possible."
  },
  {
    "speaker": "Rob",
    "content": "Uh, and that's the core of where our network um, prioritizes this incentive compatibility. Um, and then you know, very broadly speaking, the, the, the kind of, the concept that, we kind of, talk about with this is, is kind of, the Eli 5 idea, the Internet of Proving. The idea being that you have this, this universal substrate under which you want to derive proofs from. You want to be able to request some type of proof for some type of um, um, uh, verifiable information from somewhere within a network. Whether that be information or computation, information on state, information over state transition, information over some execution, and you want what's returned back not to be that information, but to be that information in addition to a proof."
  },
  {
    "speaker": "Andy",
    "content": "Awesome. Okay. Um, and so drilling a little bit deeper into the economics here, like, you have, you have the ZK Prover Network and these are, these are the entities that are supplying the proofs, and, and there are computational resources that are required to, to generate a proof. Yeah. And, and the Coinbase, OKX, Kraken, these, you know, Tier 1 partners are, are, they, they have a cost to generate this proof. And so let's say, um, let's call that like the cost of the task, right?  Mhm. And then on the other side, call it the demand side, you have co-processors and those who are, uh, consuming these state, state proofs, Yeah. um, the LayerZero's and the, and the Usual Money's and the EtherFi's of the world, and those are buying, those guys are buying the proofs. Um, now, the, the, the entities that are buying the provers are, you know, paying for the cost, uh, to the ZK Prover Network, and then, and then some, right? And then there's a Delta, and, and Lagrange maybe capturing that Delta, but then at least a portion of that is going to stakers in the form of APY. And so maybe you could talk a bit about Lagrange's fee mechanism, Yeah. how, how stakers in Lagrange's, uh, AVS ultimately end up, um, earning this, this APY uh, through Yeah."
  },
  {
    "speaker": "Rob",
    "content": "That's a phenomenal question. You know, I, I think very broadly, every AVS blockchain network has two costs. The first being a capital cost, you know, the expectation of yield on capital that's provided, the opportunity cost that exists on that capital through other sources. And then it has an operational cost, how much does it cost to run this infrastructure? Um, and with POS chains, usually the capital cost is the most expensive component. The amount you have to pay for a Tendermint chain for instance to the validators that is typically 25, 15, 35%, it, it can vary substantially but it's usually in the double digits. And you can look at, you know, staking rewards to see what most POS chains are paying. Now, if you look at the operational cost of those chains, it's, it's pretty low. The amount it costs to run a validator is proportionally much lower than the amount that the chain has to pay to offset the opportunity costs and the capital. ZK is almost a diametrically opposite design. A"
  },
  {
    "speaker": "Andy",
    "content": "Yeah"
  }
]