[
  {
    "speaker": "Andy",
    "content": "from um corrupting liveness is generally not very high. If you are expected to generate a proof and the proof takes thirty seconds to generate and you miss your slot, you face a penalty of some type and you get moved off of and someone else generates that. And if the network dynamically allocates work uh by a composition of both bidding and then operator performance, you're able to design something that is very strongly um that that very strongly disincentivizes somebody from behaving badly and from engaging malicious behavior. And then the size of the penalty therefore only has to be proportionate to what can be lost from that penalty or what can be lost from an adversarial actor. Um and with ZK systems to your point it's not, you know, incredibly high. So this is why I actually don't think that a lot of proving systems or proving networks or any type of architecture that delivers proof proof markets, whatever require require slashing. So if you have two billion dollars a stake in your in your operator and I assign you a proof, and the penalty for you not computing a proof is me not paying you for the next two weeks, well then what you've lost is proportionate to the risk-free rate of that capital over two weeks. So let's say risk-free rates two percent, so you would expect um forty million per year in rewards and I compromise that over over two weeks. So I effectively cost you 1.6 million. Thirty second delay of liveness 1.6 million in slashing. It's it's rather high, and I can never come in in this case I don't actually even go after the principal. I just go after the stake. Or sorry, I just go after the the ability for you to generate returns on that stake over a future interval uh jailing in essence. And that's what a lot of uh prover networks and prover markets will likely move towards because it's much more capital efficient and then the risk to the capital is much lower because you don't lose principal and so the rate you have to pay is once again proportionate to the risk and so you have to pay less and so the overall network is more capital efficient."
  },
  {
    "speaker": "Rob",
    "content": "Okay, and so would you would you expect or would anyone expect that the the the because there's no risk of print slashing principle here, that Yeah and Tarun used like credit rating. The credit rating of Lagrange's AVS would be relatively high? Like the the risk of getting slashed or at least your principle getting slashed would be relatively or that risk is relatively low, leading to a higher credit rating. Now Yeah. does that does that lower risk translate to potentially a lower reward, lower APY versus like some credit I don't want to pigeonhole you here but like, Yeah. you know, is that is that sort of the the thought process? "
  },
  {
    "speaker": "Andy",
    "content": "Yeah, like we're not we're not issuing short positions on top of EigenLayer, right, like we're not it's not like you get slashed if eth price drops below a certain amount where it's and you're getting yield based on someone else taking the other side of the position. Like um you know, I I I think what's what's interesting with with our design is that it is able to effectively create a um environment where you can stake with near zero risk of loss of principal. Which means that insofar as you have eth that you're staking, it is advan- advantageous to restake it into Lagrange because you will not unless there's a contract failure on on on one of our counterparties, you will not lose your eth. Um and that's a very powerful position to be in we think because it means that people who want to restake without wanting to risk their capital are able to do so in something that generates a nominal yield on it. And it might not be as large as if you're issuing options on top of uh restake eth but it's it's it's much less risky, and it's something that can scale to you know, right now we're at about 7, 8 billion restaked into Lagrange, but it could scale up to 10 billion, 20 billion.  Yeah. It wouldn't be a systemic risk to the base layer. At least. "
  },
  {
    "speaker": "Rob",
    "content": "Right. And and so I again like, I don't want to use too many analogies from that previous podcast but like it it really does help put things in perspective like Tar- Tarun helps uh or he kind of illustrates this as like a bond market, Yeah and and you know, the this this uh there's essentially bonds for economic security Yeah. and so for this case like, yeah, you guys aren't, you know, slashing validators based on some some eth price up and down, right, so it's Yeah like very predictable um and and very low risk of getting your principle slashed, and so we would we would you could call this like a like a triple A rated um AVS bond, essentially or you know, uh in in the grand scheme of things. That that's one one way to think about it. "
  },
  {
    "speaker": "Andy",
    "content": "Yeah, it's one of the things we pride ourselves on. We want to be the safest, the safest AVS or one of the safest AVSs. Um we want there to be a situation where people can stake into the network, they can work with the proofs generated by the network as DeFi protocols, NFT projects as um uh as rollup teams as um interop protocols and benefit from the proofs being delivered to them and trust that the proofs will be delivered properly such that everyone in the protocol is in a position where they feel good. "
  },
  {
    "speaker": "Rob",
    "content": "Yep. And I think there is a large subset of eth validators that are not too inclined on taking some exorbitant risk. You know, they've already deposited into EigenLayer, they they're comfortable with that and then I think, you know, we we will end up seeing some sort of slippery slope down the risk curve but ultimately, those those those validators that go further down the risk curve are you know, they they've got to kind of watch out because that's what happens when you go further down the risk curve. Um and there's probably going to be some of that, but um but for the most part for any institutional size capital or, you know, large validators, I you know, I think it's reasonable to expect that they would they would stick to lower on the risk curve, collect their APY that they could get from triple A rated AVSs and and be quite happy.  Um Yeah. Exactly."
  },
  {
    "speaker": "Andy",
    "content": "Um and I would I would even add that when you have 10 AVSs you can stake into without risking principal, if those AVSs in aggregate pay you 50 bips total, 25 bips total, it it's advantageous to do so, especially if if the you get a receipt token on that that you can further compose into DeFi in the same adoption. There there really isn't a a reason as a staker that if you are comfortable with the smart contract risk of using any of these services that you wouldn't stake into things that don't have slashing. And this is why if we look at LRTs right now, they've delegated into almost every AVS."
  },
  {
    "speaker": "Rob",
    "content": "Uh I lost you there for a second. Hold on. I still don't have you totally back.  Cool. Yeah, so I think it makes a ton of sense um that uh a a significant subset of the ethereum validators are going to go into these triple rated AVSs um and and collect yield without taking uh risk to their principle. "
  },
  {
    "speaker": "Andy",
    "content": "Yeah, that is how we envision the future as well. When the risk of slashing from an AVS is is zero because the AVS has not implemented slashing, there isn't really a material concern about opting into any of these, which means that if you receive yield without any risk to the principle, you have to simply offset whatever the opportunity cost is and given the the fact that you can use these receipt tokens in ways that compose within DeFi in very interesting structures, like you can you can take a receipt token on LRT and you can use that within DeFi the same way you use an LST. It means that opting into 10, 15 AVSs that don't slash you for, you know, a nominal yield of 25 bips, 50 bips is is very compelling especially for institutions that are trying to maximize returns on capital. Maybe, you know, a degen wouldn't buy eth and then stake it in the EigenLayer if they're getting 25 bips, but if you're long, you know, 2 billion dollars of eth because you're a major institution, then it makes sense that you would stake that for your your your three and a quarter percent and then you would restake it for your an extra 25, 50 bips. And so"
  }
]