[
  {
    "speaker": "Rob",
    "content": "I think that we'll see capital continue to accrue to the triple A AVS's, the ones who to Turan's point have you know, the the the best risk-adjusted return because they have the lowest risk."
  },
  {
    "speaker": "Andy",
    "content": "Absolutely. I mean, just ta- taking like a very non-crypto native angle here is that you know, we're we're still only what, four maybe six months from uh, no probably less. The Ethereum ETF only launched you know a few months ago, you know, very much just..."
  },
  {
    "speaker": "Rob",
    "content": "Oh yeah."
  },
  {
    "speaker": "Andy",
    "content": "...just spot ETF for ETH."
  },
  {
    "speaker": "Rob",
    "content": "Mhm."
  },
  {
    "speaker": "Andy",
    "content": "I imagine and you know a traditional financial person would know better than I would, but you know, we're going to end up getting staking uh, in those ETF's. We're going to see some some larger institutions allocate capital, and then we're going to see incremental a- adaptations to some of those uh, staking uh, configurations that are placed into those, uh, ED- ETF's. And yeah, maybe there's a basket of of triple A rated AVS's, um, and we can incrementally accrue more risk-adjusted return to these large institutions that aren't trying to take any risk on their capital and they're comfortable you know, with with the amount of return uh, that comes from this and they can just continuously stack these these returns without adding any any risk to the underlying capital."
  },
  {
    "speaker": "Rob",
    "content": "Exactly. And especially once you've underwritten the smart contract risk that's inherent to every ecosystem, um, for the first AVS you support, it becomes very easy to support the marginal AVS that is based on the same smart contracts. It doesn't in fact add any exogenous conditions or exogenous contract risk or slashing. Um, and you get very strong properties like civil resistance um, from having, you know, stake-based uh, waiting of of of how actors are allowed to join the network, right? Where if you're, if you're only allowed to compute proofs up to a certain amount, given the amount of stake you have, if you're only allowed to just pay if you need a certain threshold irrespective if you have slashing, you have very strong properties of of that guarantee liveness and guarantee in essence some aspects of safety by using uh, economic security that isn't slashable."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. And and what you're alluding to is I think that unlocks potentially new use cases that haven't even been thought about yet, but..."
  },
  {
    "speaker": "Rob",
    "content": "Oh it does. It does."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Awesome, very exciting times. Um, imagination always goes wild during these conversations with you, Ishmael. Um, I uh, always appreciate you coming on the show."
  },
  {
    "speaker": "Rob",
    "content": "Love- love being on it. I appreciate you guys having me and I'm I'm glad you're not tired of me already."
  },
  {
    "speaker": "Andy",
    "content": "We're just getting started, ZK is still so so early. And uh, yeah you always bring a you know, very interesting and and informative perspective. So thank you, as always."
  },
  {
    "speaker": "Rob",
    "content": "Thank you. I really appreciate that."
  }
]