[
  {
    "speaker": "Rob",
    "content": "What's going on, guys? Welcome back to The Rollup. Uh, today we are talking about why every app will eventually become a chain and why sharding is not going to work for that, or at least that is my perspective. But Illia's going to tear it apart and rip me a new one as well as Rob, so that'll be fun. Um, and yeah, Illia, second time back on The Rollup. So happy to have you back. And um, yeah, man, how you doing?"
  },
  {
    "speaker": "Illia",
    "content": "Yeah, thanks for having me. Uh, I'm doing pretty well. We've had a pretty amazing August so far uh with launching chain signatures and uh, Nightshade V2. And so now, you know, I'm ready to talk how the future will look like and we have all the tech actually there. Yeah."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, we had Kendall on to talk about chain signatures. He gave the the approach of, uh, chain abstraction in that perspective. Um, and so maybe we'll touch on that a little bit but yeah, I have a feeling you guys are going to go at it and I'm going to try to I'm going to try to mediate. So, uh, uh"
  },
  {
    "speaker": "Rob",
    "content": "Yeah. I mean, I had this angry this angry man in in in the comments here, um, basically saying that like sharding is going to be better scale than any single chain, and I kind of responded here, but I think there was even like a a bigger tweet. Um, but I just want to explain my perspective first, Illia. If that's okay, and I know this tweet is like pretty polarizing, uh, because it's like very, like, black and white, which is never the actual case, but is great for engagement bait, I think. But like, my general idea here is like, okay, so if you're an application on Ethereum L1, if you're an application on on a L2, if you're an application on even on something like like a very high-performing L1, you're giving away in exchange for composability and network effects, um, from other apps on that, you know, kind of like universal chain. You're giving away like a ton of sovereignty by means of, um, uh, sequencer revenue for L2s, by means of, uh, controlling transaction ordering, by means of having to worry about whether or not there's going to be certain, uh, events on these chains that are are going to cause the experience on your app to be kind of, um, problematic in in in in a sense of like non-parallelized chains. Um, and I mean there's there's kind of a whole host of reasons why, uh, application builders, I think, should be launching their own chains, uh, from from that perspective. I just think that people that are building chains or apps on universal chains are thinking like a tenant who was renting a property from somebody rather than like a landlord who is accruing equity over time. It's like you're you're paying to be there rather than owning and and kind of earning with the kind of, uh, value of your block space. So I'll I'll just pause there, and that's like my general take. Now, I think there are instances where this may not make sense, and I think this tweet is pretty, kind of, black and white. But, I'd like for for the purpose of this to kind of stand pretty strong on this and not just give in. So yeah, Illia, definitely curious, uh, as to you explaining your tweet a bit. And yeah."
  },
  {
    "speaker": "Illia",
    "content": "For sure, yeah. I mean that my my response was like very specific, but yeah. I mean I think there's like a whole spectrum of things to consider and the the specific thing that I wanted to, you know, start with is definitely the reality is every single like single chain attack right now is actually non-scalable, right? And I think like every time one of those chains actually starts to get to a level where they actually have users, they have ton of trouble, right? The Base is a good example recently. Um, and like they're a few examples before as well. Uh, and so the the challenges like none of that you know, OP Stack, Arbitrum, like that or even Cosmos kind of uh, SDK is actually able to handle like million plus or like I mean, even for example, 10 million users, right? And if we are talking about like truly building kind of you know, next generation applications, that's a scale we need, right? So how do you do that? Well, you do need like you just cannot fit all the user data and all the transactions on a single machine. Like that's what all this kind of, uh, approaches do. And you can buy a bigger machine for sequencer for your all two, you know, and kind of, uh, potentially scale that way, you know, plugging more SSDs, there's actually like actual limitations on how much SSDs you can put on one computer. Um, but that that's kind of the the the story there. Or you can actually go the way that actually scalable applications going with just sharding, right? And so so this means like okay, well you need a sharded blockchain to achieve this. And you the the response kind of here will be like, sure, let's just grab Near for my application, right? Let's just have a Near instance per application. Problem solved, right? Near app chains. The question?"
  },
  {
    "speaker": "Rob",
    "content": "Um"
  },
  {
    "speaker": "Guest",
    "content": "App chains. So basically app chains."
  },
  {
    "speaker": "Illia",
    "content": "No, no, I'm I'm I'm I'm going to get you there, but I'm I'm just saying like that I'm I'm showing you right away your argument right? Which is like, let's just have a sharded blockchain for every application right? And so the answer there is actually users, right? At the end it's all about users and the kind of like you I I I like this argument of like, hey, you trading off sovereignty, but the thing is like, this is not your sovereignty to trade off as a developer. You're actually providing a service to the user. This is their sovereignty to trade off. And the fact that you have an app chain that now you're controlling your user sovereignty is actually the opposite of what users truly want. Users want to have all of their state as kind of composable and as close to each other and under the same correctness and guarantees as much as possible, right? I think that's that's to me that's actually the fundamental trade off, right? And so and as we again as we do in the sharding, and doing all those things, like you want to have that trade off. And that that's why I also think the layer 2s are kind of have this limitation as well because now you have all those different levels of sovereignty and security, and you know who who is responsible for what. This is actually back in 2019 when we were interviewing Zaki for for Cosmos for the whiteboard. That was exactly the example, like, I have my CryptoKitty that I own, but it was bridged from a different app chain, who is responsible for this, right? Like, now I, as a user lost my sovereignty, like lost lost part of the sovereignty of my assets, right? And so so this is why like for us it's it's all about this kind of the core value we provide is users owning their assets and data. Right? And so everything we do is kind of how do we maximize that and, uh, kind of minimize the leakage of that for the user? And so in a way developers are just facilitating it by building more protocols and more software. They themselves don't need like as a developer you don't need sovereignty. You need to have a best developer platform that is you know, easy to run on and then you can give the users the functionality. And so so where this gets practically speaking right is integrations, right? Okay, cool. You launched your own, uh, let's say a sharded blockchain. Well, now you need to integrate every"
  }
]