[
  {
    "speaker": "Andy",
    "content": "able to That liquidity should be able to be distributed amongst whatever chain That tho those users want apps want to use applications on. It shouldn't have to be like I come to a chain and I use that chain. And then other chains have to fight for my liquidity with these games and things. It should be If if I want to use this app on this other chain I'd just go there. And it's just my liquidity's there as well. So um, I think the the I think the chain of abstraction. I think you've talked about this, Ilya, has bigger ideological impacts than just a UX impact for the way that people are going to be building in the space. I think we're kind of touching on this a bit."
  },
  {
    "speaker": "Guest",
    "content": "Exactly. Yeah. I mean I think it it changes your like instead of I mean in instead of having this argument is like oh should I launch a separate chain or not. It kind of changes this argument away from because like the reason to have that argument right now, right, I mean, we we talked about sovereignty and other things but it's more around like oh if I launch my own chain I can get a better valuation, right. That's like that's that's where like a lot of this right now like, oh Layer 2's got like premium, Layer 1's for giving premium before, right. So like, let's do this."
  },
  {
    "speaker": "Guest",
    "content": "Is that why Near launched its own chain?"
  },
  {
    "speaker": "Guest",
    "content": "I mean, so the hon honest thing was this is 2018, right. We We looked at a lot of blockchains. We obviously, you know, Bitcoin, Ethereum. We originally wanted to do like payments for crowdsourcing for data. Right. We actually wanted to build I mean like what would be a version like a Bitcoin style you know few generations before what Bitcoin was, like paying for work for people like um, and kind of allocating that. But you know, we looked through all the blockchains, none of them actually would work. Right? None of them would scale, none of them would be cheap enough, none would be easy enough to onboard new users. And so we're like, cool. We We then went and talked to Ethereum folks as well and we're like, oh, you know, you guys are thinking about sharding. We can do sharding. Uh, we can build sharding, like my co-founder built a shorted database, you know, I worked on a lot of kind of uh, scalable stuff as well. We had like a bunch of folks we could bring, you know, what do you guys think? Should we like build it as part of Ethereum? How would that work? And the answer was there was no like way to make that decision to kind of get external team to build something uh, at least at the time. And so yeah, I mean we ended up kind of uh, and we already we We had already VC funding from before from when we were doing AI stuff, so we needed some some like VC back model. So indeed, like the incentives of you know VC back model led to that. Um, if there was a way to just like contribute to Ethereum and receive part of Ethereum allocation, for example, Ethereum supply for doing that. I would actually prefer to do that. So, having such a mechanics, I think it's very important."
  },
  {
    "speaker": "Andy",
    "content": "That's the thing about the lack of a kind of like a top like a or a bottom-up uh I think is what they call it like a set-up for Ethereum rather than having like a a single like you know kind of way of coordinating, um, it can be a little dysfunctional. Now, um, let's kind of shift gears into the AI. Rob, would love for you to get involved here as well. Um, Ilya, why does none of this conversation matter in a world of AI in the next two years? Why did we even just spend 30 minutes talking about this?"
  },
  {
    "speaker": "Rob",
    "content": "Welcome aboard on our journey into the singularity. This is the end-game roadmap for Frax and Fraxtol: the new L2 out of the Frax ecosystem that is totally based on fractal scaling. Fraxtol is a modular L2 blockchain, built by Frax, with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images, and it explains how L2s become L3s and the entire app chain lifecycle goes through its evolution. The Frax ecosystem is made of some of the top builders in the space and has stemmed from its OG days of the Frax stable coin. It is now in the LST space, the LRT space, and this Fraxtol L2 joins the existing suite of Frax products, including Frax Swap and Frax Lend. You can see Frax Ferry, the bridge to go from any chain: Arbitrum, Optimism, or Mainnet, into the Fraxtol mainnet. Bridge your tokens, and bring your Frax assets into the Fraxtol ecosystem. Join today to get the best out of Fraxtol. You are still early. Join today, take part in our expedition into the singularity."
  },
  {
    "speaker": "Guest",
    "content": "No, so I think uh to be clear, like a lot of this things I actually do matter. I think some of the accents will be changing, and and and some of the things is actually hard to predict even even as we're working through it. It's kinda hard to see what things will happen at what timeline, right? And again, this is like I you know, worked on transformers in 2017. In 2017, we thought, okay this is happening, you know, shit shit is here. And then it took like, whatever, four years for this to mature, to scale. And you know, we're a couple of years in, and like, we see we see the progress, we see the momentum, but we're still like, you know, do we have AGI tomorrow? No. Like will we start ramping up into a lot of interesting things over next couple of years? Yes. So um, yeah so I think maybe just on the AI side, there's probably two important concepts. So one is uh, we've been talking a lot about um, is user ownership, right? So we talked about it on blockchain side, but it's also as important on AI, if not more important, because right now, all AI models are trained in kind of for benefiting the com company, corporation that trained them. Right? And all of the you know, all these big labs are really big public companies. They all need to you know, post more revenue every year, every quarter. And so they need to actually, you know, increase how much revenue they're getting, and remember, most of them already maximized their target market, right? It's not like they can add another billion users to their uh audience. So they kind of need to actually get more money out of the same users. Right? So so all these AI models one way or another, will be used to actually extract more money from the same users, right, which are us. And so so that's I call it like corporate AI. And so we need a version that's actually more focused on you, right? And kinda again, gives back so sovereignty back to the user. And so this is what we call user-owned AI. And so user-owned AI builds on top of user-owned infrastructure, right? The user-owned data, user-owned assets, and so you kind of like linking all these pieces together. Now, um the other concept is eh what we actually worked at Near AI back in 2017, is AI development. So the reality is kind of the current interface, like as a software engineer, you write some code, you know, you're you're learning the machine learning uh you you're learning the machines interface. But what kind of this AI models are showing us they can do, they can teach machines to talk in our way, right? They can teach them semantics of our own world and and kind of language. And so what a transition is happening, and again, I was too early on this in '17 but I also for context I've tried to build my thesis around this back in university. That was also too early. Uh, but I've been trying to do this for for yeah many years now. But the the reality is, like we will be able to tell computers what to do and they will do it, right? And they will write code to do it for themselves, to communicate with each other. And so a lot of the coding process will be replaced from needing humans to be like, you know, anyone can actually um, build software. Now, that changes how we interact with computing. This also changes some of this cost structures right, if we're talking about like, you know, how much it costs to maintain infrastructure, if you can just like talk to a machine to tell it what to do and to rewrite you know, half of the software around you, well the cost for that will be way lower. So that that's an important, you know, note there that some of the uh costs and speed with which you can do that will change. But at the same time, so those are the two really important concepts and that's actually what we're working on at Near AI is like we've kind of building the infrastructure stack for user on AI together with a lot of projects in the ecosystem, right? So we're not trying to do it ourselves. We have, you know, incubator. We have a lot of projects we're collaborating with. They're plugging in into the platform we're building. And we also offering it to for people to use, so And we kind of have a alpha right now that's that's running. And then on the other side, is like we're using this stack to make progress on the research of how to build the AI developer, right? And uh, you know, from what we see now, the front-end part is getting easier and easier, right? We already see like you can build front-ends on a fly, you can like click on a button and say this button should like send a transaction on chain. Boom, you know, it wrote the code for it, now it works. Right, so that part, like similarly you know for smart contracts, like some outlining logic etcetera. It's not there yet, but there is a lot of uh interesting work there, and there we also testing a lot of for modification. And this is the other concept. So most of the code right now has bugs. Uh, like the software we're using right now has bugs, right? And some of these bugs are critical when-"
  }
]