[
  {
    "speaker": "Bo Du",
    "content": "So like if if all of them are offering these these uh these incentives and everyone's kinda like like hustling to like move their like like funds around to all these different apps to take advantage of this, people are complaining about the same thing. Like can we can we like have uh like trading app abstraction in the real world across all these different trading apps?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Sometimes you forget that uh we're we're like we're competing amongst the the the minds within the space who are just want extreme speed, ex- extreme security, just everything to to the extent that like but then you you compare and you're like, okay, yeah. Like in order to go from TDD, I have to go to my bank, then I have to go out. And that whole process takes a little while, um you know, as you're alluding to. And no, I think that that you have something to add there as well."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I think fundamentally crypto like ends up The crypto industry itself ends up drifting towards solutions that kinda of match how crypto attention is done as well. Like in times of big hacks, people drift towards security. In times of slow bridging time and people needing to go to different chains, different worlds whether that's like an incentivized testing or stuff like that. You see people drive towards it very quickly, and I do think that's how crypto It's just how crypto as an industry is kind of done, and I think it's a part of it is because it's such an open industry where Like in most other industries it's like if there was an issue Um like let's say there was an issue with Robinhood like a button broke um on the Robinhood backend. You'd see some posts on the Robinhood subreddit. Robinhood itself would know that there's an internal issue, and they might have a uh slack ticket that gets opened up. But like the rest of the industry doesn't call out Robinhood and say, \"Oh my gosh, they had a broken button!\" Versus in crypto, everything is so quick to react on everything I think that because of that, you kinda of end up having crypto I think has this large swinging effect where opinions can shift very quickly based off of if users aren't happy with their current option. That's why they really drive towards like say it like the bridges. Like the bridges right now are quite slow, and users are heavily driving towards, \"We need faster interoperability.\" And I do think having that like fast product market feedback um is great in crypto, but I also think sometimes you end up with like too much so on the extreme, so I think that like I think better guarantees around interoperability across chains is crucial. But I do think that like we also won't get to real-time ZK for a long time. I think crypto has kind of said that we're going to get to real-time ZK relatively soon. I don't think the financial incentives are going to get there as soon because I We forget that there's only so many applications that can leverage these things, and there's only so many companies that will pay uh tens of millions of dollars per year to integrate things like a real-time ZK special chip into the computer. So because of that, you don't end up having I think crypto sometimes like says we want something that's really far in the distance. And you know, almost we get too excited, and then the stuff that's here today that was a leap and bound from the prior experience kind of gets lost because we're looking for the stars, and we forget what's here."
  },
  {
    "speaker": "Bo Du",
    "content": "So so maybe so this is um a certain perspective coming from like web 2 that as an engineer, I love it. So the fact that people celebrate these like technical things and these technical achievements is amazing. Like super interesting. Like I I love ZK. I love all these technologies. But then I think about it from like a like a product and user perspective, I'm like actually users don't really care about like like all this stuff. They they they just have certain things that they want to do at certain costs, at certain thing you know they have certain expectations around like using a product. And to Noah's point like not every company like wanting to pay for this sort of thing. Like sure, like ZK may make sense for you know if you're doing like really secure DeFi things, where there's like a ton of value being transacted. But maybe someone just wants to build like a poker game between like him and his friends. And sure, like maybe you know some of the nodes will be malicious and maybe cheat his friends out of like a $20 bet. But like it's not creating enough value for you know for every state transition have to pay like a few dollars to generate a ZK proof or even like tens of cents to generate a ZK proof. Uh it's just not worth it for that for that particular application."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, that's like I feel like just this these this roll-up cluster idea was is like a super amazing like uh uh idea and it's it's it's an incentive structured thing that these that these roll-ups have created for themselves, just because that's what they've what they've wanted to do, but it's like an engineering feat to be able to have uh this really good interoperability and UX within these clusters. But like now like people like me are just going on Twitter and I'm just like shitting on on these these clusters for saying walled gardens and like oh, calling out these L2s for not decentralizing their sequencers and you know, I'd like to get into that uh as well. But but first, just kinda like understanding the uh uh understanding the kind of state of these clusters now, like and differentiating them. Like would you guys consider the idea of of Aglayer as similar to like Superchain and um uh you know, like like Arbitrum Orbit or these like two separate kind of categories in in your your mind as far as like what they are?"
  },
  {
    "speaker": "Guest",
    "content": "So I can probably touch on that better. We've worked closely with Polygon uh on this side of things. Polygon plans to have Aglayer support multiple different ecosystems, multiple different chains, multiple different VMs. Uh recently, they came out with an integration of Movement. Part of that, we announced integration with them a couple months back. Um, so I view Aglayer as being much more so of like an open open situation compared to some of the other walled gardens. I don't necessarily think that all of the walled gardens are going to be the worst thing ever. I do think walled gardens in general need to be avoided, but I I I understand where they're coming from. And I think fundamentally it comes down to an incentive structure that works. The way that we've thought about it is we went Well, actually, I can tell the story of how we built Nodekit. So in May of 2023, we started developing out the first version of Nodekit. We wanted to decentralize the sequencers. And what we realized once we were able to build out a decentralized sequencer was it's fundamentally an incentive issue. Solutions that just say like let's decentralize in orchestrator, orchestrating Kumbaya. It just doesn't work. And that's like the harsh reality of it. And the reason why is because roll-ups need to earn money from decentralizing their sequencers, and that cannot be through some like um short-term benefit. It cannot be like, \"Okay, we'll pay you a million dollars in a grant, um, and we'll decentralize your sequencer,\" which I have heard of some teams doing where they're giving these large grants um and saying like, \"Well, you're going to join our network, our network, and we'll just figure it out over time.\" And I think that the way that we thought about it internally is you need to have a revenue split. So whenever there is a cross-walk transaction, we do our transactions in this shared top of block. And our bundles The fees are distributed pro rata to the roll-ups involved in the bundle. So if we, for example, have Polymer and another roll-up, and Polymer is in 70% of all of the bundles, and there's only one other roll-up that's also on the network, let's say there's two roll-ups on the network. Then Polymer deserves a greater split of this of the fees because Polymer is in 70% of them. And the other roll-up, and let's say there's three roll-ups, and Polymer's in 70% of them. Roll-up two is in let's say 20%, and roll-up three um is in the rest. There like some breakdown of it. We view it as you need to allow for cross-walk revenue redistribution on these atomic bundles across chains. And we believe that's how you get people to adopt these standards. I don't necessarily think that teams will decentralize and go into a shared sequencer structure unless it meaningfully impacts them in a way where they make more money. And that's why we've seen the majority of our customers came for Javelin and want that single block communication and want that atomic execution across chains. I think that that's I think that's one of the major issues in crypto right now is people think it's more so about like not the financial aspects of it, and I think financial aspects is how a lot of these different like webs of networks make sense for people long-term. But short-term grant doesn't necessarily help you if long-term you'll make less money off of the protocol, and we've really prioritized making roll-ups more money when they join a network rather than if they did it themselves. Yeah. That's how we think about it."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, just that like It's funny because we kind of framed this initially as like Superbuilders versus IBC, but like those are two fundamentally different things. Like trying to solve two different problems. Like Superbuilders go on top of IBC and make it better. Like these are two complementary solutions. IBC is great for asyncInterop. Superbuilders come in, and they can synchronize a lot of that and make it atomic. And so I think at a fundamental level like both of these are great solutions for their respective problems."
  },
  {
    "speaker": "Bo Du",
    "content": "It's um you know like like from IBC's perspective it's just another  another transfer layer protocol, just a messaging protocol. So it's advantages that would be like you know as these traditional work starting adopting IBC adopting TCP/IP, not IBC. Started adopting TCP/IP for even local area communication. Uh it started kinda of lead lead them to be, \"Okay, now we can it's easier for the developers. They don't have to develop over all these different interfaces.\" The way you communicate locally, which has which is highly performant, and the way you communicate remotely, which is somewhat less performant because the you know things are just further away. Um now becomes uh similar. And um maybe I'll take a step back."
  }
]