[
  {
    "speaker": "Rob",
    "content": "What led to that decision to go from general purpose to a stack?"
  },
  {
    "speaker": "Guest",
    "content": "They're trying to build their own kingdoms and take away from Ethereum. What's your response to that?"
  },
  {
    "speaker": "Guest",
    "content": "What's the biggest L2 for using Arbitrum?"
  },
  {
    "speaker": "Guest",
    "content": "Point is it doesn't matter, right? 'Cause like the gaming fund doesn't care about transactions."
  },
  {
    "speaker": "Rob",
    "content": "GM, GM. What's up, guys? We are here with two of the...not just two but three of the the roll-up clusters that are absolutely uh, defining the game here. Uh, we have AJ Warner, we have Ryan Wyatt, and we have Jill, the lovely Jill from Espresso. Um, to bring us here to talk about something that, you know, I think flies under the radar a little bit, you know, as as much as uh, Optimism and Arbitrum have gone under the microscope when it comes to tech and sequencers and incentives and tokens and all this good stuff, we don't talk a lot about the business models and the licensing models. And so Jill's thread, I'm sure we'll we'll pop it up on the screen, The Fork in the Road, uh, is what brought us here today to talk about some of the divergences and, uh, maybe some of the ways that Optimism and Arbitrum are similar in this regard as well. And so Jill, you've been on the show. I think you're going to be helping me moderate and and co-host today, so appreciate uh, you doing that. Um, Jill, maybe you could you could kind of, before we kick it off to AJ and and Ryan for some intros, maybe Jill, you could kind of fill us in on, you know, the inspiration for why you wrote that thread, and then ultimately, you know, why why you felt it was important that we have this conversation."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, absolutely. Thanks for uh, letting me butt in here. Thanks for letting me co-host, Robby. Uh, and it's great it's great to be able to have this conversation. I think I'm going to learn a lot as well. Um, so I'm one of the co-founders at Espresso Systems. We're building infrastructure that's used primarily by roll-ups but can be used by any chain for improved interop and composability. We've variously been called a shared sequencer, a confirmation layer, um, we're working with roll-up teams that are using us for all of the above and also for DA. That means that I spend most of my day talking to roll-up teams at various stages of development, in both the OP ecosystem, the Arbitrum ecosystem, and a lot of the other ecosystems out there as well. Um, and so I get to have kind of the frontlines of what their decision-making process looks like. And, as you said, a lot of that does come down to tech, but a lot of the conversations I have with them, as well, also come down to longer-term business model considerations, distribution considerations, the type of support they expect to get from each of these ecosystems. And, uh, that's what prompted me to write the initial thread, which I'm sure we'll link in the show notes, that uh, was trying to cast some light just on what these considerations look like. Now, again, I'm someone who is, you know, spending a lot of my day on these types of topics, and even I got some things wrong in in that thread. And so, again, hopefully I'll learn some things and hopefully uh, the audience tuning in here will learn some things as we go as well."
  },
  {
    "speaker": "Rob",
    "content": "Amazing. That's the goal, is to learn something here. I I hope everyone takes away something here that they uh, that they've learned. And so, yeah, AJ, Ryan, appreciate you guys coming on uh, from the Arbitrum and the Optimism uh, uh, foundation respectfully respectfully. And uh, yeah, because it's your first time on the show each of you guys, would appreciate an intro. Um, maybe we'll just go in alphabetical order. AJ, want you to uh, kick us off."
  },
  {
    "speaker": "Andy",
    "content": "Sure. Thanks so much for having us on, Robby. Appreciate it. It's going to be a ton of fun, and Jill, for co-hosting. It's always always a pleasure to hang out with you as well. So, um, really excited for this. One just quick clarification, so I don't work at the Arbitrum Foundation. I work at Offchain Labs, which is, like, for developers within the Arbitrum tech stack. But um, I'm quite familiar, so, obviously, talking in personal capacity on behalf of the DAO, but um, a little bit about me, I've been at Offchain Labs for more than, a little more than four years now, um, building out the ecosystems since before the original Arbitrum Alpha Testnet. Um, been a hell of a journey um, a ton of fun working with builders across, you know, apps, infrastructure, you know, scalability, etcetera, and I'm really excited for this conversation. I'm sure I'm going to learn a lot about uh, Optimism business model. Like, you know, Ryan was saying before we got on, we're all kind of iterating as we continue to move. So this this should be a lot of fun."
  },
  {
    "speaker": "Guest",
    "content": "I'm Ryan. Thanks for having me on. I'm excited to be here. This is fun. Jill, thanks for making it happen. Uh, I've been at Optimism Foundation for a year. I'm our chief growth officer. So, you know, looking after kind of our broader business."
  },
  {
    "speaker": "Rob",
    "content": "Awesome. Cool, guys. That sounds great. Let's get into it. Um, you know, there's a lot of similarities and a lot of differences here uh, between Optimism and Arbitrum, two of the most prominent roll-ups in the space, both of them based on Ethereum, inheriting uh, Ethereum's L1 confidence uh, and then and then ultimately scaling Ethereum, as well as the blockchain space in general. Um, you guys have two very different brands, have been kind of known for two different things. And so I think that's been, uh, part of the...That's been a factor in both of these roll-ups flourishing in their own right. Um, and so I think one of the, one of the similarities here uh, that that we have is both of you guys started out, uh, as your own general purpose roll-up. We had Arbitrum launch Arbitrum 1. We had Optimism launch the Op OP mainnet, um, and then eventually these evolved into, you know, you each of you guys have your own stack. We have Arbitrum Orbit and all of its components. We have the OP stack and the Superchain, and we have a lot of buy-in from from L2s into the Superchain. And so, the the open question here for for, you know, whoever would like to go first is, what influenced the decision, what inspired you guys to make the transition to go from general purpose roll-up into a stack that allows anyone and everyone to go in, deploy your roll-up, be opt in, be part of the Superchain or this Arbitrum Orbit ecosystem? What what led to that decision to go from general purpose to a stack?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, I could jump in. You know, I think the big fork in the road for for both Arbitrum and Optimism, you know, for for us was realizing that you know, one single blockchain isn't going to scale Ethereum and that we wanted to really go towards what this horizontal scaling look like. So that was really the bedrock upgrade. Removing thousands of lines of code to make it as you know equivalent as possible, to make it really easy to build. You know, our philosophy was, how do we get other L2s to build using the OP stack? And that was a big change in direction, uh, for Optimism. And and obviously the Base deal which I have no doubt we'll talk about and cover at some point, was uh, you know, was a big part of the first step in that direction of, are there other L2s that want to launch? Do they believe in this idea of horizontal scaling? Are they going to be okay with operating under a very specific configuration of the OP stack in order to achieve interoperability? I mean, there's like, a lot of things in there. There were there were big jumps, you know? Like, if you look at positioning, you know, on the other side like like an Arbitrum. It's like, 'Hey, you can customize everything, you can do anything you want.' There is, like, a a shared standard that people have to adhere to. Uh, it does actually have limitations in what you can do, and coming together to say what are those limitations, how do we get through them, how do we build together, and aligning them was really important. So like you look at Uni-chain you know, fast block times is a big thing for them, right? Like so, all of a sudden Uni's going to be you know helping the OP stack upstream all of these different changes, and then everybody benefits from it across the same. And so, it's been a really different way of thinking about it. You know, I think if you look at kind of Arbitrum has done, like, an incredible job with like the L3 ecosystem. They're saying another alternative way to have scaling, even L3s like Orbit settling to Base. Um, we and, yes, you could be an OP stack chain and do the same, but you know predominantly OP stack is largely used for L2s and that's, like, our focus. Our focus is, how do we horizontally scale? How do we get a lot of players that want to have their own L2 to deploy an OP stack, all the different fraud providers, supporting OP stacks so that people can just, like, up and running, get going. Um, and so that that's what we're offering. And and some of the limitations, the benefits are, you know, we can offer shared security. We can offer shared upgrades. We can offer these folks a path to Stage 1 and inevitably Stage 2. And so we think you know, we're we're getting there. So there's, like, a unique value prop that's really starting to, you know, uh, to to pop up, and and our our focus has been L2s. You know, like, we're not really, we're not ever, from a from a foundation perspective, and even from, like, the DAO and and the Grants Council and all that, there isn't really a focus on L3s. And so I've actually seen this really interesting, you know, there's a, there's, like, the competitiveness between, oh, Optimism and Arbitrum 'cause I think there's a longstanding, you know, that that relationship has looked. But to be honest with you, I think the dynamic has changed drastically, and it's been cool to see how, like, we're all starting to talk together about,  "
  }
]