[
  {
    "speaker": "Rob",
    "content": "How do we have broader interop outside of these clusters, and some of these bigger conversations? So at that long window, that was kind of the big change, was like we're much bigger than one chain. We need to focus on how we build a broader ecosystem to scale Ethereum, and that was kind of the route that optimism chose to take. And this was about you know, 2 years ago."
  },
  {
    "speaker": "Andy",
    "content": "Um yeah, that that's pretty good context. I think from the Arbitrum side, um it, the evolution's been a little bit different. So it's funny. The original version of Arbitrum, if you look back at the Arbitrum white papers, was many deployments of Arbitrum. Like, people would open an Arbitrum instance and close it when they finished what they wanted to do, and open another Arbitrum instance and close it. And we quickly realized there wasn't product-market fit for, like, a system like that. And then it evolved into sort of like, um, the original Arbitrum chain, which was Arbitrum One. Um but even if you look at like, and I think, you know, Ryan made a good point and pointing out, like, sort of the differences in how we're thinking about scaling. People kind of forget because, like you know, with sort of 484, and Orbit's launching, like it hasn't, you know, sort of found its prominence in the same way. But like we launched Arbitrum Nova um, almost 3 years ago at this point. And, and that was like a second Arbitrum chain already. And the vision wasn't to have like a second chain and kind of stop there. We recognized, I would say with Nova when we launched AnyTrust, which was like the original ALT Layer form of Arbitrum, that there's going to be people who want a scale, and they're going to want to be able to make parameter changes um, that match their business use case. Right? So like, when, when Ryan's talking about like in the OP Stack, you know, forming the shared security, you know, he rightfully pointed out that there are tradeoffs to that. I think Arbitrum's taking a very different philosophical decision that if you're launching a chain, it's a part of your product, it's a part of your application, it's like it's the whole thing. And you want all these things to match that. Right? So for example, when we launched sort of the Orbit SDK, one of the things that we really prioritized were like, you know, obviously people are free to customize it however they want, but like, out of, out of the box, like things like custom gas fee tokens, because we're seeing that, like, a lot of, you know, gaming use cases in particular want their native token used. We're going to start seeing some consumer chains want like stable coins, like USDC, just being the, the custom gas token. So things like that, things like, you know, what DA are you using, right? Like, any trust is really good if um, if you are extremely cost sensitive. Um, to like sort of L1 blob fee increases, for example. Right? And being an L3 versus an L2 can sort of depend on, like your architecture. So like, our kind of thesis on this has been like, how do we allow the rollup to be a part of the decision-making at the product level? Right? There's definitely tradeoffs between, like, what Ryan was describing on like interoperability and shared security, and what we're doing. And I think like Ryan's right, we're taking different paths. I think that what I like about the Arbitrum path is that it allows the developers and builders to continue to innovate at the stack level. And we're seeing that become, like, more and more important, as, like, blockspace is abundant, right? There's no like limitation of blockspace right now. So I, I almost like, I like to call it like a permissioned blockspace. You want, if you're creating more blockspace, it should have a reason to exist, and allowing teams to be able to customize it to match what they're trying to build at the application level, for us, felt like the most logical way to, to do that. So, yeah, um, kind of always like the vision to have it. I think one of the differences maybe also is, like, and you know, Ryan, you can correct me if I'm wrong, obviously, is probably like the role of like our main chains within the ecosystem. Right, like Arbitrum One is like, in many ways, I would say, like a hub. In the same, like you know, in OP, I feel like, maybe Base is that hub, or maybe there's multiple hubs, like, I think it's like a very different model, instead of, like, hub and spoke, it's you know, I think you guys often show this as like a circle. Um, so I think that's also a little bit of a difference in terms of, like, the, the, the central role of, like, the core public chain as part of this broader."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, no, I'll say, there's probably two things that for, for, to comment on. I think the thing about customization is you can MIT open license OP Stack. So, people are forking it, you know, a bunch of different chains doing all different kind of crazy, fun things. You know, look at what Synthetix is doing. People at what they're doing with custom gas tokens. Our goal is saying, is there demand for this? You know, as people experiment, as they fork it, and can we upstream this into our standard configuration? Do we want to bring this into, actually, a standard config? So we, we kind of feel like we're getting the best of both worlds, where we're adhering to a very like, you know, a very, it, it is a very strict, shared standard that we have over here. But by having MIT open license, where anybody can go run with it, they can go do anything with it, you know, you got Glass that's on OP stack, you could go do all these different things. That's you know, we, we're seeing where there's actual demand, and we do want to meet that demand within the shared standard. So, you know that, I think there is a path where we can at least still observe, uh, what people want in the stack, how they're utilizing it, how we can upstream those configurations to make it part of the shared standard. The other thing is yeah, the hub. Like I kind of, you know, when you look at Arbitrum, it's, is more like vertical, right? Everything needs to come down to this, like, main hub, where there's like a bunch of liquidity, and a bunch of TVL on that Arbitrum Finance. We, when we look at like what does success, success metrics look at optimism, we're looking at the super chain. Right? So, how much TVL is across the super chain, how, you know, how much stable coin percentage, what does, like you know, liquid staking, or restaking, how's DeFi look across it, how's gaming look across it? And we look at all of the chains as, like our children, and in fact, we make sure to, like, not bias towards OP Mainnet at all, right? And so when we're doing, you know, grants council, and our governance programs, like, they're looking at how are we driving contribution across the super chain. There's two reasons why: like, obviously generating sequencer revenue comes back, you know, to the collective, you know, the sequencer revenue is going to, continue to decrease, at least for now, while, you know, we're increasing gas targets and gas limit transactions are getting cheaper. And obviously the hope is you know, we start the 100x as an industry. How many transactions are coming in? And you start to see that actually spike back up long term. The other thing is like, interop, you know, our goal with the shared standard, and what we're launching, um, this year, actually 2025, is you know, starting to actually make super chain and interop a real thing. You know, like, super chain means a lot of things to a lot of different people. Interop is one of the like, very tangible things that we need to make a reality. And so, starting to connect two or three chains in 2025, where they have seamless interop, will be a whole new experience for application developers. There's an opportunity to monetize interop long term. And so, you know, I think we're just like, uh, we're at a place where the health of the, the, the ecosystem, is the Optimism Collective, and, like, we need to focus on all of that. There's downsides to that, you know? What if somebody leaves the super chain? What if they depart? You know, how, how does that look, right? Those are, like, acceptable risks, because I think in the long term, you have to build something that's, like, very compelling, that people want to opt into, that want to pay fees, right? Like, you have, uh, you offer a free version of OP stack. You don't have to talk to anybody, you can go launch it, you go do whatever the hell you want. So, like, it is abundantly clear, that if they are going to pay revenue to the collective, what are they valuing right now? In the short term, it's very clear. There's incentives, there's just like network effects is overall. I mean like, of course, we're in very early stage, all of us. I mean this is, this is a very small industry. There's not many users on any of the chains. Like, when we talk about who's winning, nobody's winning. Nobody has any users. It's very small right now, right? So like, we're actually trying to get what we want to go. We got a long way to go, and so we're optimizing for growth over the next two, three, four years. Uh but obviously at some point, you know, that, that needs to turn into something very real. So that's, that's what we're focusing on right now."
  },
  {
    "speaker": "Guest 1",
    "content": "Ryan, can we unpack a little bit more, uh, just, optimism is many different things, right? You have the OP stack, which as you mentioned, I understand is MIT license, which, for the audience, is kind of the gold standard of open source, right? Like fully free and open, anyone can take it, run with it, use it for whatever they want. Exactly build off of it, monetize it any way they want. Then you have the super chain, which my impression is, as I understand it, is kind of the, the core business, if you will, of what you're all doing at OP labs, on the foundation side. Um, and when it comes to the super chain, as you mentioned kind of at the top of the episode, there are these limitations, or at least shared standards that are expected of the builders within the super chain. And some of those standards have to do with commercials, of how they're sharing revenue back to, uh, the overall kind of ecosystem, and the parents. Um, some of them are more technical in terms of what changes to the stack they're upstreaming and you know, what, what they can do. Can you talk a little bit about the interplay between those two things, and I guess either validate or invalidate whether I'm right in saying kind of the super chain is more of, like, the business model, and then the OP stack is, yeah, it's kind of the, the open-source technology side of it?"
  },
  {
    "speaker": "Rob",
    "content": "No, you're, you're, you're pretty much right. Like, the way you think about it, is like, you're a chain operator. There's two journeys you can take. You can just fork OP stack, it's, it, you can go do whatever you want. Base is a great example of that. They don't pay any fees to the collective, they utilize the OP stack, they run the chain that way. Right? That's like a perfect example of, like, that path. And then you have the OP stack, where I'm going to adhere to these shared standards. I don't know that I would necessarily, they, they, you know, there are limitations in customizations, but I don't know that they're limiting any of the partners, right? Like, uh, as far as what they want to do, and what they're trying to accomplish. Um, but a lot of it is theoretical. "
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I guess this a theoretical statement, like, theoretically, it can be viewed that way, but I don't know that it's."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "And it's true, right? Like, the, the thing about the."
  },
  {
    "speaker": "Rob",
    "content": "And it's true, right? Like the thing about the OP"
  }
]