[
  {
    "speaker": "Guest 1",
    "content": "some other feedback that you've gotten, but maybe you can talk us through that."
  },
  {
    "speaker": "Narrator",
    "content": "Redstone, Modular Oracles are available on 50-plus chains. Trusted by over 100 clients and over $6 billion in total value secured. Visit redstone.finance to find out more."
  },
  {
    "speaker": "Andy",
    "content": "Welcome aboard on our journey into the singularity. This is the endgame roadmap for Frax and Fraxal. The new L2 out of the Frax ecosystem that is totally based on Fraxal scaling. Fraxal, the modular L2 blockchain built by Frax with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images and explains how L2s become L3s and the entire app chain life cycle goes through its evolution. The Frax ecosystem is made of some of the top builders in the space and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space, and this Fraxal L2 joins the existing suite of Frax products including Frax Swap and Frax Lend. You can see Frax Ferry, the bridge to go from any chain, Arbitrum, Optimism, or Mainnet, into the Fraxal Mainnet. Bridge your tokens and bring your Frax assets into the Fraxal ecosystem. Join today to get the best out of Fraxal, you are still early. Join today, take part in our expedition into the singularity."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, I think like a lot of this comes down to I think the fundamental um philosophy of of the of the business and the business um business risk right? So um like like Ryan said, like OP MIT licensed value creation, very light on value capture, then having a mechanism like the super chain for like building a business and value capture. And I think the philosophy within the Arbitrum ecosystem is we've built this incredible tech stack that has a ton of demand. Like Ryan was talking about the 250 millisecond block space times that like Uniswap wants. We've had those for like three years. We already have people at a hundred millisecond block times like iterating for like derivatives and stuff. So, we've got this great stack with Stylus now you can use rust, C C++ like really like a, you know, a good stack for developers to build and that is what we're good at. That is what Arbitrum ecosystem is good at. That is like the main value proposition of what Arbitrum ecosystem has to offer. Um which is a very good technology stack. And we think that again and it goes against sort of maybe the core um MIT license philosophies is if you're good at building something, that's the thing that you should be selling. Right? And of course we want to be an ecosystem and an environment where people have access to the code, they can make modifications of the code, they can upstream things to the code. So, we built this unique sort of I would call community source license concept. It's actually quite cool. It's pretty novel like I don't think anyone's done it before. Um we're basically if you want to launch an L3, it's permissionless. You don't have to talk to anyone, you don't have to pay anything. And the thought process behind it is, and you can make any changes you want, right? So you can do whatever you want to the stack. And the thought process is it has natural alignment with broader Arbitrum stuff. Which is, it settles the Arbitrum One. It has you know, transactions that settle as bridging, has all of these sort of hub and spoke like um business model components. Um and that was where the Arbitrum Dow had started where it was permissionless to launch an L3. If you want to launch an L2, you need to have permission from the Dow. And the Dow came together and realized that was a little bit restrictive in the sense that the goal is not to stop people from building whatever they want. The goal is to enable people to build whatever they want, and we want to remove the frictions of allowing people to build whatever they want. But how do we do that in a way that still aligns with the Arbitrum business model. Right? And the business model allows So, the new version which is the one that exists today is you can launch Arbitrum technology anywhere. If you launch it on top of Arbitrum One, you don't have to pay anything. If you launch it on top of L2 Ethereum like Ryan said. If you launch it on top of base, you can launch it I think even on top of OP Mainnet. I don't know if anyone's done that. We got people who are testing launching on top of bare chain. We've got people who are launching on top of Ton. You can launch the tech stack anywhere. And if you're going to do anything other than launch it an Arbitrum One. And it's permissionless, you can do whatever you want, you have to pay 10% of like your profits. So, um the goal is like how do we let people do whatever they want, have them naturally align with Arbitrum. And again, this is one of those sort of distinctions I would say between Super Chain vs. Orbit. If you're launching orbit anywhere, whether you pay 10%, you don't pay 10% you're part of the Arbitrum family. Right? You're eligible for grants, you're eligible for incentives, you're eligible for investment, you're eligible for growth, all of these things, because the way we're really thinking about growing the Arbitrum ecosystem is not um let us invest in you and get like a sequencer share back. It's, how do we expand the economic zones of opportunity for Arbitrum to take advantage of. So for example, the Arbitrum Dow. And you know there's there's been a lot of talks about about whether this is you know been successful or not. Um, the Arbitrum Dow launched and it hasn't deployed any capital yet. It got a $220 million dollar gaming fund. Um it's actually an extremely interesting and unique concept. The sole LP and it's been a ton of legal work. The sole LP of this is the Arbitrum Dow. So like literally the Dow is the LP of this multiple hundred million dollar fund. And they're going to be deploying that um investment and grants. There's a whole component of that into gaming. And their mandate is not grow gaming on Arbitrum One. Their mandate is, what is the economic zone of opportunity for Arbitrum? And how do we add leverage to builders? So, they're getting deal flow from teams like Zy. They're getting deal flow from Ape chain. They're getting deal flow from teams that are launching um like Guys launched on um on top of base. And it doesn't matter, right? Because the business model is how do we take the Arbitrum Dow, the assets that it has, and turn that into leverage for people building on top of Arbitrum. So yes, like you can be an L3 and you don't pay, you can be an L2 and you pay 10%. And the goal is like not to monetize that way, it's to have alignment with everybody using the technology and then add leverage. And I think it's a very different model. It's the way I like to think about my vision for the Arbitrum Dow is it's a it's a digital and decentralized sovereign wealth fund. Right? So you have natural resources which is the Arbitrum block space. You want that block space to be everywhere. And you want to make sure that that block space and that use case can have as much leverage as possible from your ability to add for it to have success. So"
  },
  {
    "speaker": "Rob",
    "content": "AJ how much is that 10% you know, like you're going to spend $200 million across all these different gaming you know, L L3s you know like what does that revenue look like from the 10% profit?"
  },
  {
    "speaker": "Guest 2",
    "content": "The 10% is pretty"
  },
  {
    "speaker": "Rob",
    "content": "Is it basically cause the revenue, is it there is it there, like when you say profit is it like like if it's a game in the NFT sales, are you participating in that revenue?"
  },
  {
    "speaker": "Guest 2",
    "content": "So so yeah, so so the 10% is is the sequencer profit. Right?"
  },
  {
    "speaker": "Rob",
    "content": "Okay so for L3s you're basically you're not getting anything for these L3s."
  },
  {
    "speaker": "Guest 2",
    "content": "Well well you are in the sense that like they settle, and a lot of them launch tokens on Arbitrum One and then they have like cross-chain bridging. So for example, Zy has probably done like 10 million transactions on Arbitrum One even though it's an L3 um chain on top. So you do get some of it."
  },
  {
    "speaker": "Rob",
    "content": "What does that look like? How much is that? How much does that kind of generate then for you all in revenue?"
  },
  {
    "speaker": "Guest 2",
    "content": "I don't know the number off the top my head but the point is, it doesn't matter. Right? Cause like the gaming fund doesn't care about transactions. The gaming fund is not trying to say, we're going to give you money to get more transaction revenue. They're investing at the application layer. Right? So what's exciting about like Zy and Ape chain and all these other chains is let's get alignment to have the Arbitrum technology exist everywhere. And then let's add leverage to your business. Right? So if you need to invest 10 million dollars and you're looking at all these different venture funds, why would an Arbitrum the Arbitrum Dow want to be able to invest in the winners that are building on this technology. Right? So like it's a very different model of where we're concentrating capital. It's not concentrating capital to get them to use Arbitrum technology for the sake of sequencer revenue. It's concentrating capital like how do we get people to use Arbitrum so that we can invest at the application layer, at the product layer, to be able to make Arbitrum continue to grow and add leverage, right? So, if you just look broadly at the Arbitrum Dow again, like $200 million dollar game fund, it's the sole LP, right? They're building out they have the um the Arbitrum Step program. Um, the Arbitrum Dow owns like $40 million dollars in US Treasuries through different like money market funds that they've done. Right? Like the founda and this is separate from the foundation. It's the Arbitrum Dow itself building out all of its assets through like diversified opportunities, can continue to add leverage on top of Arbitrum builders. So it's again, I think it's a very different model which is like we want the blockcha block space to be everywhere. We want to make sure that like we don't have quote and quote \"free loaders\" or we can have like alignment and value capture. But the primary business is not actually capturing sequencer revenue. The primary business is going to be long-term, how do we expand our economic zones to continue to invest in the builders who are using the Arbitrum tech."
  }
]