[
  {
    "speaker": "Guest 1",
    "content": "But that's like a whole other big debate. They're conflating whether the L1 should scale and whether people on the L2 should build businesses on top of it. The reality is, I don't think anyone thinks that there's going to be one blockchain in existence that will solve all of the world's problems. And I don't even think that's a scalability issue. I think it's also a product level issue, right? Because people don't want uniformity of blockchain space. They want opinionated blockchain space for certain use cases, right? So, if you don't have the ability to launch your own blockchains on top of Ethereum, then you're going to just have builders launching their own blockchains elsewhere. And I think that um, in some ways, like you know, I like to say everything crypto does about time horizons, right? So, if your time horizon is who's going to win in the next 6 to 12 months, I understand the concerns and frustrations and hesitations about Ethereum's roadmap when you look at like all the traction that Solana's getting, and I think it's great. I think Solana's been doing a fantastic job of what they're trying to accomplish. But if you're thinking on the 5-year time horizon, then I think that like even the Solana ecosystem when they talk about network extensions, etc., they sort of see the writing on the wall on this is that Ethereum is very well set up to be able to enable opinionated blockchain space, modular blockchain space, um, while still maintaining itself as a critical sort of bedrock of all of this. And again, I think that like whether Ethereum should be, in the short term, making certain scaling decisions to maybe quote unquote keep up, is like orthogonal to this broader question of like whether L2s are parasitic, and I don't think they are. If you look at um even from like a business development and education perspective, I would argue that Arbitrum, Optimism, Polygon, and, you know, other L2s are like actually the forefront of getting people to use the EVM if you even think about it at this point. You know, the Ethereum Foundation, for you know, all the criticisms they get, like they don't have the resources to do what all these organizations are doing individually, right? So, I I think it's, that that that's what I would say."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I mean I don't have much that, I think that was very eloquently put, and I agree with with all of that. I think a lot of it is timeframe conversations. Like, right now you have a great user experience on Solana because there's not many users, right? So like, you get these instant confirmations, it's like a great place to to actually interact for the user. And a user journey in the Ethereum ecosystem is complicated to say the least. But over a period of time when we're like, are we going to get 500 million, a billion people using the ecosystem, like you're not going to have one chain, like, in one ecosystem be able to do that. And so there are things, hopefully, Ethereum continues to do over the next couple of years that like, help still solve some of these problems, but no. I think um in the end when we look back 5 years from now, um everyone that's, you know, bullish on Ethereum will be very grateful that there were these L2 ecosystems that bounced together."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. Absolutely agree with that, as well as AJ's points there too, because you guys are ultimately pushing forward two visions and value propositions that I think Ethereum is trying to push forward itself. You have Ethereum trying to expand its economic zones via roll-ups, and you also have Ethereum trying to deepen its interop between these roll-ups. And so each of you guys, respectively, are pushing forward these two paths in your own right. And ultimately Ethereum's going to be better off by learning from you guys, drawing upon your tech, drawing upon your inspiration, your vision, your philosophy. And ultimately Ethereum in general's going to be better off. So yeah, as as we wrap up, guys, really appreciate you guys, you know, unpacking why you guys are building your businesses in this way. And uh, talking through some of the decision-making process that has that has led to you uh to where you are, which is two of the biggest roll-ups on Ethereum."
  },
  {
    "speaker": "Guest 1",
    "content": "Thanks for having us."
  },
  {
    "speaker": "Andy",
    "content": "This was fun."
  },
  {
    "speaker": "Rob",
    "content": "We'll do a we'll do a recap a year from now and uh see where we're at."
  },
  {
    "speaker": "Guest 1",
    "content": "Exactly, yeah. I'm sure everything's going to change."
  },
  {
    "speaker": "Andy",
    "content": "That's the only thing I'm certain of."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 3",
    "content": "Well, thanks so much guys. Uh, thanks again Robbie for uh letting me be your sidekick on this one, and uh I learned some things, and hopefully everyone tuning in did, too."
  },
  {
    "speaker": "Rob",
    "content": "Definitely."
  },
  {
    "speaker": "Guest 2",
    "content": "Thanks, Jill."
  },
  {
    "speaker": "Guest 1",
    "content": "Thanks, everyone."
  }
]