[
  {
    "speaker": "Guest 1",
    "content": "The cost of producing the asset is somewhat divorced from the asset itself. Right? Because the cost is like buying electricity, opening data centers, whatever. In proof-of-stake, that cost is basically zero. And most of your costs are the collateral cost, of buying the 32 ETH or buying the 1 ETH or whatever, you know, the minimum threshold will be. And then locking it up and being able to earn revenue without kind of losing money, right? So it's like I'm putting up 1 ETH of collateral, I'm earning x percent per year, right? And the point is something like restaking immediately improves your monetary premium. Your your, in the sense of the value of the asset is not just the future cash flows of the network itself. It's the future cash flows of of other networks using it as collateral. And I think rollups just don't do that, right? They're not really using the assets collateral. They're using the asset just for for netting, which is like a lot lower of a price impact. It's not gonna increase the price as much."
  },
  {
    "speaker": "Guest 2",
    "content": "Anything to add there, John?"
  },
  {
    "speaker": "Safe",
    "content": "Safe is moving the world's GDP on-chain. With the introduction of Safe{net}, Safe is taking this to the next step very soon. Check out net.safe.global to learn more about how Safe is moving the world GDP on-chain."
  },
  {
    "speaker": "Guest 3",
    "content": "Welcome aboard on our journey into the singularity. This is the end game road map for Frax and Frax{total}. The new L2 out of the Frax ecosystem that is totally based on fractal scaling. Frax{total}, the modular L2 blockchain, built by Frax with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images, and it explains how L2s become L3s and the entire app chain life cycle goes through its evolution. The Frax ecosystem is made up of some of the top builders in the space, and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space, and this Frax{total} L2 joins the existing suite of Frax products, including Frax{swap} and Frax{lend}. You can see Frax{fairy}, the bridge to go from any chain, Arbitrum, Optimism, or mainnet into the Frax{total} mainnet. Bridge your tokens and bring your Frax assets into the Frax{total} ecosystem. Join today to get the best out of Frax{total}. You are still early. Join today. Take part in our expedition into the singularity."
  },
  {
    "speaker": "RedStone",
    "content": "RedStone Modular Oracles are available on 50 plus chains, trusted by over 100 clients, and over $6 billion in total value secured. Visit redstone.finance to find out more."
  },
  {
    "speaker": "Rob",
    "content": "No, yeah no, I I agree with that. I mean, like, this is a big part of why I mean like why I've also been arguing a lot lately of, I I think you should improve the L1 a lot for a lot of these reasons of I I think that the like act- activity happening on the L1 in my mind is just strictly better for the asset compared to it happening on the L2 of if you think that the value is coming from fees. Like, you are strictly going to get more fees to the asset based on, you know, the same activity happening on the L1 versus the L2. And then at the same time of like the gas token a lot of these places, L2s, they're probably going to disintermediate the gas token because they got fuck it like users want to use USDC."
  },
  {
    "speaker": "Guest 1",
    "content": "USDC"
  },
  {
    "speaker": "Rob",
    "content": "I mean you already saw Blast, right? Like, all the native yield stuff basically showed people are not necessarily gonna use ETH itself."
  },
  {
    "speaker": "Guest 1",
    "content": "Exactly."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Exactly. Like that that's gonna happen. And then the other big part is in practice like, where is the vast majority of ETH like, used today throughout DeFi as collateral? All these things. It's on the L1. Like, it's not it's not on the L2s. So in practice, like if you want to have this be this like high quality liquid asset that's used you know throughout DeFi like whether it's minting stable coins against it, you know, using trading, using restaking. Like most of that comes from like, you should just improve the L1 quite frankly. Um, and have that stuff kind of natively happen there."
  },
  {
    "speaker": "Andy",
    "content": "I must say, ETH on or DeFi on Arbitrum has gotten pretty deep in terms of liquidity dapps, so I I I would say Arbitrum is kind of one exception and-"
  },
  {
    "speaker": "Guest 1",
    "content": "One one thing though that's funny about that is, all around one-third of Arbitrum TVL is in the Hyperliquid bridge contract, and when Hyperliquid leaves, and just starts their own chain then, that's one third of TVL that has gone."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, gone. Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "In in some ways, you could view Hyperliquid indirectly as a sort of vampire stack on Ethereum if you-"
  },
  {
    "speaker": "Andy",
    "content": "They are completely. And because they're just gonna launch their own L1 from what I understand."
  },
  {
    "speaker": "Guest 1",
    "content": "And that TVL is likely going to migrate because it's generally active investors. It's not like, it's not like TVL and like L1 lending protocols where people forget that they even-"
  },
  {
    "speaker": "Rob",
    "content": "Well, there's a lot of points farming going on right now still. You know, you can just drop your ETH USDC in a vault. So there's there's you know, there's some of those people there. Well one thing that I also wanted to add to your Solana collateral point is that, outside of just the actual usage of SOL on other chains, actually just collateralizing SOL and borrowing against it and do- and like using it from from from a user perspective of mine over the last like four or five years on-chain. I actually feel like quite a bit more risky borrowing against my SOL or like doing different things with it on SOL DeFi compared to like AAVE and-"
  },
  {
    "speaker": "Guest 1",
    "content": "A very a very clear reason a very clear statistical thing. And this has been coming down. So this is not because like Solana DeFi is dying. In fact, I would argue the protocols there are improving at a faster velocity than the Ethereum protocols."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "But but a very clear measure of the premium being worse. And one way you oftentimes measure monetary premium of bonds is you look at the volatility of the interest rates for the repo markets. So like, I own a bunch of bonds, I wanna borrow cash against it 'cause I have some, you know, thing or expense I have to pay and then I'll I'll pay it back. And usually those repo rates are like how you compare different currencies like comparing the Euro to the dollar."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "And the repo rates for SOL if we make an analogy of being like the rates in Camino or the rates in other lending protocols, are much higher and more volatile than the ETH ETH ones, right? They're they're like double digits."
  },
  {
    "speaker": "Rob",
    "content": "Way higher."
  },
  {
    "speaker": "Andy",
    "content": "It's like 2% on SOL right now, 9% just to deposit in Camino."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "And the USDC borrow rate is very similar to ETH right now, it's like 12% 'cause it's it's very speculative times, currently. But I I noticed that as well. So basically that's a result of of what property exactly?"
  },
  {
    "speaker": "Guest 1",
    "content": "Well, the main thing is that like a, there's not that many people who wanna supply their SOL."
  },
  {
    "speaker": "Andy",
    "content": "Okay."
  },
  {
    "speaker": "Guest 1",
    "content": "That way they would rather earn 7% effectively riskless staking."
  },
  {
    "speaker": "Andy",
    "content": "Yep."
  },
  {
    "speaker": "Guest 1",
    "content": "Plus MEV rewards that actually could go higher, uh, versus putting it, using it as collateral, right? And this comes back to to John's point about the emissions, right? ETH emissions are basically zero. So like with that zero emissions, it make you have to go to the the the repo market right?"
  },
  {
    "speaker": "Andy",
    "content": "This repo market, yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "But but here, and and so like, you know, if I compare this to say like the US government. The US government issues a ton of bonds, right? They're they're issuing a ton of debt, but yet people are willing to treat as the best collateral. Why is that? There's a fuck ton of demand. So it's like, there's just not that much demand for the SOL side sort of rewards in the sense that people aren't really selling, they're just kind of like locking into stake and and not really rehypothicating in the way that I think people on ETH are where they're like taking staked ETH and then putting into AAVE, putting into all the protocols more collateral."
  },
  {
    "speaker": "Andy",
    "content": "AAVE, Compound."
  },
  {
    "speaker": "Rob",
    "content": "Rollups."
  },
  {
    "speaker": "Andy",
    "content": "It's a result of like ETH DeFi being more battle-tested. There's liquidity effects of all of that. Also, I think the users are a bit of a different segment and then also just I mean-"
  },
  {
    "speaker": "Rob",
    "content": "Inflation."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah. I think the lack the lack of of protocol inflation is like actually the biggest. But I think I think like if I were to take the kind of you know, John talks about improving the L1 for ETH, I think if what I would do in SOL, and and it's kinda hard to do because they have this unlock overhang, but I would definitely be trying to like systematically reduce inflation."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, I agree with that."
  },
  {
    "speaker": "Andy",
    "content": "Why is just to get the actual demand for DeFi and collateral on-chain, on-chain DeFi would be better."
  },
  {
    "speaker": "Guest 1",
    "content": "On-chain DeFi would be better, yeah. Like like SOL is collateral and centralized exchanges, actually much more comparable to ETH."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "I think it's just that like the DeFi usage is more true to like how much risk and how pe- how people value as collateral. Um, and so, and the other thing that's interesting I think that probably improves monetary premium long term but short term might not is slashing in Solana just went live in in the 2.0 release. So you know, you actually are have value at risk now versus before there was no slashing."
  },
  {
    "speaker": "Andy",
    "content": "versus free."
  },
  {
    "speaker": "Rob",
    "content": "Free ride."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Also, restaking on SOL is being built out slowly but surely as well."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah. So so I think I think SOL is actually if they can get the inflation down, like a lot. Like ironically, I think when Ethereum was doing the ultra sound money thing, they probably didn't really need to be as aggressive as they were. But I think SOL actually is the opposite, they need to be more aggressive on this ultra sound."
  },
  {
    "speaker": "Andy",
    "content": "So how do they get their inflation done? Is this like, it's gotta be like a governance process, like a SOL improvement pro- yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, just have some entities to like lower the curve."
  },
  {
    "speaker": "Andy",
    "content": "So what would you recommend? Like, a slow implementation over the next like couple of years or would you just say like-"
  },
  {
    "speaker": "Guest 1",
    "content": "A slow implementation where like, as there's an unlock you have a large, you have a larger jump down and then before the unlock, it's the slower because like you wanna basically compensate people for the amount when there's the unlock, where like there's gonna like imagine there's an unlock that's like 10 million dollars and 5 million dollars is gonna get sold."
  },
  {
    "speaker": "Andy",
    "content": "Okay. Kind of."
  },
  {
    "speaker": "Guest 1",
    "content": "The 5 million pushes the SOL price down by let's say like, 10%. I'm you know, making some hypotheticals over here, right? And you wanna basically make sure that inflation covers people who stay locked through the unlock and are still staking."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "So the idea is you want the inflation curve to be kind of like, not too steep um, until the unlock and then after the unlock, you drop."
  },
  {
    "speaker": "Andy",
    "content": "Okay."
  },
  {
    "speaker": "Guest 1",
    "content": "Based on based on how it goes. So like, like I think stuff like that is like a way of um, dealing with this. I don't think ETH had to deal with this at the scale that Solana is that."
  },
  {
    "speaker": "Andy",
    "content": "Because of the unlocks or just because-"
  },
  {
    "speaker": "Guest 1",
    "content": "Well, 'cause they didn't really-"
  },
  {
    "speaker": "Andy",
    "content": "Well 'cause of the-"
  },
  {
    "speaker": "Guest 1",
    "content": "Well, starting PoW is is is you know, a much more beautiful-"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah, yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "It's a beautiful model before."
  },
  {
    "speaker": "Andy",
    "content": "You know, also it was the advent of DeFi as well. So like, it was like, this is brand new. It it was a lot more like, oh my god, this is crazy, new tokens, air drops. It was like-"
  },
  {
    "speaker": "Rob",
    "content": "And I think staked ETH actually like, Lido bridging the gap between PoW and PoS for a year, 'cause like the beacon chain was live, that was huge. That like helped really build. In Solana, they didn't really have a, there's not that much time to do that, like-"
  },
  {
    "speaker": "Andy",
    "content": "The beacon chain was live."
  },
  {
    "speaker": "Guest 1",
    "content": "PoW, yeah. Well, they didn't really-"
  },
  {
    "speaker": "Andy",
    "content": "Well, starting-"
  },
  {
    "speaker": "Guest 1",
    "content": "Well, starting PoW is is is you know, a much more beautiful, it's a beautiful model before the transition."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah."
  },
  {
    "speaker": "Andy",
    "content": "Also it was the advent of DeFi as well. So it was like, this is brand new. It was a lot more like, \"Oh my God, this is crazy, new tokens, air drops.\""
  },
  {
    "speaker": "Rob",
    "content": "And I think staked ETH actually, like, Lido bridging the gap between PoW and PoS for a year because, like, the beacon chain was live. That was huge. That, like, helped really build. In Solana, they didn't really have a, there's not that much time to do that, like-"
  },
  {
    "speaker": "Andy",
    "content": "The beacon chain was live."
  },
  {
    "speaker": "Guest 1",
    "content": "PoW. Yeah. Well, they didn't really-"
  },
  {
    "speaker": "Andy",
    "content": "Well, starting-"
  },
  {
    "speaker": "Guest 1",
    "content": "Well, starting PoW is is is, you know, a much more beautiful- It's a beautiful model before the transition."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, yeah, yeah."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah."
  },
  {
    "speaker": "Andy",
    "content": "You know, also, it was the advent of DeFi as well. So, like, it was like, \"This is brand new.\" It it was a lot more, like, \"Oh, my God. This is crazy. New tokens, air drops.\" It was, like-"
  },
  {
    "speaker": "Guest 1",
    "content": "And I think staked ETH actually, like, Lido bridging the gap between PoW and PoS for a year, 'cause like the beacon chain was live. That was huge. That, like, helped really build. In Solana, they didn't really have a there's not that much cha- time to do that. Like-"
  },
  {
    "speaker": "Andy",
    "content": "Because the beacon chain was live."
  },
  {
    "speaker": "Guest 1",
    "content": "That was huge. That, like, helped really build. In Solana, they didn't really have a, there's not that much chan- time to do that. Like, What-"
  }
]