[
  {
    "speaker": "Guest 1",
    "content": "created by the system versus value extracted by the system, like Amazon basically just spent 20 years like creating a ton of value extracting zero. But it did that in order to maximize market share."
  },
  {
    "speaker": "Guest 1",
    "content": "And how the value gets captured might not necessarily be revenue, it might be like doing burns, it might be like the rollups start burning their fees, it might be it might be more like restaking. So like there's just a lot of weird ways where it doesn't like look like revenue, but from an equity like well, okay, these are not securities whatever, but equity like instrument, you know, like there's lots of ways you can kind of you know, make their value go up that are not necessarily, \"Hey, we have a dividend and they're giving you revenue.\""
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah, I'm not sure if you need those disclaimers anymore."
  },
  {
    "speaker": "Guest 1",
    "content": "Everything's fine."
  },
  {
    "speaker": "Guest 2",
    "content": "We're also in Thailand. Everything's fine. We're in high SCC. What happens in SCC, stays in SCC."
  },
  {
    "speaker": "Andy",
    "content": "So John, then to kind of add to your thesis, um, do you think that Sol is starting to have some of these moneyness properties that are present in Bitcoin specifically for sure? And then ETH is kind of you know, accrued those over the last five years or so as well, as like the Lindy effect has picked up and as different kind of monetary policies have changed like do you think Sol is also starting to get a little bit of that moneyness or is it still purely like a technology software like meme coin chain?"
  },
  {
    "speaker": "Rob",
    "content": "I I think that we can say at least empirically there is some level of the market is valuing this thing based on something above whatever we expect the cash flows of this thing to be. Um, so it empirically the I mean the like there's something being added to that valuation and I think when you talked about like most market participants, it's like, \"Ah, there's like some degree of this is like a commodity money like thing, and like that like that is something that we value.\" So I I think very literally, there like that is certainly like it has monetary qualities and that like people are very literally valuing it in some way like taking that into account. Um, but yeah, I mean when you compare Sol to ETH or Bitcoin, I I think that there is like an order of magnitude difference of like Bitcoin is just obviously like way ahead of everyone. ETH is definitely behind, but like you know, a lot of the money like properties are there. And then I think like everything everything else is just like way behind in terms of just like what do we think of just like all of these more, I mean some of them are measurable, but like a lot of subjective features of like what do we think is the general kind of neutrality of this asset? Like what is the predictability of you know, what do we think it's supply and everything is going to be in the future? Like what is the decentralization of the owner base? Um, all of those kinds of things. Those things in general, I would say are like an order of magnitude stronger in Ethereum versus Sol. Which is like not a surprise, I mean like the."
  },
  {
    "speaker": "Guest 1",
    "content": "Well, there's no unlocks."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, yeah, no, exactly. Like there's."
  },
  {
    "speaker": "Guest 2",
    "content": "There's no like FTX VC rounds."
  },
  {
    "speaker": "Rob",
    "content": "Exactly, like there's there's no like US dollar unlocks. Like that's kind of like a weird thing if you're saying like, \"Ah, this thing is money, but like all the VCs like own half of it, and like there's like a bunch of structured unlocks.\" Like that's kind of a weird thing. So, I I mean like on all of those qualities and this is back to the point of like why I think Bitcoin people would love for Sol to flip ETH is because I think it's like really hard to like cross that gap of like, \"Oh, this is the like decentralized non-sovereign world money thing\" when like that's the general."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, it it it turns it turns everything into that meme of like the two people fighting and the one person smoking the bong. The bitcoin is like smoking the bong and the other two are fighting but you need both of them at the same level to be fighting."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I I I would maybe take a slightly different view of this, which is like you know, something bitcoiners love talking about an Ethereum people hate talking about is uh, monetary premium. Um, and monetary premium is usually sort of defined as like the you know, there's a value of producing a good, there's a value that the good is valued at, and like is there a gap between those? And is that gap sustainable? Like is it always uh, kind of higher than um, such that there's sort of some some systemic kind of profit like looking thing."
  },
  {
    "speaker": "Guest 1",
    "content": "And classical economics loves saying this, you know, quantity theory of money thing which is like money velocity times quantity is sort of some gives you some notion of monetary premium. But I think in crypto, the the thing people have always been kind of especially post Bitcoin, people are as, \"Well, money velocity is basically infinite.\" Like I can send arbitrarily high uh, amounts of capital for like the same duration as sending a dollar. Um, or a dollar's worth of ETH."
  },
  {
    "speaker": "Guest 3",
    "content": "That's bullish because that means monetary premium is infinite."
  },
  {
    "speaker": "Guest 1",
    "content": "Infinite, but like I think that's often why I think the ECon kind of logic for this is wrong. But the way I prefer thinking about it is kind of you have some notion of revenue for the system. So like maybe it's MEV, maybe it's execution fees, maybe it's DA. And then you have some notion of um, people who are willing to hold the asset and stake the asset relative to how much they're getting in fees. And how much are they unstaking or leaving or joining the network, right? And from those metrics, Sol and sort of ETH both kind of actually look pretty good because people are not really unstaking very much, or they're trying to capture extra revenue from the staking derivatives. But the one place they are very different is their like collateral usefulness. And I think that's the thing to me that like separates them as moneyness and like."
  },
  {
    "speaker": "Rob",
    "content": "In ETH you can use as collateral in like everywhere. Sol, you know, even in Ethereum land, there's just not that much you can do use Sol collateral. You can like trade Sol perps, and like maybe your position could be used as collateral. But there's really no like synthetic Sol that people trust, which is is kind of a difference, right? Like if you think about Bitcoin, there's wrapped Bitcoin on every other chain. That's like a sign that there you're you're actually valuable collateral even as a synthetic version. Uh, there's wrapped Ethereum on Sol, but there's not the other way. And I think like when Sol is money, people will view it as good enough collateral to be going the other way. And that that's sort of like a very stupid but like obvious kind of thing that you could could say."
  },
  {
    "speaker": "Guest 3",
    "content": "So rather than make it Sol versus like ETH, we already got the Sol flippening ETH thesis as a smart contract platform. What is the the the thesis that you're starting to describe for Ethereum as usefulness of collateral? Um, like I'm curious to get your like ETH flipping Bitcoin thesis because it's starting to sound more like, it's starting to sound less like the roll-up-centric roadmap and more like the restaking-centric roadmap. Or the the collateral-centric roadmap."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I mean so so one reason I think roll ups value capture mechanism for the L1 is quite low. It's a little bit like Amazon doing again like affiliate marketing and the affiliates take 90% of the profit and the company takes like nothing, but the affiliates now have to go source all these goods and deliver them to the end user, right? Because like 90% of the things you buy in Amazon now are not really coming from Amazon. Like they're at Amazon warehouses, but like some other distributor is like fulfilling it, right? That's what I mean by affiliate. And I I like to think of the roll-ups in this an again, it's never there's none of these analogies are perfect, but all analogies are wrong, whatever."
  },
  {
    "speaker": "Rob",
    "content": "It doesn't have to be perfect."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, yeah, but like like, it it."
  },
  {
    "speaker": "Rob",
    "content": "We have a disclaimer guy."
  },
  {
    "speaker": "Guest 1",
    "content": "I think it's I think it's a kind of useful proxy to think about."
  },
  {
    "speaker": "Guest 1",
    "content": "Um, especially in terms of a company that just completely disregarded profit motive for many years to to capture market share. And I I I do kind of view the roll-up roadmap as doing that. The problem is that roll-ups can only impact ETH price indirectly. Like they're taking away a bunch of fees so people don't have to buy as much ETH on uh, main net, um, or they just don't have to buy as much ETH uh, to pay mainnet fees. And the fees on the L2 are way lower. Um, so the only way they really are impacting the L1 prices, the fees uh, all paid on the L2 need to be a lot higher in aggregate over all the users. Like you've increased the volume so much that the aggregate fees are close to what you were taking away from the L1. And then you you know, all the users had to buy that ETH and push the price up some some amount. So it's kind of this indirect mechanism. It's not like that even if a roll-up is using ETH as its gas token, which is by social fiat, right? It's not like that's a forced thing. Uh, but like let's assume that everyone's alignment is whatever. They're going to use ETH as the gas token. Even then, there's no real they're not really using ETH as collateral there. Like they sort of are, but uh, you know, the the way the withdrawal structure works in the L2, it's not really the same, whereas in restaking, you're actually forcibly locking the the thing as collateral. And it because it has value at risk, it it actually has to be earning income. Um, and so people will be buying the base asset to earn that income, which is very different than just like flow based um, purchases to pay for fees. And so, I I I'm just sort of a a believer that collateral value for bitcoin has always been where it drove a lot of value. It never was you know, like the Jesso story of payments and people sending Bitcoin transactions. If I compared the total amount of collateralized bitcoin transactions like centralized exchanges and in in derivatives like WBTC. And then I compared that to like the total number of Bitcoin transfers over time, it's like everything is going into like all the value generate is coming from using bitcoin as collateral, not as as payments effectively, right? And so I think Ethereum has to cross that chasm and I just don't think the roll-ups do that. So So that's my that's my that would be my reason. I think it would be hard to flip unless restaking starts generating insane revenue."
  },
  {
    "speaker": "Guest 3",
    "content": "In that paradigm, how do you calculate monetary premium because it it it's not it's no longer like the the velocity versus quantit."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, yeah, yeah, so the velocity versus quantity thing is like some kind of equilibrium theory, right? Like it assumes that you have like infinitely many people trading and arbitrarily liquid markets, right? But in practice, that's obviously not true. That's why I think also a lot of commies kind of don't really use it. But there's there is a sense in which there is sort of a collateral value of money, which is like how much can I earn per unit collateral in a risk adjusted manner? And over what it cost me to buy the input asset, right? So like if I think about the production of Ethereum or or any asset in proof of stake. So in proof of work,"
  }
]