[
  {
    "speaker": "Guest 1",
    "content": "Transaction adoption is still super low."
  },
  {
    "speaker": "Andy",
    "content": "Really?"
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Interesting. So so these are all these things that I think make Solana not make money all but like you can see the direction it would have to go to be that."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, no I definitely agree with that. Don't kill me, Raj."
  },
  {
    "speaker": "Guest 1",
    "content": "You know I like"
  },
  {
    "speaker": "Andy",
    "content": "I mean you know have you got you know Raj's favorite favorite I'll kill you tweet so that's why I'm like don't don't kill me, Raj."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Uh Johnny you wanna add something?"
  },
  {
    "speaker": "Guest 3",
    "content": "Yeah, no I I definitely agree with that of like most of the uh yeah like it's funny cuz most most of the conversations around stuff like issuance I think they they had being like kind kind of dumb conversations. Like most of them end up being the thing which like I I like I've written about before of like a lot of people do this like dumb like profit uh for the chain equals fees minus issuance thing which is like doesn't make any sense. Um and and so you can take that to one side of it like a to say like, \"Oh, okay, issuance like doesn't matter doesn't matter if it's 20% or 0%, doesn't matter."
  },
  {
    "speaker": "Guest 1",
    "content": "Modern monetary theory."
  },
  {
    "speaker": "Guest 3",
    "content": "Yeah yeah yeah yeah yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Uh <noise> Just print some debits, bro. That's all it is."
  },
  {
    "speaker": "Guest 3",
    "content": "<noise> And like there is some sense in which it doesn't matter of the like yeah I think the P&L calculations people are doing is wrong and like you're sort of money moving money around you could stake it like that doesn't really matter. But it does very tangibly matter for stuff like this of when we're talking about like, \"Okay, but what are very literally the impacts on uh defy and how the asset is used?\" It makes a big difference if you know the asset for the uh has like you know 20% inflation or 1% inflation that completely changes like what is your defy gonna look like? How is the asset gonna be used? And especially when a lot of this is like alleviated in some sense if like everyone in Solana just used Jito Sol and like just treated that as like exactly the same thing but I mean you also just in practice do not see that at all like most stuff is still Sol based that is what most of defy is. Um and so you end up with this big problem there um where there is like a big opportunity cost to it and like that that does change the way that defy ends up looking."
  },
  {
    "speaker": "Rob",
    "content": "It's also somewhat path dependent, right? Like Ethereum had an an entire defy summer of yield farming and and people got accustomed to that behavior of like depositing and Eeth defy got known for for APYs."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "And Sol, people know it for meme coins, not for depositing into yield farms."
  },
  {
    "speaker": "Guest 1",
    "content": "Although it it it I feel like as the meme coins crashed you saw you definitely saw the like the TVL go the other direction recently, so like I I would say like you the next three months will be interesting as a is it a regime shift or is it still staying in meme coins. I think the other thing that's maybe kind of worth pointing out is like this this whole monetary premium discussion is like generally semi theoretical but one way it wouldn't be theoretical is if flashbots say like Jito had a token and you were actually able to measure like the net revenue generated by flashbots the token versus Jito the token versus the base underlying and the difference between those is somehow this like you know excess collateral magic plus whatever animal spirits."
  },
  {
    "speaker": "Andy",
    "content": "<noise> Could you just explain that for uh for smooth brains please? <noise>"
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah yeah yeah. So so so if I think about like the revenue the MEV revenue that the chain is getting"
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Like realistically if we think about who is getting the MEV revenue right now, it's like basically the proposers themselves, right? And so that represents like some some revenue they're getting that they kind of add to their overall belief but if we think about sort of flashbots or Jito in the not to keep making this Amazon analogy but they're kind of like we tre think of them as like the like person who's the marketplace who's like getting them this excess revenue and then taking a cut"
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "From from the different affiliates. The amount of revenue they're taking so like let's suppose it took a fee switch. Let's say the fee switch was like 2% of MEV revenue. And then look at where their token trades relative to like the implied value from the fees because arguably flashbots and Jito if they were like businesses are cash flow businesses, right? They like they have very clear cash flow revenues right? And so then you then then from the Jito token price, if you know how much it's trading above its sort of cash flow, then you can use that as a lower bound for how much Sol is trading above its cash flow."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 1",
    "content": "Now so Jito will have a fee switch on soon so I think you can do this calculation for Sol like once that's alive and see how much it changes the token price over like few months."
  },
  {
    "speaker": "Andy",
    "content": "Is this a flashbots token alpha?"
  },
  {
    "speaker": "Guest 1",
    "content": "No no no no no no <noise> no no no no no there's there's there's no such thing. I just I was just saying I think if if there was a world in which it was like Jito and you could like compare Eeth and Sol apples to apples but it's like not so you unfortunately can't."
  },
  {
    "speaker": "Guest 2",
    "content": "<noise> Free alpha."
  },
  {
    "speaker": "Guest 3",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Well, guys I think this has been fantastic. Thanks for uh joining us and uh having a fun conversation."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah it's definitely. It's great. Cheers."
  },
  {
    "speaker": "Guest 3",
    "content": "Of course."
  }
]