[
  {
    "speaker": "Guest 1",
    "content": "It doesn't matter if it's 20% or 0%, doesn't matter. Modern monetary theory."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 3",
    "content": "Yeah. Yeah, yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, Jon, is Sol going to flip ETH? That is the question. That is the million-dollar question, the billion-dollar question."
  },
  {
    "speaker": "Guest 3",
    "content": "It's starting to sound less like the roll-up-centric roadmap and more like the restaking-centric roadmap."
  },
  {
    "speaker": "Guest 2",
    "content": "So, translation. The ticker is Sol, not Sui."
  },
  {
    "speaker": "Rob",
    "content": "I'd say it's genuinely probably something like good, a solid 50-50 at this point."
  },
  {
    "speaker": "Guest 1",
    "content": "We're here in Bangkok in the in the basement studio with the two biggest research K-wells in all of Thailand."
  },
  {
    "speaker": "Guest 3",
    "content": "Our mission is to hold the biggest brains hostage for."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, these guys aren't going to make it out of."
  },
  {
    "speaker": "Guest 3",
    "content": "These This is."
  },
  {
    "speaker": "Guest 2",
    "content": "This is secretly uh uh you know, hostage-taking video. We're going to have to hold up some signs proving that at certain time, today's newspaper."
  },
  {
    "speaker": "Guest 1",
    "content": "Oh man. Well, we we brought this together to uh address Jon Charb's infamous quote tweets of Solana at the same market cap of Ethereum, which is not much anymore. So, um. Yeah, Jon, is Sol going to flip ETH? That is the question. That is the million-dollar question, the billion-dollar question."
  },
  {
    "speaker": "Guest 3",
    "content": "Yeah. Hundred. Hundred."
  },
  {
    "speaker": "Guest 2",
    "content": "It's almost a trillion. It's almost really really a non-question."
  },
  {
    "speaker": "Guest 1",
    "content": "Hundred. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Um. Yeah. I mean I mean, so I mean, so, part of it was like the timing of it was I was just like at the point where I was like most. I I feel like there's a lot that the Ethereum community like I think needs to like acknowledge and kind of learn from the from the past few years and like you know, see what Solana is doing, what can we improve on, stuff like that. I think there's been like uh directly a little too much just like denial and just kind of ignoring everything that's going on there. So, part of it was just like I was like, alright. Fuck it. I'm going to be really loud, like, really expose it on this. Like, see if people start to listen. Um. Very concretely like I'd say it's genuinely probably something like good, a solid 50-50 at this point um that Sol or I mean, maybe honestly another smart contract platform does I would say like I'd say 50-50 in the next like call it five years or so is what I'd say the odds are at least. Um I think it's still tough to happen in the like near to medium term if not if for nothing else of and like look like Ethereum has the ETF even with the new administration. Like, it's probably going to be like a decent little while before Sol gets like consider seriously get an ETF. There's a lot to overcome there. So, I I think it's like pretty tough to happen in the near to medium term. But, if you just like if you just look at them both objectively at this point, you just like play out the trajectories of where both of them are going, especially with I mean I think it helped obviously Sol a lot like the election in the past week. I think that like meaningfully increase the odds to be honest um because one it means the bull market keeps going and what happens in the bull market is like we see it now. It's like a ton of new activity is all going to keep going to Solana. Like, it doesn't give time for like another competitor to kind of come and uh chip away at that and it's probably going to reduce Ethereum's regulatory mo in the call it like medium term where like Sol get an ETF and then you have like less of just this kind of like an inherent advantage. Um so, I like I think there's a real chance like with the trajectory of both of them are going on of like very concretely like Sol is continuing to attract a shit ton of like new builders, bringing real applications. It's like actually getting a lot of value. People are using the chain. It's onboarding new people. If you just like keep playing that out and Ethereum just like kind of stays in this middle ground of like, 'ah, like, we're not really sure what we're doing with the L1, like maybe we improve it in a couple of years or like maybe we just kind of kick everyone off to the L2s and like you know swap and everyone should like kind of go you know just like dip out and go make their own chains and we just like stay in this weird middle ground and then we're just like sort of hoping like base and these other two just like kind of just like pump ETH a bunch.' Like, that seems like a risky bet where like if you just keep playing that out, like yeah, I think there's like a very good chance that like Sol would kind of flip in that scenario. Um yeah. It's worth more than that now."
  },
  {
    "speaker": "Guest 2",
    "content": "So, so, translation. The ticker is Sol, not Sui. Uh, okay, yeah. Sorry. Just to give you like uh just to give like the 30 IQ translations. I mean I mean like like very very literally, yes. I just I just I'm just trying trying to help our audience. Not not financial. Not financial. Not financial due. Um. I mean I mean like like the Sui thing is also historical to me. Like, I don't know. That'll probably keep going up too. I've no."
  },
  {
    "speaker": "Guest 3",
    "content": "32 billion FDV."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah. Yeah, yeah. It's insane. Yeah, yeah. It just keeps pumping. What's the NASDAQ uh valuation? It's like 40 or 50 billion?"
  },
  {
    "speaker": "Rob",
    "content": "I think it's like something like that, yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "It's nuts. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "So, is this a similar sentiment that you share with regards to ETH flipping Bitcoin? Because, we haven't heard of the flippening in a long time. I mean, it's been some time. I know through you were saying that the old Bitcoin maxis are coming out of the woodwork."
  },
  {
    "speaker": "Guest 2",
    "content": "Oh yeah. Like, so, like you know, a lot of the Bitcoin maxis I followed since like 2014 or '15 on Twitter. A lot of them, the funny thing is like they were really hardline, like 'fuckie, fuckie,' throughout D5 summer, throughout 2021. And then FTX happens and you think they're like it's a perfect time for them to dance on the grave of all this stuff. But then they all disappear because it turns out they're all paid by BlockFi. Uh and so, of course that blew up. Um but, all of those people have been either running out of money or re-imagining their lives and they've decided that uh they want to talk about Sol flipping ETH instead of uh ETH flipping Bitcoin. So, uh I'm not sure exactly why. I find it funny that Bitcoin maxis are aligning themselves with Sol."
  },
  {
    "speaker": "Rob",
    "content": "I think it's subtle why."
  },
  {
    "speaker": "Guest 2",
    "content": "Well, I I think it's like very boring thinking to just be like the enemy of my enemy is is my friend. But, like, that's clearly what's happening. But, I don't feel like the Sol people are reciprocating that to Bitcoin, honestly. Yeah. Like a one-way thing."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. I mean, like, it was like what if I like I I was kind of joking about it like I had to tweet like like basically along those lines like a couple of weeks ago. It's like very plausible scenario. And like, I think it's like a very plausible scenario is at some point, like, Sol flips ETH and then once that happens and the seal is kind of broken is like most of the other smart contract platforms, like you really even more aggressively become like, 'Alright, these things are like probably just fighting it out on the tech and the users you know. This thing isn't money. Like, there's nothing inherently special about them.' And then Bitcoin gets to be like really stay. They're like very special snowflake where like I I think Ethereum has like some credibility of like, 'Oh, we're a special snowflake too. Like, we were very early on. We're super decentralized. Incredibly neutral, blah, blah, blah.' It's like sort of harder for like anyone to argue that like Sol is going to be the global currency when just like Kyle earns as much of it as he does. Like, honestly. Like, that's like kind of tough to sell to people. And like like that's pretty tough. But like I I think that's concretely the reason why like Bitcoin people see it is because if Ethereum is the winning like smart contract platform-looking thing, I think there's like a I think there's a real argument in that world that like I think the probability of ETH flipping Bitcoin in that world is much higher than the world where like Sol is the winning smart contract platform. What are the odds of Sol flipping Bitcoin in that world? I think it's like way higher in the."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah. You're implicitly making some assumptions there because you're kind of saying Sol will be the winning smart contract platform."
  },
  {
    "speaker": "Rob",
    "content": "Oh no, I'm I'm saying in either of those scenarios of like let's say that we like let's assume that like ETH wins as the smart contract platform like Sol never flips it. Sui, blah, blah, blah. Like, none of these chains ever end up doing anything. I think in that world the odds of ETH flipping Yeah let's say that like if ETH wins, let's say the odds of ETH flipping Bitcoin just for simplicity is like 50% in that world. If we say like this alternate world is like, okay, let's say that Sol flips ETH and like they win the most."
  },
  {
    "speaker": "Guest 2",
    "content": "Then Then you're saying nothing flips Bitcoin?"
  },
  {
    "speaker": "Rob",
    "content": "Yeah. I'm saying in that world the odds of Sol flipping Bitcoin is like maybe it's like 10%. Yeah. And like I I feel pretty confident that there's like a meaningful delta between those two of like what is the odds of that asset like beating Bitcoin depending on who the platform is. I think. But, what does it mean to be the winning smart contract platform? Sorry, I'm stealing your job. That's the I mean I mean like the simplest way to measure it."
  },
  {
    "speaker": "Guest 3",
    "content": "'Cause the ETH maxis are are going to be out in force if this is just Sol pumping. That's a great question. I mean like I mean like I I mean, the Sui thing is also historical to me. Like, I don't know. That'll probably keep going up too. I've no. I mean like I think the like I think the honest way to measure it and I think that people like like under rate this measure because I don't know, they don't want to like sound like it is like I think val the valuation of the asset is like a very simple measure of like how successful are you right now. Like, the fact that ETH is worth 300 billion and Sol is worth 100 billion is like a very direct measure of like, we kind of think that ETH is more successful right now. Like, genuinely. Like, Well, what if you're a what if you're uh just to play devil's advocate here, what if you're like a company that spends uh like basically distributes all your revenue to your affiliates because like by having more affiliates, you grow faster. Like, say, Amazon in the 2000s where like the valuation didn't really reflect the market share and market power of Amazon and only later, eventually once they were they started actually taking the revenue back to the the main company and kind of having more of a value capture mechanism, did they kind of dominate. So, there there is this trade-off that like potentially, and I'm not saying this is true because it none of the roll ups have proven other than maybe Base that they could do this. Yeah. And Hyperliquid. Those are the the the two to to really think about. Um is sort of like that maybe these are the affiliates that are generating a ton of usage of your asset. But, like you're giving them all the revenue effectively and for a while until. For now. Yeah. Yeah. And then you find a way of enforcing it later. To some extent this is one reason why I think to foreshadow our debate that we're going to have later this week. I I think restaking is a way better value capture mechanism for an L1 than rollups."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. So, that's actually gets to the point though of why I don't think the Amazon analogy works here is because that that was definitely the case in like a a company where the thing is like very literally valued on like, 'We think that this thing will make money in the future.' That would work if ETH and Sol were valued on, 'Do we think that they're valued on like revenue capture and like ability to do that in the future?' And I think in practice, neither of them are. I think both of them are like in this hand-wavy way measured on like, 'ah, how successful do we think the thing is? Like, is it going to be money?' And, I think that's actually more correlated to that, not like how much revenue is it going to capture? And that's why I think that the market cap of it is actually like a pretty good proxy for like how successful is the thing being? Because, I think the closest thing that people are pricing the thing based on is like how much economic activity is like sort of happening in this realm and we think it's like sort of money and that thing. I think in practice, like that is what it's being priced like more off of than like, 'Oh, we think the uh future cash flows of Ethereum is going to be like three x Sol.' But, I don't necessarily think it's cash flows as much as just like value uh."
  }
]