[
  {
    "speaker": "Andy",
    "content": "future and they are willing to work with interoperability partners, solvers, and other providers in the space to build a interoperable and chain abstraction future. Check out Everclear at everclear.org and, welcome back to The Rollup."
  },
  {
    "speaker": "Rob",
    "content": "I was just going to say, I really hope that ETF still become the killer app for Bitcoin, right? Like..."
  },
  {
    "speaker": "Guest 1",
    "content": "And we all can leave the industry, there's no hope."
  },
  {
    "speaker": "Andy",
    "content": "I think one last thing to mention and then we'll wrap up here, we got to bounce is that you guys mentioned about the like the way that some of the builders are are approaching like the Core and Stacks ecosystems as well as just like Bitcoin scaling in general with regards to tokens. I think like that the one really big advantage um, from the mindset and kind of community perspective that Bitcoin has is that some of the OGs are like kind of anti altcoins, kind of anti all coins. Like, there's just like this meme around oh it, none of this is, is needed. Which I kind of find foolish in a sense, because I think Ethereum is extremely provable experiment that's gone very well, and that has kind of fostered innovation. It just goes down the line. Surely, there's a lot of shit coins, but I think keeping that culture within the space of building actual um, sustainable, business businesses and applications that aren't just like here to kind of like pump tokens out is going to be something that's going to keep the culture and community of the, of those applications actually reach real product market fit. And the, the innovation cycles will be less kind of slowed down, because in Ethereum the innovation cycles are always like funding apps for tokens, and I think that will still happen but it, it should, if this is, if this is the way that you guys are approaching and that you're influencing your communities, then that idea should be able to permeate into builders and have actual ideas be built based on real, you know, forecasting of revenue and real kind of product market fit, and less just for the sake of, of kind of launching tokens and things. And then so I think that that mental model while dangerous to Bitcoin in the early days because, oh, you know, ultimately Bitcoiners were wrong about that, and they'll still continue to be wrong about kind of like needing other, other, other networks. I think keeping that part of that inside of the Bitcoin scaling solutions is going to be, uh, super important for the, the actual use and sustainability of Stacks Core and these other chains. So I just wanted to throw that in there. And uh, yeah it's been a great pod."
  },
  {
    "speaker": "Guest 2",
    "content": "Awesome. But yeah, I, I think I echo your, your thoughts, Andy, is the idea of like these projects just being token factories and like the whole business of Web3 being launch token and terrains only a point of like, when go up, being your business model. Hopefully that dies. Right? Like that, that is like the, the worst part of, of the Web3 space and people need to be thinking about cash flows, transaction fees. Like you should be able to run a model and say hey, if this network grows 10x, 5x whatever that is, what does this actually look like for a business? Because I think we've all seen over like the last several cycles that if you don't have longer-term plans you just burn out. Right? Like you, you fly too close to the sun, there's nothing there, it's not sustainable. And I think it's like a healthy culling of the herd in some ways. Right? Where, it's either you want to participate or not, then like some of the conversations that, that I have is funny, because people will mention, they'll be like, well Core is a multi-cycle project or, or Stacks is a multi-cycle project. And you're like, that's such a terrible way to look at things. Where like, the expectation of your business is like under four years. Like what is that? Right? Like it's just totally crazy to me and, and I think that's where like the other thing that we're seeing in, you know, it's in the Bitcoin space and the Ethereum space as well is, this wave of builders has done things previously. And sometimes that's good, sometimes that's bad. But when you bring some of the you know, institutional knowledge of, you know, 10 plus years of operating whatever, you realize that these time horizons are a lot longer, and the incentives really matter. So I think you characterized it really well and hopefully that, you know, when token viewpoint you know, slowly dissipates."
  },
  {
    "speaker": "Guest 3",
    "content": "I mean, at the end of the day, tokens have to have utility. Bitcoin has utility, ETH has utility like that's, that's one way. Otherwise it's, it's just gas, bro. Like that's what, otherwise what a token should be used for, I'm sorry."
  },
  {
    "speaker": "Andy",
    "content": "Coming from a petroleum engineer, wouldn't expect anything less. Thank you so much. Guys, been a pleasure and, uh, rock on, great work in the Bitcoin space. Thank you."
  },
  {
    "speaker": "Guest 2",
    "content": "Thanks, y'all."
  },
  {
    "speaker": "Guest 3",
    "content": "Thank you."
  }
]