[
  {
    "speaker": "Andy",
    "content": "But like tying in the the the ETF and this kind of centralization of uh coins, there's no economic value being redistributed back to miners, being distributed back to apps on stacks, on core, uh contributing to the security of the network as a as a you know, as as a network itself. And then kind of like the only pushback on on OP Cat is that it's you know, this this timeframe idea and you know I put out a tweet that was like I think that the Bitcoin scaling space is going to shock a lot of people because I truly think that the amount of value that can be in these L2s and in these chains in on Bitcoin itself is exponentially higher than any other rollup or you know ecosystem or uh ecosystem of chains out there. Ethereum, Solana, L1s, but it's going to take longer than I think a lot of us expect or a lot of us hope for. Um, which I think is so so you know I agree with you there Rich and I kind of want to bring this back to this ETF to this kind of EVM conversation with regards to this recent WBTC happenings where BitGo is now transferring its its basically ownership of WBTC and the whole processes of managing it to a Justin Sun associated entity uh of which MakerDao has already taken away the ability to open up a CDP on Ethereum using WBTC. The governance proposal passed relatively quickly, and then just shortly after Coinbase puts out a tweet that goes viral, millions of views, just CB BTC. And so like how are we thinking about CB BTC this WBTC shift? And the question for for you guys is stacks and core, are those are those important? Do we need stacks and core in a world where all of the Bitcoin is just going to go onto CB BTC on base and it's going to be the biggest Bitcoin holder, Bitcoin L2 like how are you guys approaching this and why is it still so important you know, that that these solutions that you guys have built remain rather than just kind of all of this Bitcoin going into an Ethereum rollup or into some of these ETF providers?"
  },
  {
    "speaker": "Guest 1",
    "content": "So I'm happy to to fill this to start. Um disclosure I worked at Coinbase for a long time. I was super excited about CB BTC coming out. I think it's like a natural business for them, that they should have been in a very long time ago, like sometimes you get so big that it just takes a long time to do like these obvious businesses if that makes sense. And from what I've learned uh about CBTC, it's an exciting product and I think it's good to have rivalrous products when it comes to other centralized Bitcoin derivatives, right? Like WBTC has kind of been allowed to operate in in isolation for a long time, we haven't seen a lot of credible Bitcoin fully custodied derivatives come on chain, and in terms of core we welcome all of these Bitcoin derivatives. That's one of the reasons that core has 230 million plus in Bitcoin TVL, some of it is you know core derivatives like core BTC, others are sBTC and some of these other groups. We welcome them all and it's not going to be one Bitcoin derivative that sucks up a hundred billion dollars like anytime soon, right? It's going to be a diverse group of folks that built these different products. But that's where the the devil lies in the details and my guess is this is something that that Bruno will will also be aligned with is it's also important that we have decentralized Bitcoin derivatives. That is critical to the story of Bitcoin, and I probably talk to somewhere around a billion dollars of Bitcoin every week every other week, mostly in the context of core Bitcoin staking. But when we talk about Bitcoin staking or even core BTC, the first question that comes up with real Bitcoin holders is what are the trust assumptions? I know XYZ friend that lost a ton of money at BlockFi, or Genesis, or Celsius, and I'm just never doing that again, like I've seen I know I have too many battle scars from those sorts of stories. And with so many of these these conversations like you start to learn more and more that unlike Ethereum maybe Bitcoin really cares about trust assumptions. Like it's a very different ethos because most Bitcoiners like key drive in life is to earn more Bitcoin. Like that's it, right? And And that's a very unique spot for many Ethereum folks where if they just want to earn more dollars more Ethe like it's just a different pro like you're optimizing for for different things and that's also one of the reasons that you know folks like like core need to exist is we need to have these opportunities for Bitcoin natives to go earn safe yields on their Bitcoin to go enable these higher, faster, cheaper throughput use cases, and I don't think that will just be done with fully custodied stable coins on Ethereum roll ups. I think there's also one other piece is we haven't seen the killer app yet of Bitcoin DeFi. But we will. And I think it will be done with decentralized Bitcoin derivatives because ultimately that's how you're going to unlock the largest piece of that 21 million. It's not going to be just like a a simple plain Jane and I I I think think that we've seen in other spots using custody stable coins, otherwise WBTC would be a lot bigger than nine billion."
  },
  {
    "speaker": "Guest 2",
    "content": "Similar viewpoints. Look, WBTC has existed for years, yet only one to two percent is like bridged or wrapped in, like that's just the fundamental issue of no one wanted to trust a KYC'd Bitcoin. No one wanted to move their precious Bitcoin to accept another chain risk because you have smart contract risk. Like no matter what you no matter how you see it, with CB Bitcoin what I welcome is that look they have all the infrastructure tools in place whether it be getting to stable coins, access points, um smart wallets, embedded wallets, everything under the sun to actually make using Bitcoin a viable category which is awesome. I think anyone who's in Bitcoin has to be happy about that. Like if you aren't that's just like an asshole move to not be happy about that. But kind of going back to how much trust will I use with Bitcoin with a single custodian or a single party? Like that trust assumption is key. What I like about some of the other alternatives is that a decentralized signer or validator set is critical that is open that anyone can use. There has been others who have kind of attempted this through federated models but you cannot enter like there is no means to enter the federated model unless you are a federated entity or a party that can participate, and that fundamentally goes against the ethos of Bitcoin that anybody should be able to mine or participate in such. And so stacks, obviously, is launching their asset um towards the end of the year called sBTC that is using a open decentralized signer set to validate Bitcoin. It will it will be alongside the CB Bitcoin CB Bitcoins or the WBTCs in the world. But I think the most important aspect is will people use this in DeFi related activity kind of to Rich's point? No one wants to get wrecked by BlockFi or Celsius again. So will a open source known decentralized validator set be a step in the right direction as opposed to trust me bro, I'm a custodian or trust me bro, I'm Coinbase? Like I think there has to be that distinction of some of these entities are almost too big, so do you want to give an alternative approach or try?"
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I think it's helpful to look at Ethereum like there's Lido stake teeth has a strong dominance, and that's more of like the decentralized kind of like crypto native if you will and then like Coinbase ETH CB ETH is like shortly right behind it. So I think it's like a spectrum of people that will like want to choose both. But I imagine Rich in this crypto kid in this Bitcoin's DeFi um killer app it's probably going to be some sort of like CDP market with some like uh intricate yield designs and and perhaps some sort of way to really get a lot of efficiency for your for your BTC. I think that there'll be the two biggest uh kind of uh deposit in this will be a decentralized version. So stacks BTC, core BTC, f one of these and then CB BTC will probably be right there and I think different spectrums of people will have uh a a a kind of different risk tolerance or taste. Um, but I think generally what you guys are more so getting at is that the Bitcoin community specifically is not just going to be okay with Coinbase BTC. Like it's similar in the sense that like the Ethereum community shouldn't just be okay with USDC and USDT. We we have Dai we have others and so that's kind of like where we're trending towards."
  },
  {
    "speaker": "Guest 2",
    "content": "I think it's like a simple as thinking of look, one of the core kind of premises of Bitcoin DeFi is I should be able to get liquidity out for my Bitcoin because uh Bitcoin is a great li- like asset to use as collateral. Am I going to wrap it into WBTC and then go on Aave and take out a loan, or am I going to wrap it into or bridge it into a non-custodial kind of Bitcoin derivative asset and then take liquidity against my loan? Like I think there's like two other ways to look at it. And then like one that has always stood out to me on the WBTC thing is I believe there is a tax consequence for it. So like because it is a wrapper like you have to go through a wrapping, there is a tax event, whereas when you use some of the other assets like sBTC or cores BTC because it is a locking mechanism and then you're going to withdraw it. I believe that stays as a tax-minimized co- um event for let's say Americans."
  },
  {
    "speaker": "Guest 1",
    "content": "So I I believe Rena is correct in the tax consequences, but I do not play a tax professional so do not take Yeah. my my my advice for us, but like at least from like the moving from one to a Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "A- Absolutely. Like Totally agree, but I think that actually really does matter to Bitcoiners. Like like I I I like I'm I'm making a joke about the tax piece, but I actually do think that's really relevant because people are sitting on bags from 2012. Right? And if you're going to wrap it, it's going to cost you the cap gains on that that's crazy, right? Like that actually really is important. A hundred well, it's net negative, right? "
  },
  {
    "speaker": "Guest 2",
    "content": "Exactly!"
  }
]