[
  {
    "speaker": "Rob",
    "content": "Kind is is one of my favorite memes. Um, when I first got into Bitcoin it was like the verifiable money. I was excited to use money that I actually knew was there. Both my parents, they met at at a bank that doesn't exist anymore and both of them got laid off in the financial crisis. And so it's like when money's moving around and there's black swan events it's like, well where's the money? Bitcoin you can actually see where the money is at all times. And you know, anyone can see it at any given time on the ledger. And so yeah, I was really excited to to use money that I knew was real because I could I could see it. I could almost touch it with my own hands in a in like this, not a tangible physical sense, but like I knew it was there. Um, and so I I I think that narrative still exists today, but like whether or not we use that money to like reserve money and collateralize currencies that we that are a little bit easier to as a medium of exchange or we actually use that Bitcoin on a daily basis to exchange, I was almost a little bit more detached from that. As long as I knew that the money was there, like to me that was, that's what mattered."
  },
  {
    "speaker": "Guest 1",
    "content": "I mean, that was actually one of the classic arguments for small blocks, right? Like if we go back to the the block-size war, right? The idea was that if you had really small blocks, it would be able everyone in the world would practically be able to to verify the chain, and that was always, you know, one of like the straw man arguments as part of that story if you will, but it is a really important property when we think about, you know, blockchains generally is Bitcoin is max decentralization, right? And like that is part of its product market fit."
  },
  {
    "speaker": "Guest 2",
    "content": "It always stands out to me like it's max decentralization. You don't you know who some Bitcoin core devs are, but there's still no, like, governance foundation or CEO or anything that you can like necessarily point to and that's the beauty of it will always be permissionless."
  },
  {
    "speaker": "Rob",
    "content": "That that might be changing though. Like the"
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Rob",
    "content": "The banks"
  },
  {
    "speaker": "Andy",
    "content": "It's also, like, the downfall of the uh of these of these networks, too. Ethereum's going through this, like, phase against Solana where Solana's much more kind of top-down oriented and gets things done and has these conferences and doing does these marketing things that has a much more cohesive feel. And Ethereum's kind of, like, all over this, like, this non-for-profit organization, and and so Bitcoin's even almost, like, further down the line where it's almost like there's not a lot of leadership if you will, uh and which is kind of, like, delaying some of these upgrades and  Ren, you were you were kind of hinting at a couple uh small tweaks or upgrades that you think that that that the base layer should consider, that the community should be considering. And I think uh to put you on the spot, one in particular, with regards to what Rich was saying, was this increasing of the block size. I think that you have a a a take on that or um kind of perhaps a contrary view as well um based on these kind of verifiable properties. Maybe you could um illuminate some of the the changes and specifically onto the onto your ideas behind the block size uh conversation."
  },
  {
    "speaker": "Guest 2",
    "content": "Yeah."
  },
  {
    "speaker": "Guest 2",
    "content": "I think we're fundamentally limited by the block size as is. Like yes, you have a limit and I understand like why we have it for security architecture and like incentives enough, but if people truly want to do something more with their Bitcoin and build complex dApps, DeFi protocols, things like that, or um even go further in, like, the Ordinals space of Bitcoin Bitcoin art could be the next Picasso or whatever, maybe, or you want these, like, massively successful collections that increase in value to the Bitcoin network because it is backed by BTC, I truly think that the block size could stand to have some improvements on increment. And I think the challenge with like increasing the block space size is the kind of data and kind of complexity needed to maintain that from like a hash power perspective, from the miners, and such. Like, we're already in a state where it is difficult to bring in new miners into Bitcoin because the rewards are diminishing return over time unless the value of Bitcoin goes up. And everyone knows here, Bitcoin value will always be cyclical. You don't really you don't really know if it's ever going to hit that kind of um economic return that it makes sense to continue to mine, but I just feel like we're stuck in this infinite loop, just this current state of Bitcoin that we haven't done a major improvement since 2021 or 2017, like, those are the two last improvements, and if we want Bitcoin to fundamentally be around 100 years from now, we can't stay in this limited state. And you know, the perspective we're seeing is that we we operate a Bitcoin wallet called Leather, and we primarily are served by folks creating Ordinals or Runes. So like, that's the perspective I'm bringing.  They can do collections on you can do a collection under the four the four limit, like, you can still make it, but it will never be as metadata or complexity rich like what you can do on another chain. But if you fundamentally believe that um let's say an art piece or uh doesn't even have to be an art piece to be an Ordinal, can be any sort of inscription of data, should have the ability to be immutable, then increase the block space and just make people pay for it because people are willing to pay for it. That's the funny thing. I think people are very much concerned that fees will rise, transaction fees, but let it be competitive."
  },
  {
    "speaker": "Guest 1",
    "content": "Yeah, I think um I'll take the I'll take the other side for for like the the sake of the uh the sake of the podcast and and I think there's like there's there's merits to to all these different views, right? Like, I think even if you look at a lot of people that were on one side of the block size war, many people, you know, have actually changed their mind as time has gone on. Like, Matt from Thesis is a great example. He was like very pro big blocks, and then now he's much more like in the small block camp. So I think all of that is a continuum, there's always, you know, arguments, you know, kind of for or against. I think my my my current view on this is mainly that full expensive Bitcoin blocks are good. And I think we have this security budget problem that that we have to solve, and I I see the argument for having more and more of this economic activity on the Bitcoin base layer. But I also think that much of this activity can be on L2s, or it can be on side chains like core stacks. And and I think that that is how many of these things will likely evolve is you have a expensive mint process on Bitcoin that is like max security max decentralization and probably max expense to degree, and then a lot of the follow-on activity actually takes place off of Bitcoin L1. And I actually see that as a success case because ultimately, like, a lot of Bitcoin season 2 is faster, cheaper, higher throughput, you know, uh Bitcoin transactions on these, you know, additional scaling solutions. And and that to me, is just further the separation of Bitcoin asset from the Bitcoin rails, but you still have this really slow, expensive uh Bitcoin settlement layer. So I think it's really tough because there are these like competing views and you're never going to get to full alignment on Bitcoin, but I think also if we kind of go from a user experience perspective, Ordinals minting, Runes mint, like all that sort of stuff, actually isn't that bad at this point. Like, you have wallets like Leather and groups that like have actually, like, tamed the beast if you will, right? Like, they've made it much simpler and easier to use. I think when you take that to DeFi, it it gets really clunky really fast. And and I think that's where if we want to have user experience that's competitive with many of these, you know, EVM solutions that are out there, or, you know, just general Solana, etcetera, it'll have to be on on different blockchains. Just won't be on Bitcoin L1."
  },
  {
    "speaker": "Guest 2",
    "content": "I think that's a great point because when you think about Bitcoin, you want something that's simple to use, but when I want to do complex activity on Bitcoin, it's just it's not going to be on the L1, like, that's the fundamental truth. Like, I I I'm going to have to use an L2 because Bitcoin doesn't have smart contracts. It doesn't have just the native functionality of what we need to create something that could be a new financial system or whatever it may be. You're kind of limited on the finiteness of 21 million and the smart contracts. So like, you're kind of fucked on that, like, there's no other way to put it. But L2s that re-harness the hash power or security of Bitcoin so you get that kind of immutability factor to the best of both worlds is really where it's going to be, and so I mean, it's no secret that I contribute to Stacks, like, I am one of the core contributors to Stacks as while working on a wallet, and such, but that's, I think, where all this L2 kind of season 2 movement has been is everyone is in a rush to create their L2 to ultimately use the security of Bitcoin. But a lot of these L2s, like, really did it wrong because they're building EVM, like, let's not like just do we even go into that? Like, the entire point of Bitcoin was to be using proof of work because that was hard, concrete, and we know where the money going in and the security aspect of it.  When you go the L2 route to use EVM, I feel like you've already lost the argument because you're no longer using the beauty of Bitcoin, which is the Lindy effect for 15 years. And so anytime I look at L2s, whether it be Stacks or even other ones that we may integrate in Leather as a wallet, I actually look from that lens."
  },
  {
    "speaker": "Guest 1",
    "content": "So I think let me take the other side of that as well. So core is is EVM, and I think it's the the fastest growing Bitcoin scaling solution from like an ecosystem perspective. I think the EVM has 10 years of institutional knowledge, network effects, tooling, and and I think like virtual machines, many things can go multi VM at some point as well. Like, I don't think you're necessarily just fully locked in. Example, Stacks is also looking into Wasm, right? Like, not just not just Clarity. And and again, developer adoption really matters. I I think the proof of work EVM argument P"
  }
]