[
  {
    "speaker": "Guest",
    "content": "like is totally orthogonal. I I I don't think those are are related. You could in in theory have, you know, whatever VM you want there and still write, you know, data back to Bitcoin. There's some SBM, Bitcoin L2s as an example, right?"
  },
  {
    "speaker": "Guest",
    "content": "Uh I agree to your point. I think it's the runtimes to giving developers the comfort to to code in a language that they know and they know well just to bring the activity back. Like I totally agree partially why stacks exists and we're also looking at Rust. Maybe there will be a solidity runtime in the future because like totally see developers know what they know and some are willing to learn new languages, but a lot are not. So, I get that."
  },
  {
    "speaker": "Guest",
    "content": "Totally. I I think it's all about meeting people where they're at today, right? Because it's really important. If we build, you know, everything net new but can't actually attract builders or or TVL or transaction volume, that's not a success in in my opinion, and and I think there's one other kind of meta point that that you mentioned, and this is something that both Core and Stacks do in in different ways. Both are actually trying to add economic value to Bitcoin miners. They just do it in different ways. So with Core again we give part of our block reward to the 55% of the Bitcoin hash that's currently securing the network. That serves this, you know, exogenous block reward for Bitcoin. Stacks, with its Nakamoto upgrade if I understand it correctly, will also write state back to to Bitcoin, which will also help on some level with transaction fees. And I think that's the other meta piece here that there is like a Bitcoin alignment if you will, with the Bitcoin main chain that is very critical. And I think that's part of a differentiation from like random Bitcoin L2s with wrapped Bitcoin versus these Bitcoin scaling solutions, right? There is actually a deeper economic tie. And this is also why Core introduced Bitcoin staking, and it's the first of its kind protocol where Bitcoin holders actually receive rewards, helping to secure the core chain. Those same rewards that miners do. And with dual staking, you're actually incentivized to participate in both the Core network and the Bitcoin network as a staker. And I think this is really like the long-term future is how do we build POS layers or DPOS layers in Core's case, on top of Bitcoin. And it's a multifaceted problem. Some of its yield, some of its ecosystem, and I think it's being reality of what can we do to make the biggest impact to help move Bitcoin forward."
  },
  {
    "speaker": "Rob",
    "content": "I tend to agree. I think users want more expressivity, um, and miners need incentives sooner rather than later. And so it seems like there's a match here where this can be a win-win, um, but it might take some base layer changes in order to bring that about like the best way. And we we spoke about base layer changes a bit. And so everyone, I We actually had Tyler Whittle from Taproot Wizards come come on the show and talk to us about OP_CAT. OP_CAT, you know, is one of those base layer changes. Maybe there's more talked about block size a bit, which is it it wasn't as radical before, but maybe it's more radical than OP_CAT in terms of base layer changes now. Um, and everyone I talked to is pro-OP_CAT. Like I moderated a Bitcoin panel, everyone's pro-OP_CAT. Tyler Whittle like explained the case. Like the one argument against it I've heard is that it brings MEV to Bitcoin, but Ordinals and Runes created MEV on Bitcoin anyway, and we didn't even need to make a change to the base layer. And so I'm curious from like can either of you guys articulate an argument against OP_CAT?"
  },
  {
    "speaker": "Guest",
    "content": "I don't actually have one because I think OP_CAT, like honestly, is like quite sensible. There's only a very few set of commands that you can issue with OP_CAT, and like what we like about it from like the Stacks side is that it gives us a little bit more functionality to continue to develop, um, even more complex commands on the L2 side, but ultimately, we can bridge back or tie back to the L1 commands. Like that's the true goal. Like any Bitcoin L2 ultimately wants to benefit the L1 or we wouldn't be in this game to start. And so I have no negative detractors per se on OP_CAT."
  },
  {
    "speaker": "Guest",
    "content": "So, I I think like I'm pro-OP_CAT generally, but I think there the argument that people make is it's similar to like Taproot or something else where like we don't know what that complexity will eventually like kind of do to Bitcoin. But I don't think that's a bad thing, and and I think that's like one of the big struggles in the Bitcoin community right now is with the ossifiers. Right? And like there's always going to be that tension to ossify because like Bitcoin has a trillion dollars plus today in assets. It's got, you know, so much of that's in these major, you know, ETF products. There's always going to be a tension. But I think if we get to a point where we can't change Bitcoin, that is also really dangerous, right? And maybe the time scales, you know, get longer and longer. But I think some of these arguments into like, \"Well, OP_CAT will allow some sort of like crazy recursive DOS that like destroys the network.\" Whatever. Like I haven't found anything that is actually convincing me of that, right? Like but But I think there'll always be those arguments, uh, that will just be really challenging to to kind of get through. My biggest, you know, issue with OP_CAT is actually just a timeline. And and it's like I have no idea what timeline that will take. Is that two, like I've heard optimistically, it's like, you know, a year. Worst case, maybe like five years, but that's a fairly large, you know, like set of time which that can happen. And my biggest message to, you know, the the L2s out there is, \"Hey, how do we build stuff that isn't reliant upon these things that may or may not come in the future?\" It's my same thing that I talk about with BitVM. Core is super bullish on BitVM. We would love to create a BitVM bridge. It's just when is it ready? When is it practical? And like until we get there, building or or saying that you're using these things, I think, is a little disingenuous because I just don't think you're you're being reasonable or or like operating on practical time scales. And I think at worse, it's deceptive, right? And it's just that that balance is really tricky. But But I think it's like, \"How do we push these things forward?\" And ultimately, that will probably take to you, you know, as a pun, like a bridge to the Bitcoin community, right? Like like, \"How do we actually get enough momentum to bring one of these things forward?\""
  },
  {
    "speaker": "Andy",
    "content": "Welcome aboard on our journey into the singularity. This is the end game roadmap for Frax and Fraxtol: the new L2 out of the Frax ecosystem that is totally based on fractal scaling. Fraxtol, the modular L2 blockchain, built by Frax with modular and fractal scaling in mind. Fractal scaling is based on the Mandelbrot set of fractal images and it explains how L2s become L3s and the entire app chain life cycle goes through its evolution. The Frax ecosystem is made up of some of the top builders in the space and has stemmed from its OG days of the Frax stablecoin. It is now in the LST space, the LRT space and this Fraxtol L2 joins the existing suite of Frax products, including Fraxswap and Fraxlend. You can see Frax Fairy, the bridge to go from any chain: Arbitrum, Optimism or mainnet, into the Fraxtol mainnet. Bridge your tokens and bring your Frax assets into the Fraxtol ecosystem. Join today to get the best out of Fraxtol. You are still early. Join today, take part in our expedition into the singularity."
  },
  {
    "speaker": "Andy",
    "content": "Mantle is a layer 2 blockchain with one of the biggest on-chain treasuries in all of crypto, and they had a 100-day campaign called Metamorphosis live now. What this is is it is a campaign for their liquid stake ETH token, and ETH, as well as their upcoming liquid reseating token, CMEth, where you can utilize this token on the Mantel network in a variety of different apps, some of your favorite reseating protocols and DeFi protocols, and earn yields in the form of powder, which will eventually be turning into a a governance token. Mantel's been around for a while. We like them because they use their own form of EigenLayer, uh, they have a good ecosystem and they're growing. So check out this 100-day Metamorphosis campaign and hope you guys enjoy the rest of this video."
  },
  {
    "speaker": "Guest",
    "content": "I actually love that you brought up the um, brought up the ETF point because I might be one of the very few who like absolutely hates that there's a spot ETF for Bitcoin. Like I understand re-markets and all these things, but it breaks my heart that so much of Bitcoin is going to be locked in bank custody sitting in the Blackrocks or like like what we, what what the entire point of Bitcoin was to be money or an asset that is with you at all times, and you don't need to lock it in custody. And so, every time I see the inflows going into ETFs, I'm like, \"Great! That's less free Bitcoin for people to use on on-chain activity, whatever they want to do with it or not do with it.\" I just feel like if we kind of leave Bitcoin in the state that it is, the future of Bitcoin looks slightly bleak that one there'll be less miners, but two all our, all the world's Bitcoin will be in some Blackrock, some custody and such, and like that's partially why I'm like a little bit more bullish on the BitVMs or the OP_CATs or some of these small tweaks, because I think that's the only way that Bitcoin stays out of, um, 50% of the supply is locked in custody. Like we already have, like, supply issues as it is with so much Bitcoin just in cold storage just across the board that no one's willing to use or deploy their Bitcoin. But if we continue on this, \"Bitcoin stays in this, like, very narrow set mindset,\" I don't really know what the vitality of like Bitcoin markets for activity and transactions will look like like 100 years from now."
  },
  {
    "speaker": "Rob",
    "content": "Yeah. A lot to unpack there. So, kind of starting from the jump, like the, like the key thing that you guys were kind of going back and forth about with regards, like the EVM chains as well, was about this kind of economic alignment back to the L1. And so I"
  },
  {
    "speaker": "Andy",
    "content": "Yep."
  }
]