[
  {
    "speaker": "Rob",
    "content": "be still. So there's sort of a sense in which you can you can kind of you have it's like it's like lending our perpetuals but like you you are bounding the risk a little bit."
  },
  {
    "speaker": "Rob",
    "content": "And that's why I think you see this you know duality of man thing of like the finance side versus the pure tech side, right? Like it is actually like in the middle I mean that's personally why I find it the most interesting."
  },
  {
    "speaker": "Rob",
    "content": "But I like to think of, you know,"
  },
  {
    "speaker": "Rob",
    "content": "if if if we do some trad fi analogies first before we get back to the LRTs."
  },
  {
    "speaker": "Rob",
    "content": "Uh I like to think of, you know, the normal token market is like closer to equities and like lending protocols, like Aave, Morpher, compound,"
  },
  {
    "speaker": "Rob",
    "content": "those are like stock loans. Like I borrow against my stock, I get some cash, maybe I get liquidated cause the stock drops, right?"
  },
  {
    "speaker": "Rob",
    "content": "Those are very volatile loans, and they generally have low predictability because there's not really like revenue, right? Like I'm borrowing against a stock, but if the stock doesn't have dividends, then there's no real revenue. So I'm not borrowing against like future income, I'm borrowing against exactly what's there, so I have to be conservative."
  },
  {
    "speaker": "Rob",
    "content": "On the other hand, most loans in the normal world are borrowing against future income, right? Like a mortgage is borrowing against my future income to to pay for this house now and then I pay it over time, right?"
  },
  {
    "speaker": "Rob",
    "content": "Uh and most most credit in the world is is not like that."
  },
  {
    "speaker": "Rob",
    "content": "Now, stakers have the most interesting form of credit. They have a sort of cash flow coming in. They have the block rewards that are somewhat predictable. Now, they're not that predictable in the sense that like, hey, someone could just add a bunch of ETH to the pool, dilute my return and now I have fewer block rewards. They could add, you know, the fees might go down because the L2s are taking all the fees or what whatever whatever the reason is."
  },
  {
    "speaker": "Rob",
    "content": "Um"
  },
  {
    "speaker": "Rob",
    "content": "So they they still have variance. But they're much more predictable, right? Like they and and that's why you should really think of, you know, basic staking as like the bond market. Like there is some, you know, the default conditions are getting slashed,"
  },
  {
    "speaker": "Rob",
    "content": "but it's like generally a lot more predictable and and less you know, so you can be less conservative on lending. That's the other side of this. As like the biggest lending market in the world is the repo market for treasuries"
  },
  {
    "speaker": "Rob",
    "content": "uh which is like tens of trillions of dollars"
  },
  {
    "speaker": "Rob",
    "content": "uh you know, that exists daily."
  },
  {
    "speaker": "Rob",
    "content": "So it's like it's like huge."
  },
  {
    "speaker": "Rob",
    "content": "So there's sort of this natural analogy then that like restaking and I know people don't like thinking about the rehypothecation aspect because like you have a lot more safeguards on-chain, like the L1 contract can't slash you immediately. It's not like rehypothecation in the real world where like if someone fucks up, I have to go sue you, right? It's like it is different in that way. But there is a sense in which the payoff to the node operator looks a lot like getting leverage on my stake, but in a predictable way. Without going to Aave or without going to something where I'm taking a lot more relative risk because I don't know what the borrower quality is. When I think about the AVS as a borrower, their quality is much cleaner to assess, it's much more about the kind of credit rating of the AVS, what the historical fees look like, what their token looks like, all of these things, right? So because of that, it's like really like the bond market except you have a lot more protection because you do all these things that you don't need a legal system, right? That's the beauty of crypto. You can have all these conditions forgetting slashed and rewarded."
  },
  {
    "speaker": "Rob",
    "content": "So I think if you take that lens that AVSs are like the bond market, there's sort of a sense in which AVSs need to like generate predictable revenue. And I think one of the reasons the roll-up restake roll-ups and the centralized sequencers are at least from a naive standpoint, quite attractive as AVSs as we know they have regular revenue that you can then use to kind of decide how to think about this for. And so my suspicion is that the AVS market will unfurl in that it will start very bimodal. Well, they'll be like this huge set of companies that is are AVSs, companies that are building AVSs. That has very predictable revenue, like things people know how revenue: oracles, restaking rules, whatever. And then there's going to be this like whole like pure VC thing of like AI models and and whatever. And then over time people will learn a lot about them as they're live and they'll learn about the reward profiles, they'll learn about the slashing, and you'll slowly get more of your normal distribution Gaussian thing of like things that generate a lot of revenue, things that generate very spiky revenue, maybe might die, and you get kind of the whole bond market. And because of that, you need to think of the risk reward of the market in that way I think a little more than than like pure tokens where it's like more like equity where you really you really have to be more conservative. And I actually think the interesting thing is you can be more aggressive on the efficiency side and restaking then you can in lending in perpetuals. And that's that's kind of why I it captivates me but also it's like why I'm spending so much time trying to write the math for this is like showing that that's true is still it's like in you you intuitively feel it, but you don't have the exact kind of math yet. And like, I think we're like, you know, to your point earlier of like you start really conservative and you get more and more efficient. It feels like there's more steps you can take in restaking efficiency wise than you can in DeFi."
  },
  {
    "speaker": "Andy",
    "content": "That I mean that that's a great parallel to the bond market. Um and so I mean like I'm sure you've spoken to a lot of these LRTs, are they prepared to like like do they have the financial"
  },
  {
    "speaker": "Rob",
    "content": "I forgot, I didn't even really answer your question about the LRTs, whose"
  },
  {
    "speaker": "Rob",
    "content": "I I think the thing is like I think the LRTs are like bond funds or honestly, and like people will hate that I say this, but they're like they look a little bit like CDOs from like the financial crisis that like bundle a bunch of mortgages and securitize them. It's it's very similar."
  },
  {
    "speaker": "Rob",
    "content": "I will say the naming of the thing LRT squared is almost too on the nose because there's a thing called the CDO squared from the financial crisis that blew up very poorly that like it reminds me of. But maybe it's cause I'm old, and everyone else is ten years younger than we are. But uh I uh I I think there's kind of this like this kind of funny thing that it's like yeah, the LRTs are going to be sophisticated and like everyone knows all the funds that blew up in the financial crisis, but no one talks about all the funds that made tons of money and like figured out how to about manage the risk afterwards."
  },
  {
    "speaker": "Rob",
    "content": "And like it's not like the CDS market went to zero. It's still like a 10 trillion dollar market. So like my point is like you know, you have these collapses and crashes, but from those you you're able to learn how to make it very sustainable. And I think LRTs are going to have the same reckoning where someone is going to blow up. They're going to have chosen only the riskiest things."
  },
  {
    "speaker": "Rob",
    "content": "And and we saw this in DeFi summer."
  },
  {
    "speaker": "Rob",
    "content": "where after yearn was successful,"
  },
  {
    "speaker": "Rob",
    "content": "there are 5 million like yield aggregator clones, and the only thing they differentiated on was like how far on the risk curve they're going to go, like what new protocol were they going to integrate. And all those blew up."
  },
  {
    "speaker": "Guest",
    "content": "Yeah, cream cream finance is one that comes to mind on the lending side. Their entire edge was like you could just borrow against anything."
  },
  {
    "speaker": "Rob",
    "content": "And Alameda destroyed them over that. Yeah, like ironically. Exactly. Uh yeah yeah yeah. So like my point is like there's inevitably going to be the ones who blow up, right? Like but you can't control that. And I think the beauty of the decentralized world and transparent world is you can see all their positions. In trad fi, the CDO market CDS market you can't really see those positions. So like one reason I think the financial crisis was actually worse in some ways,"
  },
  {
    "speaker": "Rob",
    "content": "and this is my opinion, there's some data suggesting this, but it's I would say it's mixed um but it's just my so I'm disclaiming that is when you think about a loan, a mortgage, that defaults. It's not like and imagine there's a bank that securitized a bunch of mortgages and then sold it to investors. So like investors are like own this portfolio of like five mortgages. Now suppose one of those mortgages someone doesn't pay for a few months. You don't have like it's not like the security, like the thing the investor owns, immediately prices the default. Like the the thing defaults and it it like is in foreclosure and then maybe it goes to court, and then eventually after it's actually you know, somehow the title changes. Then the security suddenly gets repriced, right? It's like it's whereas in crypto it's like immediate, right? Like if there's a default event atomicity and composability mean it's like already at the end, like every possible person who depends on that state transition has already gotten it right? That's a very different world than the world that we see in the trad fi world. And that's also a reason why you can make these things safer because you can put all these safeguards when you know they're atomic and composable and you're not like waiting five years for some fucking random government municipal government to tell you that this house is in foreclosure."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, it's a much more dynamic world, right? And so when these LRTs are thinking about reallocating, and I think there's allocating when everything is fun and good and like very normal equilibrium circumstances. And then there's reallocating in the case of some some weird thing happening. And"
  }
]