[
  {
    "speaker": "Rob",
    "content": "Welcome back to EigenLayer Unlocked! Today we have an episode with Tarun of Gauntlet to discuss a lot of the recent research that Gauntlet has been doing in the restaking space. Uh, Tarun studied mathematics and physics at Cornell, um, so he’s got a way bigger brain than us, and is has also been involved with Robot Ventures, um, doing a lot of early stage investing. Congrats on the recent fundraise there. Um, and, yeah, man! Welcome on."
  },
  {
    "speaker": "Tarun",
    "content": "Great to be back."
  },
  {
    "speaker": "Andy",
    "content": "Well, you know, I I know this is a special edition, but."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, each time has been a special edition: the Modular March into the EigenLayer."
  },
  {
    "speaker": "Rob",
    "content": "One of these days we’ll just have a regular old, normal edition, and uh, and have some fun."
  },
  {
    "speaker": "Andy",
    "content": "I mean that should be your Halloween costume, right? It’s like a special it’s like, it’s like a special, one time thing like ‘we’re wearing a costume, we have a normal podcast for one day’."
  },
  {
    "speaker": "Rob",
    "content": "Well, let’s jump right into kind of the the core questions that Robbie and I had. We’ve been doing these presentations now for several weeks, really have opened our minds to a lot of the different uh, strengths and weaknesses of EigenLayer’s design, some of the innovative AVS use cases, um, and so we’re doing some research into Gauntlet’s uh, actual research itself, and we found a piece that you recently put out titled ‘How Much Should You Pay For Restaking Security?’ which we thought was particularly interesting that it discussed, kind of like how smart allocations to AVSs is very important. Um, AVSs are needing to provide certain amount of rewards in ETH terms to kind of help direct where these LRTs allocate. Um, what we’re trying to understand is what is the correct mental model for valuing crypto-economic security and how should we be thinking about uh, how teams should be valuing crypto-economic security?"
  },
  {
    "speaker": "Tarun",
    "content": "Yeah. So, um, it’s a great question. Maybe I’ll give a little bit of history first of like how we kind of got to that result and then um, you know, from there we can kind of talk about what it means. So in I think, I want to say, October 2023, or maybe September, I was talking with Sriram, and I was talking about this idea that, ‘hey, how do people think about AVS allocations? How should they think about you know, which AVS they’re in, how much uh, stake they allocate to each one?’ And it was kind of clear at that point that like one important thing in the white paper was there are some conditions on allocation that are based on security. And so uh, uh, sort of ironically, the source of a lot of the new research on restaking has come from Appendix B of the EigenLayer white paper, which is only like two pages. But it’s actually the most detailed part about this idea that like how you choose AVSs impacts security, like how node operators decide which AVSs they choose and how they choose the sizes is actually important to the global security of the network. And you can think of that as sort of a result that says, something that’s local, like ‘me, a node operator, how I choose something uh, converts to a global property like, there’s security across all the AVSs as long as everyone follows some particular set of rules.’ And so those rules in general in crypto, those rules need to be incentivized, right? Like they need to be, there needs to be some reason for people to rationally follow them, which means it’s sort of has to be profitable to do that. And so they gave sort of an initial kind of condition on what maybe those rules looked like. And then over time I had actually done some simulations based on some some old papers I had written in 2019 and 2020 on how you should think about security when you have liquid staking tokens and and LSTs um, and I was trying to modify them to say something about restaking in the sense of like, ‘hey, you know, there’s a sense in which you may want to allocate to Ethereum stake, AVS1, AVS2, AVS3. How do you determine that in sort of like some rational way?’ Um, and in the numerical simulations I had, there was sort of this interesting thing where like people who had static allocations, so they picked the same AVSs and they never adjusted, had sort of worse outcomes for themselves, and they also had worse outcomes for security. And security here sort of means, there’s a slashing event that occurs, that slashing event burns some stake, and by burning that stake it actually, potentially, if the the validator was shared across multiple services, burn, reduces the security of another network. So I think at the time last year, and this is kinda how fast this stuff moves, is like last year everyone was worried about the sort of like pre-launch, pre-anything being live. Everyone was worried about this idea that there’s these like cascading attacks where like an AVS gets attacked and then it reduces Ethereum’s security. Right? So like an AVS getting attacked, burns a bunch of stake, now Ethereum, the amount staked in Ethereum is lower, so it reduces the security, can that, you know, affect the L1? And another question you might ask is, ‘Imagine I got slashed in one service, can it affect the security of another service?’ And so that was a question that from this part of EigenLayer’s Appendix B, in the white paper, it became clear that actually you have to consider not just how much a service affects the L1, but also how it affects other services. Because a node operator could be mult, could be operating multiple services, and if they’re operating the same service and let’s suppose they got DDoSed or they went offline or they got slashed in some way, then they affect multiple services at the same time. So there’s some risk that there’s correlation between them. And so I sort of had these numerical results, but I was like, not, you know, I, I didn’t think they amounted to like a full theoretical thing, and, and that was around the time that Gauntlet, we started doing a lot of restaking analysis and, and monitoring the live networks. Um, but in February of this year, I was at an academic conference, and I was talking to a couple people about restaking, and they were like, ‘we have this paper, we have this result uh, about cascading attacks.’ And so cascading attacks against restaking networks are something where one service, you have an operator who’s operating multiple services, they get slashed on one service, it reduces the security of another service, which now allows someone to attack that service, which then might make another service attackable, dot, dot, dot, right? So it’s it’s, it’s sort of like in, in, in lending, on chain lending, there’s this notion of liquidation cascade, or in perpetuals exchanges, this is the kind of restaking analogy. Now, the interesting thing about restaking versus lending is it doesn’t really depend on an oracle price as much. Um, and so it’s a l, it’s, it has some extra security guarantees that are kind of different than pure lending or perpetuals. And so that was sort of one thing you have to include in the model. So these people, who are Tim Roughgarden and Naveen Durvasula, uh, they, they wrote this paper, um, and they sort of came up with some very hard constraints that improve upon Appendix B of the EigenLayer paper to show when you don’t have these cascading effects. Like if there is enough stake, like at each service, if there’s sufficiently enough stake relative to how much profit you could get from attacking it, then uh, you don’t have any of these attacks. So the first sort of research that showed there is a, a, sort of, a notion of security here in which you can kinda define what it means to be economically secure. Now their initial paper was extremely pessimistic. So like the results said you have to be very over collateralized. So this is sort of like what you see in decentralized stable coins like MakerDAO, or Sky, although now maybe they’re going back to being MakerDAO, but whatever.  Uh, where you have to be over collateralized in order to get some security guarantees, uh, an, an, an it’s sort of is, is, is interesting ‘cause there’s some analogs. Now what uh, what we were thinking of in this paper, ‘how much do you need to pay for restaking security?’ Their paper assumed there’s no incentives. They, they assume sort of people were operating out, purely altruistically, or purely randomly. Like you had no, you had no understanding like why they were operating a service. And so what we said is ‘but in reality people are operating a service, they’re running a node on purpose, they want to make money, they want to make profit, they’re rational actors.’ And so we were able to include that into the models, and then we were able to sort of analyze these protocols to say what are the sort of minimum rewards or the sort of minimum profit node operators would need to make in order to actually get this like security guarantee to actually, you know, have them operate a service in a way that doesn’t make it, you know, attackable. And so we call this the EigenLayer Economic Security Minimum or ELESM. And so we’ve, we’ve published that in a couple different papers now. And so the idea is that we’ve sort of defined the, you know, minimum profit a node operator needs to make to sort of achieve this sort of, you know, economically secure network. Now, the interesting thing about this result is it gives some very strong constraints that are very hard to achieve in the sense of like if you just want to run a node, it needs to be very profitable, right? Like, you know, this doesn’t really account for like MEV or these other sorts of income streams that you know, node operators might might be able to get from from operating nodes, but like purely just from you know, let’s say, staking rewards, block rewards, it needs to be very profitable. So then that gives sort of like a constraint on the protocols to actually like increase the amount of rewards they have in order to actually meet this economically secure condition. And so, you know, we’ve started publishing this, we’re also monitoring, we’re also showing it to, you know, the teams that we work with. And we’ve actually been thinking about ways to extend this, right? Like you know, as you guys have been doing these like EigenLayer unlocked videos, we’ve been learning a lot. Like we we didn’t really consider what happens if you know, someone’s operating nodes across multiple services and how that affects the ELESM, and so there’s a bunch of different directions we’ve been thinking of extending it. And I think one of the things we’re going to work on is is how do you actually incorporate into ELESM these cascading effects of having a node operator across multiple services, because it’s not just that you need a certain ELESM for each service, but it’s actually like you have to, you know, adjust it to account for the fact that someone may be running multiple services at the same time. So that’s one direction. Another direction we’re thinking about is, you know, right now a lot of our papers, we kind of ignore MEV. We assume that it’s just like these pure sort of like block reward slashings. And so we don’t really model like the fact that you can like you know, front run people or, or, or these sort of different MEV extraction, you know, strategies that you can use to make money. So how do you actually incorporate that into the model? It becomes a much more complicated model. It’s not just sort of these like pure security constraints, but it’s actually like how much MEV is there? Is MEV predictable? You know, how much can you actually extract? And so there’s, you know, a bunch of different modeling challenges, but like the direction is sort of like how do we incorporate this notion of MEV into ELESM? And so those are just like two areas we’re thinking of, and I think there’s a bunch of other areas."
  }
]