[
  {
    "speaker": "Rob",
    "content": "So in that case, everything moves much more quickly because they're all everything is programmatic. And so what kind of programmatic controls do you anticipate these LRTs or even like, you know, these guys that are just ri running EigenPods with their own ETH and not in in LRTs? What kind of programmatic controls could they have or should they have to reallocate risk in in sort of a black swan event?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah, that's a good question. So, I think a couple things are one being, being cognizant of the overlap between operators of the same service. Like will they all get slashed at the same time? Will we be correlated in the same way that you had this kind of like correlation event? The financial crisis is like, I I sorry I keep referencing the financial crisis, but like it's just a very easy analogy to make of like"
  },
  {
    "speaker": "Rob",
    "content": "The thumbnail's gonna be the rune restaking financial crisis."
  },
  {
    "speaker": "Guest",
    "content": "No, no, no, no. That's definitely not what I'm trying to say. I'm just like Well, the funniest thing is I wrote So, a long slightly long story, but why I got into thinking a lot about restaking, before it was live, like kind of when, you know, I mean I I invest was one of the first investors but I that was more 'cause 'cause like, I think Shriram had a really good idea, but I think the way it was presented in the beginning looked a little bit different than restaking. And when it kind of c- once it was kind of more like restaking, that the number one thing that I've been thinking about is I wrote this paper in 2019 and 2020, with Alex Evans from Bain about uh how to model LST risk. And the interesting thing is we we made this model and showed these properties which basically showed that like, an LST is sort of in a lot of regimes, very similar to a mortgage-backed security. It like has a lot of properties of mortgage-backed security. You can think of the mortgages as each node operator's non-fungible position of locked ETH in in this case. And the LST is this basket of them. And like if if all of them default at the same time, they'll get slashed at the same time. Your LST will be could be worth less than what you think. Um and so I had sort of been like, \"Oh, this restaking thing has to be kind of credit default swap bond market like\" 'cause it like if the LSTs were like that, then like this has to have some flavor. And it doesn't have to be exactly the same, right? Like again, the main important thing is that in a programmable money world, these covenants in a loan, like, \"Oh, if this condition happens, you're defaulted,\" or \"If this condition happens, we pay you.\" In the real world, those don't happen like instantly at the right time. They happen kind of slowly, by osmosis. And between 9:00 to 5:00, or whatever. Right? But the idea that I those happen immediately, means that now I can put in conditions in the contract, that are like, \"If these two events happen at the same time, do X.\" So i- if I get slashed in A and slashed in B, then do Y. And this is the type of thing an LRT can do in response in a way that you kind of can't do in a nor- in the normal world. It's like the two event, the correlation, is truly there like, but you don't see it 'cause it's not transparent, and it's not obvious to you. And I think blockchains allow you to actually have that be extremely transparent. And so you can now put all these extra conditions, or like, \"If these two things happen, reallocate, move my ETH, do whatever.\" Right? And I think that are initial paper, kind of was built around showing something like that. Uh and and the title of that paper was like, \"What Proof of Stake Can Learn From Mortgage-Backed Securities.\" Which is kind of similar to another thing. But like, I don't wanna like raise the alarm bells. I wanna make more be like, \"Hey, those secu- things are like maligned in my opinion.\" I think like, credit default swaps, it's still a big fucking market. It's not like it went to zero, right? Uh and it's 'cause it's useful, and people get value out of it. It's like a better form of insurance. And if you look at a lot of the stuff in restaking, like StakeSure, a lot of the insurance sounding things within restaking, they have a lot of that in it, except because it's programmable, you can do a lot better. And like, we should be thinking about how you can do all that stuff better. And like that's, to me, that's sort of that's sort of how I I view this. Is like, I can write these I can write code, this is \"If these two events happen together, like get the fuck out of this other AVS.\" Right? Like I can't really do that in TradFi right now. It's like, it's like too many disparate systems. They might not tell me the state of everything immediately. I- it's just like y- you don't get this this atomicity stuff is like extremely important to risk management, which I think TradFi people don't have. They hope for the legal system to make up for that lack of atomicity."
  },
  {
    "speaker": "Rob",
    "content": "I mean, for for all those advantages, would you to say that it's just a matter of time before this whole reverse repo market, $10 trillion credit bond market, is on-chain?"
  },
  {
    "speaker": "Guest",
    "content": "I would love I would love to see that. I mean I I actually think like the credit default swap market itself should probably like on-chain makes way more sense than this bilateral party shift that we have. Um it's also a market that I bet you would be 10x the size, if it was global. So, it's a market that's extremely local. Uh mortgages and credit default swaps and bonds are very tied to whatever country they're issued in. And we live in a world of internet. Bonds should not be restricted to one country or one place. Liquidity should be restricted. And like, all crypto is showing you is that you give people the advantage to to not have to think about that, you can get a huge amount of growth. And uh I I I generally think like that. That's gonna be true for this stuff, too. And that that's why restaking is exciting 'cause like, i- if there are real services that are not rollups, that generate a ton of revenue."
  },
  {
    "speaker": "Andy",
    "content": "I th- that that's like an international company that anyone in the world can buy the bonds of. So that that's kind of what you're, you know, like you can't do that very easily."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "I mean, the bond market is even harder to trade than the equity market, right? So, it like access-wise."
  },
  {
    "speaker": "Guest",
    "content": "Yeah."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I think that that that goes back to your previous point and and I wanted to kind of double-click on that as far as the revenue of rollups. I had a really good presentation with Emre, AltLayer. That was the thing that particularly stuck out to me. We we we've asked a ton of these different AVS projects or se- services like, basically, \"Where's the demand gonna come from? Where's the yield gonna come from? Who's going to kind of uh uh, you know, make this work?\" And um th- the decentralized sequencing answer was was definitely one of the best um as far as a clear product market fit, in today's world. But then kind of to flip that on its head, if these um AVSs or if these services all launch tokens, which to me is still kind of fuzzy, because my initial unique value proposition of EigenLayer and restaking is like, \"You can bootstrap your own service or your own network, without having to kind of launch a token and launch this uh um, you know, Proof of Stake token and go go down that kind of path.\" Which it is it's it's clearly not gonna be the case because these these these AVSs are funded by VCs. There's li- uh liquidity tokens are the way. So, this kind of brings me to like a two-part question, which is one, in the immediate term, do our is the revenue really gonna matter if there's token incentives to kind of uh and token emissions that can be basically forecasted as revenue? And two, how are we thinking about the value of AVS tokens and service-based tokens, compared to like an L2? Um like like yeah, like what's your mental model there for the these tokens?"
  },
  {
    "speaker": "Guest",
    "content": "Yeah. 'Cause there's still yet to be launched, you know."
  },
  {
    "speaker": "Guest",
    "content": "Uh I I apologize for always thinking about everything in terms of like basic finance, but the math always makes more sense to me. And I would say the the interesting thing is, like, in normal companies you have derivative instruments, like safes, for raising money that are effectively bonds that deliver a interest rate in equity. Right? So, it's like a safe, bought this derivative and I pay I get a discount and uh evaluation, and based on the next evaluation, I get uh, you know, I I get some guarantees. But my interest rate, and and arguably my principle depending on how you look at it, is effectively paid in equity. I think the interesting thing about tokens is, people will flip that. They like they they they have like uh an equity product that is like converting itself to a bond over time, right? It's like, \"I'm paying you these block rewards until I get fees, and then it becomes a regular thing.\" Right? So, think about Ethereum. It's like, \"I'm paying you in equity\" in Ethereum block rewards to participate in the network, with the belief that there's future fees, and those fees will be regular, predictable, dot dot dot like some some kind of understanding of them. And then if that's true, then I become a bond. Right? Which is like, if you think about ETH, it like had this reverse transition of what a safe like uh uh uh a kind of a company would raise theoretically money on. These convertible note type of things. It's sort of the in-between stage."
  },
  {
    "speaker": "Andy",
    "content": "An AVS had that, as well. Recently i- if you see the chart, they did full emissions for like the first two years or three years. That was like the main source of revenue. And now it's those have stopped, and it's pretty much fees."
  },
  {
    "speaker": "Guest",
    "content": "And I think I think I mean like capitalism is capitalism. Like, you don't fucking make fees, you're not surviving a long time. Like I don't I don't care what meme coin, bullshit tokenomics thing you do in the long run. Like, in the short run you can do stuff, but I think eventually you have to be able to convert equity to bonds. And like that is kind of an interesting thing about crypto. Because if you have programmatic money, it's much easier to adjust how you emit your equity API"
  }
]