[
  {
    "speaker": "Guest",
    "content": "at large is verifiable cloud, right? Like notion of cloud services, I can verify anything or everything that's going on. Inevitably that has some things that are let's say subjective decisions amongst node operators and maybe you have to say the word intersubjective somewhere to to to reason about this. In that world, I sort of view Eigen token as the thing that is the excess value created by having this full verifiable cloud over just the bonds, right? And the value Eigen itself, as a token, is like that that that delta. Now, I think the verifiable cloud stuff, you know, obviously, we have proven out, if not product market fit, insane demand for the bond market, right? Like there's no doubt that all these people, with a ton of assets staked, are like, I want more yield. And I want it in some way that's predictable and lower variance than like lending it. They they flooded in with $15 billion, right? Like that that is representing the restaking aspect. But the verifiable cloud aspect has this resolution, dispute resolution aspect on top of just the bonds, right? Um dispute resolution is very hard. In the normal world, it comes down to legal contracts. So one of the most difficult dispute resolutions, and and I'm I'm saying this one because this one is an intersubjective dispute, and even though it's a tradfi boring world dispute, it is it is actually meets the definition of intersubjective dispute, where there was a fork. Which is Argentina sold a bunch of bonds in the US, I forget exactly the year. Uh and then over time, kind of synthetically defaulted, didn't pay, whatever, at a bunch of hedge funds, namely Elliot Management and a few other people, bought a lot of those bonds at a huge discount. And then the Argentine government and the US government, or the US court system, negotiated on bankruptcy with the with the of those like default of those bonds with the bondholders. And these hedge funds who had like some minority percentage, um so less than less than 50% by a lot, uh held out. They said like, we're not taking the settlement. Like like Argentina, the country, agreed with most of the bondholders. And these these people held out. And they held out for like 10 years. And then they eventually got paid out. And the court system here but in Argentina, this was viewed as illegal. Like this was like not uh a real thing. But the problem is, they issued the bonds in the US, so they're custodied in the US. The US was the L1 that was managing them. And Argentina, the L1 was like, fuck you. We don't recognize this. And then 10 years later, they eventually came to some agreement. So Argentina forked and then they merged again. And you could kind of view this dispute as like the reason you need this intersubjective thing for the verifiable cloud. That's that's like the finance answer. Is that the bond market could actually exist without this resolution, if you have very clear default events, like clear slashing events, like you didn't send a block in five seconds and everyone gave timestamps and showed you didn't. But for these more unclear ones which are like this Argentina thing, I I I I think you you do need to sort of you do need this extra layer. And that's what Eigen token values. Now the question is, we need AVS's live that are getting in disputes over, you know, for this to work. So Yes. it's very forward-looking. It's like in in in my mind it's like the corporate bond market existed for decades before we started getting all these like 1980s onwards intersubjective disputes that were like, uh, which kind of resemble the forking. So, again, I apologize for my my always bringing everything back to financial history, but I do think there are analogies to this intersubjective stuff that exists."
  },
  {
    "speaker": "Andy",
    "content": "Yeah. Yeah, epic conversation so far. I mean, we we touched on kind of how how to value cryptoeconomic security, um smart allocations to AVS's, AVS yields, revenues, kind of the the how we'll see the power law play out there, LRTs allocating staked AVSs, how how kind of you and Gotland are thinking about that. And all the parallels to the the the CDOs and kind of bonds throughout the entire conversation, tokens, valuations, all I can say is uh this has been a banger, and thanks for coming on."
  },
  {
    "speaker": "Guest",
    "content": "Thanks for having me."
  },
  {
    "speaker": "Andy",
    "content": "Very helpful."
  },
  {
    "speaker": "Rob",
    "content": "I appreciate your financial analogies. I think they're stronger than just analogies, I think they're they set their precedents."
  },
  {
    "speaker": "Guest",
    "content": "Well, I just think it's like easy to reason about, you know, it's like cuz I feel like there's always new words in crypto. And if you reduce them to old words, then you're like, oh, I know these old words mean this."
  },
  {
    "speaker": "Andy",
    "content": "Yes. Reduc- reductionary, spoken like a true mathematician."
  },
  {
    "speaker": "Guest",
    "content": "It's just easier."
  },
  {
    "speaker": "Andy",
    "content": "Thank you, sir."
  },
  {
    "speaker": "Guest",
    "content": "Thanks."
  },
  {
    "speaker": "Guest",
    "content": "Thanks so much."
  }
]