[
  {
    "speaker": "Andy",
    "content": "So, so Jeff, um, I don't know if you remember our first podcast episode, uh, we were DeFi Slate in 2020. You don't even you don't even freaking remember it. This is what I mean. And this was like actually, this was like June 2020. So, actually, like the token hadn't even ripped, the ecosystem hadn't grown and, uh, as part of the podcast uh as as I, uh, thank you, you you gifted me uh a piece of Axie Land when Axie was like, I don't even know, man. Actually it was like 10 bucks. I'm not even going to say what that got to or like what happened but that is our lore, Jeff. So, welcome back to the Rollup now from DeFi Slate days. We're live in Bangkok. Thanks thanks for joining."
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, thanks for having me."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, it's it's been a pleasure to see you guys grow and kind of evolve into Ronin now, which has got massive users um, and just kind of that evolution. So big, big congratulations and how you feeling about Thailand and just, you know, the space as as a whole, everyone's super bullish. So I mean"
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, I mean, it's been a quite a change in the last couple of weeks. Um, it feels it really felt like uh, momentum shifted and uh, I think there's a lot of reasons to be optimistic. The vibes here in Bangkok are stupendous. It's actually my first ETH Con. Uh, so, I'm here exploring, uh, soaking things in and uh, yeah, it's been great, good."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, and I think, you know, a lot of people are familiar with Axie from kind of back in the day, but maybe not I I haven't really been keeping up with the times um, despite the growth that you guys have had. So, maybe you could catch us up on, you know, how how things have been going in recent months and even a couple of last years."
  },
  {
    "speaker": "Jeff",
    "content": "It's a bit reminiscent of last cycle, right, where 2018, 2019, even 2020, we were just heads down building uh, you know, made a lot of improvements and then blew up uh, with as the cycle uh, started to heat up. That was 2021. I feel like a similar thing has been happening uh, where, you know, Ronan has gone way beyond Axie, right? Um, we had a game called Pixels hit 1.5 million DAU, right? They're generating, I think, like 1.5 million dollars a month in revenue, right? So, proving out that hey, like this infrastructure works. It worked for Axie, now it's working for the next generation of Web3 games. So, yeah, it's, you know, it's been a lot of our focus is, you know, still maintaining and keeping updates to the Axie universe, uh, a lot of like economic experiments um, but also, right, basically how do we build this Web3 publisher stack. What are all the, right, considerations, how do we help with distribution, right? Um, so, yeah, there's been a lot of what's consumed us."
  },
  {
    "speaker": "Andy",
    "content": "What is a publisher stack? Like, what does that entail?"
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, so that's what we're looking to define. Um, generally, in Web3, not just in gaming, right? You have a lot of technical founders that need help with distribution, right? They can build but they're not super sure how to sell yet, right? Uh, so, because we had this dormant, right, or relatively untapped player base in Axie, right? That was already knew how to play Web3 games, already had a Web3 wallet downloaded, um, that's been proven out as like a good initial distribution channel for these game developers. They can get their first 10k, 20k, uh, you know, kind of their golden cohort of initial users and testers and right, basically, then scale from there. So, yeah, we helped them with you know, we help uh, the games on Ronin, right? With uh, distribution. We have 12 million emails. We have 15 million Ronin Wallet downloads. We can send push notifications. Obviously, like we have our channels, right? So, a lot of it is that and then there's like the solutions engineering, right? Like, how do we improve our docs, uh, how do we make it so that deploying on Ronin, making a game on Ronin, is like more self-serve and less like manual hand holding."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, I think that's one of the big things we're at that we've been talking about, right, is like this building these infrastructure stacks and then being able to be a means of distribution for application builders to come in cuz, like what do Devs want, right? Devs want their their their stuff to be used, right? Like they want users, they want real time activity. And so, uh, one of the core things that Ronin has been battling with is like this idea of right now a lot of the crypto ecosystem is like very like PDP in terms of fighting for a small pie, whereas, uh, if we can go out and actually kind of build distribution channels to non-crypto-native users, and I think gaming is a really big example of this, then, you know, we can we can basically focus on on a blue ocean rather than kind of fighting for what we have here. And I feel like, uh, Ronin is a great example of this for new application builders. Um, like what what are some of the distribution strategies that you've seen that work? Like when application builders come to you, game builders, they're like okay, we want to build on Ronin, like, what do they get the most excited about from the distribution side?"
  },
  {
    "speaker": "Jeff",
    "content": "So, we have great, like, we have this passionate community, uh, especially in places like the Philippines, Indonesia, Vietnam, Argentina, Venezuela, Brazil, uh, and we can activate that community, right, for the different games that are coming on to Ronin. So, Pixels, uh, when Luke, uh, the founder of Pixels, reached out to us, it was like hey, a lot of our players are actually from your community. Uh, we've seen that they're really good fits, like we want to migrate our entire game over to Ronin because we know that the rest of the community is going to love this thing, right? So, uh, we also like we have all the tools that you need and they just work, right? Like, we have an NFT marketplace. Uh, we have a, we have a Dex. We have a wallet. All of those are pretty vertically integrated uh, amongst each other, which creates this smoother uh, user experience, right? So, our you know, experience, we didn't initially want to build a blockchain, a wallet, everything, right? Uh, we deployed on Ethereum um, in 2018, right? We were from the CryptoKitties community. We deployed Axie Infinity on Ethereum but we knew that we would have to think about long-term scaling right off the bat. Why? Because obviously CryptoKitties uh, clogged the entire network, right? But we didn't want to build that ourselves, right? So, we explored things like Loom Network, which was like an early like Plasma solution. It was kind of it was kind of on the right direction, but it was just too early. You can't build your startup on top of another startup, right? So, that's basically why we built Ronin, like, to build all the tools that we needed for, uh, building to scale Axie. And then right, the idea was like, hey, we prove it out with Axie, then we can do it again. We were starting to see that play playbook unfold, right? The hypothesis was, we could recreate that Axie magic with other games uh, using the same infrastructure and, uh, you know, we have some indication that that's working through case studies like Pixels."
  },
  {
    "speaker": "Rob",
    "content": "Yeah, that that's exactly what happened. Um, and one you know, one of the things that kind of was most exciting to me when I was thinking about Web3 gaming was this idea of worlds colliding. There was actually like, it's a kind of a blast from the past but I used to watch like Fairly OddParents and Jimmy Neutron, and they did like this mash-up episode."
  },
  {
    "speaker": "Andy",
    "content": "Dude, that was wild!"
  },
  {
    "speaker": "Rob",
    "content": "And so, there was like there was this vision that for Web3 gaming where you can have a game over here and then you can have a game over there, but if they if they, you know, are synergistic and composable like these DeFi Money Legos from from DeFi Summer, that could be a really immersive, really fun gaming experience but that's only possible if they they share infrastructure. And and, you know, I guess the question here is like how how can we make that a reality? What is kind of the infrastructure that is providing the network effects to Pixel and and Axie? What are, you know, how how do those network effects manifest in in today's terms?"
  },
  {
    "speaker": "Jeff",
    "content": "Right, so network is a system that gets basically more valuable the more connected it is, right? With each subsequent uh, connection. Um, and the idea, right, is that because this is a gaming network, right? Like, every every subsequent user basically adds more value because that provides, right, more player liquidity. The games actually get more fun to play as you as you have more people in the network, right? Like, Axie originally, the PVP card battle game, right? We thought of we thought of the use of incentives there because it was like hey, if we use incentives to get to a certain number of players, this game is actually going to be more fun. And that's basically that's what's happening on Ronin, right? Like, every successful game that launches comes, brings net new people in into the network and it makes it right uh, an easier road for like, the next game that's deploying on Ronin right, cuz you have a larger audience. Um, so, yeah, you know, I think in terms of like the inner op, uh, you know, I I actually see that in terms of like user acquisition, right? So, Pixels did this really well where they were integrating different PFPs and NFTs to use as your character skin in the game, right? So, there wasn't much utility to be honest, right? Uh, it was more just like, hey, you can use your character in this game and that was a great top-of-funnel uh, mechanism for them, where, right? It's like, you're, let's imagine imagine you're holding this useless NFT, right? Nothing has happened since 2022. All of a sudden uh, this game says hey, like, you can use that NFT in this game as a skin, you're going to check it out, right? Uh, so, that was an interesting insight for me from the Pixels team was, they they said, hey, like, the ones that are actually working out the best are not necessarily the most popular NFTs. Uh, it was more like, the the NFTs that had like pretty strong communities, but the team wasn't shipping anything."
  },
  {
    "speaker": "Andy",
    "content": "Got it. Yeah, I mean, that's an interesting kind of uh, dynamic between, like, reactivating uh, dormant assets or or just like dormant communities from different, uh, from different geo geographical locations or just different online organic communities. And and I think, like, one thing that that Ronin has has done well is actually like get users. Like wow, we have users, like, on-chain, like, not bots, like, real users, right? And so, you guys have some pretty impressive stats on your chain um, and kind of those users are active on a daily and a monthly basis. Uh, talk to us about kind of like, what some of those stats are, uh, why those users are so kind of fervent on Ronin, and kind of like how you guys have built Ronin to be very uh, like like what other builders can learn from Ronin's catering of their users and like how you guys have done such a good job of keeping those people on your chain."
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, so uh, the Ronin Wallet has been downloaded over 12 million times. Uh, Ronin has around 950,000 daily active on-chain addresses, around 4 million monthly active on-chain addresses. I think it's right, by number of users, the fifth most used chain right now. Sometimes it's number three, it fluctuates a bit. Um, and, yeah, we've we've put a lot of focus on users. Uh, I think a lot of platform and ecosystem builders right, they just try to build better tech and then try to do good BD, and and hope that uh, people choose them, right? Or, they have to compete with large grants. Our approach is very different, where I'm not saying it's easier or harder. This is just the approach that was viable for us was, hey, we build our own killer game, killer app, proved it out, uh, use that use the chain actually to to scale that out. And then, boom, right? Like, we have this proven uh, case study. We are our own, uh, dog feeding experiment and then uh, you know, we brought it out and it was like, because we went through that process of building a game, we knew right? Like, what are the things that are important. Right? We were able to prioritize uh, what we actually built out for the chain, right? So, we knew that hey, a wallet's going to be super important, right? Like, uh, some sort of NFT marketplace, a Dex. And those were really like, a lot of the core components that we had to build. Uh, and we chose to prioritize. Um, so, yeah, I think like we've gotten users because we're supremely practical. Uh, we are the users uh, of our own infrastructure as well. Um, so, I think like, basically that that really tight relationship between right? Like our game building prowess and our infrastructure prowess. That's something that's pretty unique and uh, I think that has allowed us to prioritize uh, the expansion of our ecosystem in the right way."
  },
  {
    "speaker": "Andy",
    "content": "Interesting. I think like, uh, what's funny is that the the valuation today of crypto assets tied to the fundamentals is still like disconnected. Right? So, like, uh, Ronin being in the top five uh, user based chain, you would think that like there would be a extreme valuation premium directly correlated to Ron, the asset. Uh, how are you thinking about Ron the asset as it persists in the Ronin chain and in that ecosystem um, and kind of like what's the what's the way to think about Ron the asset as a as a core function of Ronin for the community?"
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, so, Ron is a gas token uh, you know, on uh, is used for gas on Ronin. Um, uh, you can stake it uh, to also validate, uh, transactions. Uh, but we also have this like, other, I think, unique aspect of it, which is basically the socialization of core utilities, um, on the Ronin chain and that being another alternative source of, of fees. Yeah, when you know, fundamentals are basically underrated right now, uh, to say the least. Yeah. Uh, that will not always be the case. Uh, I I believe that Bitcoin and memes had like some sort of regulatory moat uh, during the previous administration uh, that will is now eroded. And, uh, I think that builders were very limited when it came to the ways that they could consider adding utility uh, to their tokens, and things are about to open up a lot when it comes to experimentation. Um, I believe that, so, last cycle, we did a lot of experimentation with distribution of tokens, right? Emissions of tokens. Farming, airdrops, uh, the whole nine yards. Play to earn, is, in my opinion, just a, uh, novel uh, reinterpretation of DeFi farming mechanics in gaming. 100%. Uh, but, so, that was last cycle. I believe that this cycle, a lot of the experimentation and exciting new things will actually be uh, around utility of tokens, right? Buyback and burns, um, new, basically, ways of, uh, uh, demand and this ties to the meme coin Bitcoin thing, right? Where it's like okay, meme coins, people buy them because they don't have to fight the unlocks, right? Yeah. So, if you don't if you're very hand-held uh, if you're basically very restricted with the types of utility that you can explore for these, uh, utility tokens, right? Like it's, you're in the worst of both worlds, right? Where you have unlocks but you are unable to actually give the token substantial utility. Right, and that's shifting now basically."
  },
  {
    "speaker": "Andy",
    "content": "Right, because it hasn't. Yeah."
  },
  {
    "speaker": "Rob",
    "content": "Right, cuz you have the seed there, right? You have the community. I'm sure this this community, right, has values, right? But, why have like what what is the the gap that is getting crossed into monetary premium? Kind of like, how how do we cross that chasm?"
  },
  {
    "speaker": "Jeff",
    "content": "Yeah, I think I think there are a couple of updates that will help with that. Um, you know, traditionally the Ronin community has been a little bit isolated from the rest of the Ethereum community. We started out on Ethereum, and we've always kind of uh, been exploring scaling, right? The basically the history of our blockchain, I think, is really interesting, right? First on Ethereum, then some partially on Loom Network, then right through the to the side chain. Uh, so, I think a couple of things. First, right? Ronin is currently uh, curated, or like a permission chain, right? Uh, and there are a ton of builders that want to come onto Ronin. Our approach has been a little bit different, where we wanted we wanted to initially, right, curate uh, and have like, very high signal, high quality uh, games. We felt like we could pick some winners, then, right, okay, we learned a lot through that and then we scale it up. Cuz we don't want to scale up like, a system that we don't understand how to uh, how how it operates. Right? So, basically, we'll be opening up the Ronin chain, um, for like permissionless deployment. Um, I think that'll be a huge catalyst where okay, a lot of new builders will start exploring Ronin and introducing their uh, respective user bases uh, to the chain. Uh, two is right, like, exploration of our long-term scaling strategy, right? So, I I believe that uh, Ronin is a bit discounted and when it comes to monetary premium because right now it's seen as an Ethereum EVM side chain um, but uh, I think that as we solidify our plans for long-term scaling, right? That will uh, that's an opportunity, right, to become closer to the rest of the Ethereum ecosystem, right? Depending on uh, what we choose, right? Whether right now we're like uh, working with the Polygon CDK, uh, for example, right? To basically uh, deploy um, ZKVM on top of Ronin, right? So, I think that's that's another uh, catalyst that we have uh, up and coming. And I think third is just the narrative, right? Like, we've been focused on getting real users, right? So, you can't do everything, right? Uh, we've been focused on uh, getting users and uh, adoption, and we prioritize that rather than, right, just uh, trying to market to Yeah. uh, crypto whales and stuff like that, right? I think all it's our approach is more into to get users, to get uh, demonstrable traction uh, and and to kind of go from there, whereas I think a lot of projects, right, mainly focus on token marketing, um, and and that side of and that side of the coin. Uh, whereas, you know, we've seen that traction eventually uh, manifests, or it turns into uh, you know, uh, market cap. Yeah, because you can monetize it. You can do once you have that base, that foundation, especially in this new regime as you kind of alluded to, you can then build off that, right? It where it's starting the other way. You kind of put your the the wrong foot forward first and so yeah. And to your point earlier, you guys have done a great job with retention. And and so, you guys have planted the seed, you've gotten the community and and I think it it's a more sustainable strategy. Yeah."
  },
  {
    "speaker": "Andy",
    "content": "So, as we kind of wrap up uh, my last question is uh, around the the rise of Axie Infinity and kind of the key lessons that you learned from this meteoric rise, meteoric rise of, of Axie Infinity as a, as a community and as a game, like, for other founders who will eventually watch this and hopefully experience hopefully exponential hockey stick growth themselves of community of token price, of follower account, of audience, of, of distribution, what are some of the lessons that you learned throughout that process on keeping your head straight, building for the community, and just kind of, uh, looking back on that?"
  },
  {
    "speaker": "Jeff",
    "content": "Right, well I'll take this opportunity to plug my ebook. It's called The Web3 Gaming Growth Handbook. I've gotten really, really great feedback on that."
  },
  {
    "speaker": "Andy",
    "content": "Sweet."
  },
  {
    "speaker": "Jeff",
    "content": "Kind of like a compilation of a lot of the lessons that we learned primarily on distribution, right? Like, I think everyone knows everyone is really good at, like, product development and engineering in Web3, and we're less systematic about growth. Uh, so, that's really what that book is about. Uh, so, you know, for me, uh, a lot of it was like uh, you know, how to use token incentives uh, for growth and also like, some of the drawbacks of that. Uh, how to specifically target, uh, people uh, and to have them join our ecosystem. We used to give out like targeted giveaways of Axies to CryptoKitties players to the Central Land, right? So, uh, how to pivot into something that's uh, trending, right? So, uh, last uh, cycle or like, in 2019, we realized hey, like, nobody cares about NFTs, but everyone loves DeFi. Uh, so, let's uh, explore what we can do with like, different DeFi protocols, right? And that ended up uh, oh, like, having a lot of implications for, right, the birth of play to earn, which was basically just a combination of gaming and DeFi. Um, so, yeah, you know, I I I think like Axie, the Axie community has a ton of shared experiences, shared trauma over the years. Uh, and you know, I I think that's one of the biggest lessons, right? Is like that people are here to make connections. Um, you know, of of course people are here to, right, gain economic, financial freedom for themselves. Um, that's always going to be like some aspect of crypto. Of course, but you know, there is a ton of value in the communities and the memories that you're creating, and you know, we've had to think a lot about, right, like how do you create, like, uh, almost like, emotional uh, or like yeah, emotional value in your ecosystem. Uh, that's not just relying purely on incentives."
  },
  {
    "speaker": "Andy",
    "content": "Yeah, because you can monetize it. You can do once you have that base, that foundation, especially in this new regime as you kind of alluded to, you can then build off that, right? It where starting the the other way. You kind of put your the the wrong foot forward first. And so, yeah."
  },
  {
    "speaker": "Rob",
    "content": "And to your point earlier, you guys have done a great job with retention. And, and so, you guys are planted to see, you've gotten the community and and I think it's a more sustainable strategy. Yeah."
  }
]